{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/7bdb01b0-78a6-4e5b-af44-65e2ea893efd",
    "name":  "7bdb01b0-78a6-4e5b-af44-65e2ea893efd",
    "etag":  "\"17004d58-0000-2700-0000-63c81a7b0000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "PT5H",
                       "queryPeriod":  "PT5H",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "Medium",
                       "query":  "SecurityEvent \n| where EventSourceName matches regex \"AD FS Auditing\" and EventID == 4719\n",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5H",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  [

                                                                                                           ],
                                                                                   "groupByCustomDetails":  [

                                                                                                            ]
                                                                               }
                                                 },
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [
                                       "DefenseEvasion"
                                   ],
                       "techniques":  [

                                      ],
                       "displayName":  "DoD365-J - ADFS System audit policy was changed.",
                       "enabled":  false,
                       "description":  "System audit policy was changed. Monitoring for this eventID is recommended by Microsoft https://docs.microsoft.com/en-us/windows-server/identity/ad-ds/plan/appendix-l--events-to-monitor",
                       "alertRuleTemplateName":  null,
                       "lastModifiedUtc":  "2023-01-18T16:12:43.0811816Z"
                   }
}
