{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/4118c5cd-1c06-4ab4-a096-87a4d9b1ae0e",
    "name":  "4118c5cd-1c06-4ab4-a096-87a4d9b1ae0e",
    "etag":  "\"1700a949-0000-2700-0000-63c8190e0000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "PT1H",
                       "queryPeriod":  "PT1H",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "Medium",
                       "query":  "OfficeActivity\r\n| where RecordType has \"ExchangeAdmin\" and Operation has \"Set-Mailbox\" and Parameters has \"ForwardingSmtpAddress\"\r\n| extend Value_ = tostring(parse_json(Parameters)[1].Value)\r\n| extend Value_2 = tostring(parse_json(Parameters)[2].Value)\r\n| where Value_ !has \".mil\" and Value_ !has \".gov\" and Value_ !has \"usna.edu\" and Value_ !has \"nps.edu\" and Value_ !has \"usnwc.edu\" and Value_ !has \"dliflc.edu\" and Value_ !has \"cfe-dmha.org\" and Value_2 !has \".mil\" and Value_2 !has \".gov\" and Value_2 !has \"usna.edu\" and Value_2 !has \"nps.edu\" and Value_2 !has \"usnwc.edu\" and Value_2 !has \"dliflc.edu\" and Value_2 !has \"cfe-dmha.org\" and isnotempty(Value_) and isnotempty(Value_2)\r\n//and Value_ !has \"nexweb.org\" and Value_2 !has \"nexweb.org\"\r\n| sort by TimeGenerated desc\r\n| project TimeGenerated, UserId, Value_, Operation",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5H",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  [

                                                                                                           ],
                                                                                   "groupByCustomDetails":  [

                                                                                                            ]
                                                                               }
                                                 },
                       "entityMappings":  [
                                              {
                                                  "entityType":  "Account",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "FullName",
                                                                            "columnName":  "UserId"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "Account",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "FullName",
                                                                            "columnName":  "Value_"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "Account",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "FullName",
                                                                            "columnName":  "Operation"
                                                                        }
                                                                    ]
                                              }
                                          ],
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [
                                       "Exfiltration"
                                   ],
                       "techniques":  [

                                      ],
                       "displayName":  "DoD365-J - SMTPForwardingAddress Set to Non-DOD Domain Detected",
                       "enabled":  false,
                       "description":  "",
                       "alertRuleTemplateName":  null,
                       "lastModifiedUtc":  "2023-01-18T16:06:38.7051603Z"
                   }
}
