{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/63537ab4-7db0-437f-963c-f37de668df45",
    "name":  "63537ab4-7db0-437f-963c-f37de668df45",
    "etag":  "\"17001b89-0000-2700-0000-63c81f8c0000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "P1D",
                       "queryPeriod":  "P7D",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "Medium",
                       "query":  "let timeframe = 1d;\n// Adjust for a longer timeframe for identifying ADFS Servers\nlet lookback = 6d;\n// Identify ADFS Servers\nlet ADFS_Servers = (\n    union\n        SecurityEvent\n    | where TimeGenerated \u003e ago(timeframe + lookback)\n    | where EventID == 4688 and SubjectLogonId != \"0x3e4\"\n    | where ProcessName has \"Microsoft.IdentityServer.ServiceHost.exe\"\n    | distinct Computer\n    );\nunion\n    SecurityEvent\n| where TimeGenerated \u003e ago(timeframe)\n| where Computer in~ (ADFS_Servers)\n| where Account !endswith \"$\"\n// Check for scheduled task events\n| where EventID in (4697, 4698, 4699, 4700, 4701, 4702)\n| extend EventDataParsed = parse_xml(EventData)\n| extend SubjectLogonId = tostring(EventDataParsed.EventData.Data[3][\"#text\"])\n// Check specifically for access to IPC$ share and PIPE\\svcctl and PIPE\\atsvc for Service Control Services and Schedule Control Services\n| union ( \n    SecurityEvent\n    | where TimeGenerated \u003e ago(timeframe)\n    | where Computer in~ (ADFS_Servers)\n    | where Account !endswith \"$\"\n    | where EventID == 5145\n    | where RelativeTargetName =~ \"svcctl\" or RelativeTargetName =~ \"atsvc\"\n    )\n// Check for lateral movement\n| join kind=inner\n    (union\nSecurityEvent\n    | where TimeGenerated \u003e ago(timeframe)\n    | where Account !endswith \"$\"\n    | where EventID == 4624 and LogonType == 3\n    )\n    on $left.SubjectLogonId == $right.TargetLogonId\n| project TimeGenerated, Account, Computer, EventID, RelativeTargetName\n| extend\n    timestamp = TimeGenerated,\n    HostCustomEntity = Computer,\n    AccountCustomEntity = Account\n\n",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5H",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  [

                                                                                                           ],
                                                                                   "groupByCustomDetails":  [

                                                                                                            ]
                                                                               }
                                                 },
                       "entityMappings":  [
                                              {
                                                  "entityType":  "Account",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "FullName",
                                                                            "columnName":  "Account"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "Host",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "FullName",
                                                                            "columnName":  "Computer"
                                                                        }
                                                                    ]
                                              }
                                          ],
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [
                                       "LateralMovement"
                                   ],
                       "techniques":  [

                                      ],
                       "displayName":  "DoD365-J - SMB/Remote Code Execution on ADFS Server",
                       "enabled":  false,
                       "description":  "This query detects instances where an attacker has gained the ability to execute code on an ADFS Server through SMB and Remote Service or Scheduled Task.",
                       "alertRuleTemplateName":  null,
                       "lastModifiedUtc":  "2023-01-18T16:34:19.9472508Z"
                   }
}
