{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/18246141-7416-4575-acaa-fd46be1e0e21",
    "name":  "18246141-7416-4575-acaa-fd46be1e0e21",
    "etag":  "\"17002b32-0000-2700-0000-63c816e20000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "PT15M",
                       "queryPeriod":  "PT15M",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "High",
                       "query":  "SecurityEvent\n| where EventSourceName matches regex \"AD FS Auditing\" and EventID == 1007\n\n",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5H",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  [

                                                                                                           ],
                                                                                   "groupByCustomDetails":  [

                                                                                                            ]
                                                                               }
                                                 },
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [
                                       "Persistence",
                                       "Exfiltration",
                                       "CredentialAccess"
                                   ],
                       "techniques":  [

                                      ],
                       "displayName":  "DoD365-J - ADFS Certificate export",
                       "enabled":  false,
                       "description":  "By default exporting a certificate from ADFS will generate an event with eventID 1007 in the Microsoft-Windows-CertificateServicesClient-Lifecycle-System Windows Event Log. The extraction of a certificate is often part of attempts by attackers to subvert federated security setups and this event should be very carefully examined.",
                       "alertRuleTemplateName":  null,
                       "lastModifiedUtc":  "2023-01-18T15:57:22.769803Z"
                   }
}
