{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/ddd453a0-ae22-4048-9668-710fc6169e3a",
    "name":  "ddd453a0-ae22-4048-9668-710fc6169e3a",
    "etag":  "\"1700f663-0000-2700-0000-63c81bb30000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "PT1H",
                       "queryPeriod":  "PT1H",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "Medium",
                       "query":  "SecurityEvent\n| where EventSourceName matches regex \"AD FS Auditing\"\n    and EventID == 510\n    and EventData contains \"Configuration: Type: IssuanceAuthority\"\n",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5H",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  [

                                                                                                           ],
                                                                                   "groupByCustomDetails":  [

                                                                                                            ]
                                                                               }
                                                 },
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [
                                       "Persistence",
                                       "PrivilegeEscalation"
                                   ],
                       "techniques":  [

                                      ],
                       "displayName":  "DoD365-J - Potential new ADFS added",
                       "enabled":  false,
                       "description":  "An attacker gaining administrative access to ADFS may, instead of extracting the certificate and private key for a standard Golden SAML attack, add a new trusted ADFS. This approach will enable them to sign valid SAML responses and gain persistent access to resources, while evading detection. This attack can be detected by monitoring the creation of new ADFS trust, which this event may correspond to. It also may be benign and authorized change.",
                       "alertRuleTemplateName":  null,
                       "lastModifiedUtc":  "2023-01-18T16:17:55.5747145Z"
                   }
}
