{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/3384a671-0595-43b9-ac6b-b2a6abe51675",
    "name":  "3384a671-0595-43b9-ac6b-b2a6abe51675",
    "etag":  "\"160037d9-0000-2700-0000-63c80def0000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "PT5M",
                       "queryPeriod":  "PT5M",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "High",
                       "query":  "AuditLogs \n| where TargetResources[1].id == \"cde2267a-071c-4798-826f-e184ed7f4260\"\n| project TimeGenerated, ActivityDisplayName, GroupName = parse_json(tostring(parse_json(tostring(TargetResources[0].modifiedProperties))[1].newValue)), InitiatedBy = parse_json(tostring(InitiatedBy.user)).userPrincipalName, TargetUser = TargetResources[0].userPrincipalName\n",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5H",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  [

                                                                                                           ],
                                                                                   "groupByCustomDetails":  [

                                                                                                            ]
                                                                               }
                                                 },
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [

                                   ],
                       "techniques":  [

                                      ],
                       "displayName":  "DoD365-J - Add/Remove to CSSP Admin (Tier 3)",
                       "enabled":  false,
                       "description":  "Changes made to the N34 MSFT Tier 3 membership",
                       "alertRuleTemplateName":  null,
                       "lastModifiedUtc":  "2023-01-18T15:19:11.1415107Z"
                   }
}
