{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/bb351322-f8bc-463f-b7e2-8c6a9d40beb1",
    "name":  "bb351322-f8bc-463f-b7e2-8c6a9d40beb1",
    "etag":  "\"1700ee4a-0000-2700-0000-63c819290000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "PT5H",
                       "queryPeriod":  "PT5H",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "Medium",
                       "query":  "SecurityEvent\n| where EventSourceName matches regex \"AD FS Auditing\" and EventID == 4890\n\n",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5H",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  [

                                                                                                           ],
                                                                                   "groupByCustomDetails":  [

                                                                                                            ]
                                                                               }
                                                 },
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [

                                   ],
                       "techniques":  [

                                      ],
                       "displayName":  "DoD365-J - ADFS  certificate manager settings for Certificate Services changed",
                       "enabled":  false,
                       "description":  "The certificate manager settings for Certificate Services changed. Monitoring for this eventID is recommended by Microsoft https://docs.microsoft.com/en-us/windows-server/identity/ad-ds/plan/appendix-l--events-to-monitor",
                       "alertRuleTemplateName":  null,
                       "lastModifiedUtc":  "2023-01-18T16:07:05.4934924Z"
                   }
}
