{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/c1d61039-12d7-4069-8500-ffe99282657d",
    "name":  "c1d61039-12d7-4069-8500-ffe99282657d",
    "etag":  "\"a701a7d9-0000-2700-0000-636901090000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "P1D",
                       "queryPeriod":  "P1D",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "Informational",
                       "query":  "// This query groups malicious URLs by Sender and produces a query for EEMSG\u0027s WCF Domain check and TSD Dashboards.\r\nlet FlaggedURL = SecurityAlert\r\n    | where AlertName has \"Email messages containing malicious URL removed after delivery\"\r\n    | extend parsedEntities = parse_json(Entities)\r\n    | mv-expand parsedEntities\r\n    | extend ref = parsedEntities[\u0027$ref\u0027]\r\n    | where isempty(ref)\r\n    | project-away ref\r\n    | extend FlaggedURL = parsedEntities.Url\r\n    | where isnotempty(FlaggedURL)\r\n    | summarize FlaggedURL = make_set(FlaggedURL);\r\n    //Produces a list URLs that were flagged by defender\r\nSecurityAlert\r\n| where AlertName has \"Email messages containing malicious URL removed after delivery\"\r\n| extend parsedEntities = parse_json(Entities)\r\n| mv-expand parsedEntities\r\n| extend ref = parsedEntities[\u0027$ref\u0027]\r\n| where isempty(ref)\r\n| project-away ref\r\n| extend Sender = parsedEntities.Sender\r\n| where isnotempty(Sender)\r\n| extend Recipient = parsedEntities.Recipient\r\n| extend Subject = parsedEntities.Subject\r\n| extend URLList = parsedEntities.Urls\r\n| mv-apply URLList on ( \r\n    where URLList  in (FlaggedURL)\r\n    )\r\n    // only returns Malicious URL out of all the URLs included in the email\r\n| extend DeliveryAction = parsedEntities.DeliveryAction\r\n| extend DeliveryLocation = parsedEntities.DeliveryLocation\r\n| extend DeliveryStatus = iif(isnotempty(Sender), strcat(DeliveryAction, \" and sent to \", DeliveryLocation), \u0027\u0027)\r\n| extend tostring(Sender), tostring(Recipient), tostring(Subject), FlaggedURL = tostring(URLList), tostring(DeliveryLocation), tostring(DeliveryStatus), tostring(DeliveryAction), tostring(parsedEntities)\r\n| distinct Sender, Recipient, Subject, FlaggedURL\r\n| extend UrlDecontruct = split(FlaggedURL, \"/\")\r\n| extend WCFQuery = tostring(UrlDecontruct[2])\r\n| extend TSDQuery = strcat(\u0027Sender = \"*\u0027, Sender, \u0027*\"\u0027,\u0027 OR \u0027, \u0027 subject = \"*\u0027, Subject, \u0027*\"\u0027, \u0027 AND \u0027, \u0027 URLs = \"*\u0027, WCFQuery, \u0027*\"\u0027)\r\n| summarize Recipient = make_set(Recipient) by Sender,Subject, FlaggedURL, WCFQuery, TSDQuery\r\n| project Sender, Recipient, Subject, FlaggedURL, WCFQuery, TSDQuery\r\n| sort by Sender asc\r\n| extend URL_0_Url = FlaggedURL",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5H",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  [

                                                                                                           ],
                                                                                   "groupByCustomDetails":  [

                                                                                                            ]
                                                                               }
                                                 },
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [
                                       "InitialAccess"
                                   ],
                       "techniques":  [
                                          "T1566"
                                      ],
                       "displayName":  "EEMSG Malicious URL TSD \u0026 WCF Query",
                       "enabled":  false,
                       "description":  "This query groups malicious URLs by Sender and produces a query for EEMSG\u0027s WCF Domain check and TSD Dashboards. -- Analytic disabled 11/07/22 -- Check CI/CD submission app for reasoning.\n",
                       "alertRuleTemplateName":  null,
                       "lastModifiedUtc":  "2022-11-07T12:58:49.488785Z"
                   }
}
