{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/b285d042-9526-49c7-a8c2-8b468e3ee125",
    "name":  "b285d042-9526-49c7-a8c2-8b468e3ee125",
    "etag":  "\"ce00ff2e-0000-2700-0000-62d57a5a0000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "PT1H",
                       "queryPeriod":  "PT1H",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "Medium",
                       "query":  "SigninLogs\n| where ResultType == 500121\n| where Status has \"MFA Denied; user declined the authentication\"\n| extend UserPrinciaplNameCustomEntity = UserPrincipalName\n| extend IPCustomEntity = IPAddress\n| extend URLCustomEntity = ClientAppUsed",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5H",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  [

                                                                                                           ],
                                                                                   "groupByCustomDetails":  [

                                                                                                            ]
                                                                               }
                                                 },
                       "entityMappings":  [
                                              {
                                                  "entityType":  "IP",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "Address",
                                                                            "columnName":  "IPCustomEntity"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "URL",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "Url",
                                                                            "columnName":  "URLCustomEntity"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "Account",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "FullName",
                                                                            "columnName":  "UserPrincipalName"
                                                                        }
                                                                    ]
                                              }
                                          ],
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [
                                       "CredentialAccess"
                                   ],
                       "techniques":  [
                                          "T1110"
                                      ],
                       "displayName":  "Explicit MFA Deny",
                       "enabled":  true,
                       "description":  "User explicitly denies MFA push, indicating that login was not expected and the account\u0027s password may be compromised.",
                       "alertRuleTemplateName":  "a22740ec-fc1e-4c91-8de6-c29c6450ad00",
                       "lastModifiedUtc":  "2022-07-18T15:20:57.8544753Z"
                   }
}
