{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/5b2a1d65-62ca-4eca-8aa0-f93d772696d0",
    "name":  "5b2a1d65-62ca-4eca-8aa0-f93d772696d0",
    "etag":  "\"8700064a-0000-2700-0000-66fdc0a00000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "PT1H",
                       "queryPeriod":  "PT1H",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "Medium",
                       "query":  "let main = () {\r\n    let findErrors=SigninLogs\r\n        | where TimeGenerated \u003e ago(24h)\r\n        | where AppDisplayName == \"Azure Portal\"\r\n        | extend errorCode_ = tostring(Status.errorCode)\r\n        | where errorCode_ != \"0\"\r\n        | extend city_ = tostring(LocationDetails.city), state_ = tostring(LocationDetails.state)\r\n        | extend Results = strcat(errorCode_, \"--\", ResultDescription)\r\n        | extend temp = iif(UserDisplayName contains \",\" or UserDisplayName contains \" \", UserDisplayName, \"temp\");\r\n    let lookup = findErrors\r\n        | where temp == \"temp\"\r\n        | summarize make_set(UserDisplayName);\r\n    findErrors\r\n    | join kind=leftouter (userlookup\r\n        | where AccountObjectId in ([\u0027lookup\u0027]))\r\n        on $left.UserDisplayName == $right.AccountObjectId\r\n    | extend UserDisplayName = iif(temp == \"temp\", AccountDisplayName, UserDisplayName)\r\n    | extend Email = iif(UserPrincipalName !has \u0027@\u0027, user, UserPrincipalName)\r\n    | project\r\n        TimeGenerated,\r\n        UserDisplayName,\r\n        Results,\r\n        IPAddress,\r\n        AuthMethod = MfaDetail.authMethod,\r\n        Email\r\n    // Remove timeouts\r\n| where Results !startswith \"70044\"\r\n};\r\nlet getCountbyResultandIPAddresses =() {\r\n    main\r\n    | summarize ResultCount = count(), IPAddress=make_set(IPAddress) by UserDisplayName, Results\r\n};\r\nlet getCountTotalbyUserandTimeStamps =() {\r\n    main\r\n    | summarize StartTime=min(TimeGenerated), EndTime=max(TimeGenerated), TotalCount = count() by UserDisplayName\r\n};\r\nmain\r\n| join (getCountbyResultandIPAddresses) on UserDisplayName, Results\r\n| extend Results = pack(\"Results\", Results, \"Count\", ResultCount)\r\n| summarize\r\n    Results = make_set(Results),\r\n    IPAddress = make_set(IPAddress1),\r\n    AuthMethod = make_set(AuthMethod)\r\n    by UserDisplayName, Email\r\n| join (getCountTotalbyUserandTimeStamps) on UserDisplayName\r\n| extend AuthMethod = iif(AuthMethod == \"[]\", \"Failed at Conditional Access; Not Triggered\", AuthMethod)\r\n| extend DrillDownQuery = strcat(\"SigninLogs | where TimeGenerated between (datetime(\", StartTime, \") .. datetime(\", EndTime, \"))\", \"|where UserDisplayName ==\", \u0027\"\u0027, UserDisplayName, \u0027\" | where ResultType != 0\u0027)\r\n| project\r\n    StartTime,\r\n    EndTime,\r\n    TotalCount,\r\n    Email,\r\n    UserDisplayName,\r\n    IPAddress,\r\n    AuthMethod,\r\n    Results,\r\n    DrillDownQuery\r\n| mv-expand IPAddress, Results\r\n| where IPAddress !startswith \"140.\" or TotalCount \u003e 4\r\n| where IPAddress startswith \"140.\" or TotalCount \u003e 4\r\n| summarize Results = make_set(Results), TotalCount = make_set(TotalCount), IPAddress = make_set(IPAddress), AuthMethod = make_set(AuthMethod) by StartTime, EndTime, Email, UserDisplayName, DrillDownQuery\r\n// **IMPORTANT** The query column holds the DrillDownQuery you can use to investigate the individual user signin failures!",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5H",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  [

                                                                                                           ],
                                                                                   "groupByCustomDetails":  [

                                                                                                            ]
                                                                               }
                                                 },
                       "entityMappings":  [
                                              {
                                                  "entityType":  "Account",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "AadUserId",
                                                                            "columnName":  "Email"
                                                                        }
                                                                    ]
                                              }
                                          ],
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [
                                       "CredentialAccess",
                                       "Discovery"
                                   ],
                       "techniques":  [
                                          "T1110",
                                          "T1087"
                                      ],
                       "displayName":  "Failed Azure Portal Logons",
                       "enabled":  true,
                       "description":  "This query looks for failed Azure portal logons at a certain threshold. It does not display timeouts.\nCurrent settings are failed attempts greater than 4 in a 24 hour period.\n\nPLATFORM:Azure AD,Microsoft 365,IaaS,Windows\nMITRE:TA0001;T1078;T1078.001;T1078.004,TA0004;T1078;T1078.004,TA0006;T1110;T1110.001;T1110.002;T1110.003;T1110.004",
                       "alertRuleTemplateName":  null,
                       "lastModifiedUtc":  "2024-10-02T21:52:30.785455Z"
                   }
}
