{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/989889d3-e6c0-47b8-be83-adf38450da02",
    "name":  "989889d3-e6c0-47b8-be83-adf38450da02",
    "etag":  "\"d600958c-0000-2700-0000-65a7cd650000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "PT1H",
                       "queryPeriod":  "PT1H",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "Low",
                       "query":  "let timeframe = 1d;\nlet PerUserThreshold = 0;\nlet TotalThreshold = 100;\nlet action = dynamic([\"change\", \"changed\", \"reset\"]);\nlet pWord = dynamic([\"password\", \"credentials\"]);\nlet Admins = dynamic([\"UMiller@dod365.onmicrosoft.us\", \"dodina@dod365.onmicrosoft.us\", \"jcrawford@dod365.onmicrosoft.us\", \"rBunch@dod365.onmicrosoft.us\", \"cfranklin@dod365.onmicrosoft.us\", \"KRadford@dod365.onmicrosoft.us\", \"churt@dod365.onmicrosoft.us\", \" MSookbang@dod365.onmicrosoft.us\", \"pdethier@dod365.onmicrosoft.us\", \"JLahr@dod365.onmicrosoft.us\", \"WBrown@dod365.onmicrosoft.us\", \"cgriffin@dod365.onmicrosoft.us\" ]);\nlet PasswordResetMultiDataSource =\n(union isfuzzy=true\n(//Password reset events\n//4723: An attempt was made to change an account\u0027s password\n//4724: An attempt was made to reset an accounts password\nSecurityEvent\n| where TimeGenerated \u003e= ago(timeframe)\n| where EventID in (\"4723\",\"4724\")\n| project TimeGenerated, Computer, AccountType, Account, Type),\n(//Azure Active Directory Password reset events\nAuditLogs\n| where TimeGenerated \u003e= ago(timeframe)\n| where OperationName has_any (pWord) and OperationName has_any (action)\n| extend AccountType = tostring(TargetResources[0].type), Account = tostring(TargetResources[0].userPrincipalName), TargetResourceName = tolower(tostring(TargetResources[0].displayName))\n// Added the following line to only look for GA\u0027s\n| where Account has_any (Admins)\n| project TimeGenerated, AccountType, Account, Computer = TargetResourceName, Type),\n(//OfficeActive ActiveDirectory Password reset events\nOfficeActivity\n| where TimeGenerated \u003e= ago(timeframe)\n| where OfficeWorkload == \"AzureActiveDirectory\" \n| where (ExtendedProperties has_any (pWord) or ModifiedProperties has_any (pWord)) and (ExtendedProperties has_any (action) or ModifiedProperties has_any (action))\n| extend AccountType = UserType, Account = OfficeObjectId \n| project TimeGenerated, AccountType, Account, Type, Computer = \"\"),\n(// Unix syslog password reset events\nSyslog\n| where TimeGenerated \u003e= ago(timeframe)\n| where Facility in (\"auth\",\"authpriv\")\n| where SyslogMessage has_any (pWord) and SyslogMessage has_any (action)\n| extend AccountType = iif(SyslogMessage contains \"root\", \"Root\", \"Non-Root\")\n| parse SyslogMessage with * \"password changed for\" Account\n| project TimeGenerated, AccountType, Account, Computer = HostName, Type),\n(SigninLogs\n| where TimeGenerated \u003e= ago(timeframe)\n| where OperationName =~ \"Sign-in activity\" and ResultType has_any (\"50125\", \"50133\")\n| project TimeGenerated, AccountType = AppDisplayName, Computer = IPAddress, Account = UserPrincipalName, Type\n// Added the following line to only look for GA\u0027s\n| where Account has_any (Admins)\n)\n);\nlet pwrmd = PasswordResetMultiDataSource\n| project TimeGenerated, Computer, AccountType, Account, Type;\n(union isfuzzy=true  \n(pwrmd\n| summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), Computer = makeset(Computer), AccountType = makeset(AccountType), Total=count() by Account, Type\n// removed the threshold because the query is only looking at GA\u0027s now\n//| where Total \u003e PerUserThreshold\n| extend ResetPivot = \"PerUserReset\"),  \n(pwrmd\n| summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), Computer = makeset(Computer), Account = tostring(makeset(Account)), AccountType = makeset(AccountType), Total=count() by Type\n// removed the threshold because the query is only looking at GA\u0027s now\n//| where Total \u003e TotalThreshold\n| extend ResetPivot = \"TotalUserReset\")\n)",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5H",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  [

                                                                                                           ],
                                                                                   "groupByCustomDetails":  [

                                                                                                            ]
                                                                               }
                                                 },
                       "entityMappings":  [
                                              {
                                                  "entityType":  "Account",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "FullName",
                                                                            "columnName":  "Account"
                                                                        }
                                                                    ]
                                              }
                                          ],
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [
                                       "InitialAccess",
                                       "CredentialAccess"
                                   ],
                       "techniques":  [
                                          "T1078",
                                          "T1110"
                                      ],
                       "displayName":  "Multiple Password Reset by user",
                       "enabled":  true,
                       "description":  " This query will determine multiple password resets by user across multiple data sources. \nAccount manipulation including password reset may aid adversaries in maintaining access to credentials \nand certain permission levels within an environment.\n\nThis query only looks for password resets done by/for Global Administrator accounts. Password resets are not enabled for any other user account.",
                       "alertRuleTemplateName":  "0b9ae89d-8cad-461c-808f-0494f70ad5c4",
                       "lastModifiedUtc":  "2024-01-17T12:51:48.618356Z"
                   }
}
