{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/ed72b504-a7cc-4290-ae72-6d8dfbeee3f9",
    "name":  "ed72b504-a7cc-4290-ae72-6d8dfbeee3f9",
    "etag":  "\"f304024f-0000-2700-0000-62b99c5c0000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "P7D",
                       "queryPeriod":  "P8D",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "Low",
                       "query":  "// a threshold can be enabled, see commented line below for PrevSeenCount\n//let threshold = 2;\nlet uploadOp = \u0027FileUploaded\u0027;\n// Extensions that are interesting. Add/Remove to this list as you see fit\nlet execExt = dynamic([\u0027exe\u0027, \u0027inf\u0027, \u0027gzip\u0027, \u0027cmd\u0027, \u0027bat\u0027]);\nlet starttime = 8d;\nlet endtime = 1d;\nOfficeActivity \n| where TimeGenerated between (ago(starttime) .. ago(endtime))\n// Limited to File Uploads due to potential noise, comment out the Operation statement below to include any operation type\n// Additional, but potentially noisy operation types that include Uploads and Downloads can be included by adding the following - Operation contains \"upload\" or Operation contains \"download\"\n| where Operation =~ uploadOp\n| where SourceFileExtension has_any (execExt)\n| project TimeGenerated, OfficeId, OfficeWorkload, RecordType, Operation, UserType, UserKey, UserId, ClientIP, UserAgent, Site_Url, SourceRelativeUrl, SourceFileName\n| extend SiteUrlUserFolder = tolower(split(Site_Url, \u0027/\u0027)[-2])\n| extend UserIdUserFolderFormat = tolower(replace(\u0027@|\\\\.\u0027, \u0027_\u0027,UserId))\n// identify when UserId is not a match to the specific site url personal folder reference\n| extend UserIdDiffThanUserFolder = iff(Site_Url has \u0027/personal/\u0027 and SiteUrlUserFolder != UserIdUserFolderFormat, true , false ) \n// identify if any files have been deleted since being uploaded\n| join kind= leftanti (\n    OfficeActivity \n    | where TimeGenerated between (ago(starttime) .. ago(1m))\n    | where Operation startswith \"FileDeleted\"\n) on SourceFileName\n| summarize TimeGenerated = make_list(TimeGenerated), StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), UserAgents = make_list(UserAgent), SourceRelativeUrls = make_list(SourceRelativeUrl), FileNames = make_list(SourceFileName) by OfficeWorkload, RecordType, Operation, UserType, UserId, ClientIP, Site_Url, UserIdDiffThanUserFolder\n| project-reorder TimeGenerated, UserId, Site_Url, SourceRelativeUrls, FileNames",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  false,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5H",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  [

                                                                                                           ],
                                                                                   "groupByCustomDetails":  [

                                                                                                            ]
                                                                               }
                                                 },
                       "entityMappings":  [
                                              {
                                                  "entityType":  "Account",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "FullName",
                                                                            "columnName":  "UserId"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "IP",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "Address",
                                                                            "columnName":  "ClientIP"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "File",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "Name",
                                                                            "columnName":  "FileNames"
                                                                        }
                                                                    ]
                                              }
                                          ],
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [
                                       "CommandAndControl"
                                   ],
                       "techniques":  [
                                          "T1105"
                                      ],
                       "displayName":  "New executable via Office FileUploaded Operation",
                       "enabled":  false,
                       "description":  "Identifies when executable file types are uploaded to Office services such as SharePoint and OneDrive.\nList currently includes \u0027exe\u0027, \u0027inf\u0027, \u0027gzip\u0027, \u0027cmd\u0027, \u0027bat\u0027 file extensions.\nAdditionally, identifies when a given user is uploading these files to another users workspace.\nThis may be indication of a staging location for malware or other malicious activity.",
                       "alertRuleTemplateName":  "d722831e-88f5-4e25-b106-4ef6e29f8c13",
                       "lastModifiedUtc":  "2022-06-27T12:02:36.7926843Z"
                   }
}
