{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/c9d65cd0-7b62-4620-8b44-fcb2b70a185e",
    "name":  "c9d65cd0-7b62-4620-8b44-fcb2b70a185e",
    "etag":  "\"86036df8-0000-2700-0000-647f36c50000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "PT1H",
                       "queryPeriod":  "P14D",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "Medium",
                       "query":  "let threshold = 50;\nlet szSharePointFileOperation = \"SharePointFileOperation\";\nlet szOperations = dynamic([\"FileDownloaded\", \"FileUploaded\"]);\nlet starttime = 14d;\nlet endtime = 1h;\nlet historicalActivity =\n    OfficeActivity\n    | where TimeGenerated between(ago(starttime) .. ago(endtime))\n    | where RecordType =~ szSharePointFileOperation\n    | where Operation in~ (szOperations)\n    | summarize historicalCount = count() by ClientIP, RecordType, Operation;\nlet recentActivity = OfficeActivity\n    | where TimeGenerated \u003e ago(endtime)\n    | where RecordType =~ szSharePointFileOperation\n    | where Operation in~ (szOperations)\n    | summarize min(Start_Time), max(Start_Time), recentCount = count() by ClientIP, RecordType, Operation;\nlet RareIP = recentActivity\n    | join kind= leftanti (historicalActivity) on ClientIP, RecordType, Operation\n    // More than 50 downloads/uploads from a new IP\n    | where recentCount \u003e threshold;\nOfficeActivity\n| where TimeGenerated \u003e= ago(endtime)\n| where RecordType =~ szSharePointFileOperation\n| where Operation in~ (szOperations)\n| join kind= inner (RareIP) on ClientIP, RecordType, Operation\n| where Start_Time between(min_Start_Time .. max_Start_Time)\n| summarize StartTimeUtc = min(min_Start_Time), EndTimeUtc = max(max_Start_Time)\n    by\n    RecordType,\n    Operation,\n    UserType,\n    UserId,\n    ClientIP,\n    OfficeWorkload,\n    Site_Url,\n    OfficeObjectId,\n    UserAgent,\n    TotalFiles = recentCount\n| extend\n    TimeGenerated = StartTimeUtc,\n    UserAccount = UserId,\n    IPCustomEntity = ClientIP,\n    Site_URL = Site_Url\n| summarize IPsList = make_list(IPCustomEntity)\n    by\n    TimeGenerated,\n    UserAccount,\n    Site_URL,\n    RecordType,\n    Operation,\n    UserType,\n    OfficeWorkload,\n    UserAgent,\n    StartTimeUtc,\n    EndTimeUtc,\n    TotalFiles\n| extend IP = IPsList\n| mv-expand IP\n| distinct\n    TimeGenerated,\n    UserAccount,\n    tostring(IP),\n    TotalFiles,\n    Site_URL,\n    RecordType,\n    Operation,\n    UserType,\n    OfficeWorkload,\n    UserAgent,\n    StartTimeUtc,\n    EndTimeUtc",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5M",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  [

                                                                                                           ],
                                                                                   "groupByCustomDetails":  [

                                                                                                            ]
                                                                               }
                                                 },
                       "entityMappings":  [
                                              {
                                                  "entityType":  "Account",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "FullName",
                                                                            "columnName":  "UserAccount"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "IP",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "Address",
                                                                            "columnName":  "IP"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "URL",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "Url",
                                                                            "columnName":  "Site_URL"
                                                                        }
                                                                    ]
                                              }
                                          ],
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [
                                       "Exfiltration"
                                   ],
                       "techniques":  [
                                          "T1030"
                                      ],
                       "displayName":  "SharePointFileOperation via previously unseen IPs V 2.0",
                       "enabled":  false,
                       "description":  "Identifies when the volume of documents uploaded to or downloaded from Sharepoint by new IP addresses\nexceeds a threshold (default is 50).",
                       "alertRuleTemplateName":  "4b11568b-3f5f-4ba1-80c8-7f1dc8390eb7",
                       "lastModifiedUtc":  "2023-06-06T13:38:13.6439005Z"
                   }
}
