{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/74812d3b-21a5-43fb-973f-71c38a74aaf0",
    "name":  "74812d3b-21a5-43fb-973f-71c38a74aaf0",
    "etag":  "\"8600980a-0000-2700-0000-66fdae700000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "PT1H",
                       "queryPeriod":  "P14D",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "Medium",
                       "query":  "let starttime = 14d;\nlet endtime = 1d;\n// The number of operations below which an IP address is considered an unusual source of role assignment operations\nlet alertOperationThreshold = 5;\nlet createRoleAssignmentActivity = AzureActivity\n| where OperationName == \"Create role assignment\";\ncreateRoleAssignmentActivity \n| where TimeGenerated between (ago(starttime) .. ago(endtime))\n| summarize count() by CallerIpAddress, Caller\n| where count_ \u003e= alertOperationThreshold\n| join kind = rightanti ( \ncreateRoleAssignmentActivity\n| where TimeGenerated \u003e ago(endtime)\n| summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), ActivityTimeStamp = makelist(TimeGenerated), ActivityStatus = makelist(ActivityStatus), \nOperationIds = makelist(OperationId), CorrelationId = makelist(CorrelationId), ActivityCountByCallerIPAddress = count()  \nby ResourceId, CallerIpAddress, Caller, OperationName, Resource, ResourceGroup\n) on CallerIpAddress, Caller\n| extend timestamp = StartTimeUtc, AccountCustomEntity = Caller, IPCustomEntity = CallerIpAddress",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5M",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  [

                                                                                                           ],
                                                                                   "groupByCustomDetails":  [

                                                                                                            ]
                                                                               }
                                                 },
                       "entityMappings":  [
                                              {
                                                  "entityType":  "Account",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "FullName",
                                                                            "columnName":  "AccountCustomEntity"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "IP",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "Address",
                                                                            "columnName":  "IPCustomEntity"
                                                                        }
                                                                    ]
                                              }
                                          ],
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [
                                       "Persistence",
                                       "PrivilegeEscalation"
                                   ],
                       "techniques":  [
                                          "T1098"
                                      ],
                       "displayName":  "Suspicious granting of permissions to an account",
                       "enabled":  true,
                       "description":  "Identifies IPs from which users grant access to other users on azure resources and alerts when a previously unseen source IP address is used.\nPLATFORM:Azure AD,IaaS,Microsoft 365,Windows\nMITRE:TA0001;T1078;T1078.001;T1078.004,TA0003;T1098;T1098.001;T1098;T1098.003",
                       "alertRuleTemplateName":  "b2c15736-b9eb-4dae-8b02-3016b6a45a32",
                       "lastModifiedUtc":  "2024-10-02T20:34:56.124542Z"
                   }
}
