{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/6b62bb33-9738-4d72-94d2-80ea5253cb06",
    "name":  "6b62bb33-9738-4d72-94d2-80ea5253cb06",
    "etag":  "\"870ddcc5-0000-2700-0000-6744c4870000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "P1D",
                       "queryPeriod":  "P1D",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "Low",
                       "query":  "AuditLogs\n| where OperationName in (\"Add eligible member (permanent)\", \"Add eligible member (eligible)\", \"Add member to role\")\n| mv-apply TargetResource = TargetResources on \n    (\n    where TargetResource.type =~ \"User\"\n    | extend\n        Target = tostring(TargetResource.userPrincipalName),\n        props = TargetResource.modifiedProperties\n    )\n| mv-apply Property = props on \n    (\n    where Property.displayName =~ \"Role.DisplayName\"\n    | extend RoleName = trim(\u0027\"\u0027, tostring(Property.newValue))\n    )\n| where RoleName contains \"admin\"\n| extend InitiatingAppName = tostring(InitiatedBy.app.displayName)\n| extend InitiatingAppServicePrincipalId = tostring(InitiatedBy.app.servicePrincipalId)\n| extend InitiatingUserPrincipalName = tostring(InitiatedBy.user.userPrincipalName)\n| extend InitiatingAadUserId = tostring(InitiatedBy.user.id)\n| extend InitiatingIPAddress = tostring(InitiatedBy.user.ipAddress)\n| extend InitiatedBy = iif(isnotempty(InitiatingAppName), InitiatingAppName, InitiatingUserPrincipalName)\n| extend TargetUserPrincipalName = iff(OperationName == \"Add member to role\", tostring(TargetResources[0].userPrincipalName), tostring(TargetResources[2].userPrincipalName))\n| extend TargetAadUserId = iff(OperationName == \"Add member to role\", tostring(TargetResources[0].id), tostring(TargetResources[2].id))\n| extend AddedUser = TargetUserPrincipalName\n| extend\n    TargetAccountName = tostring(split(TargetUserPrincipalName, \"@\")[0]),\n    TargetAccountUPNSuffix = tostring(split(TargetUserPrincipalName, \"@\")[1])\n| extend\n    InitiatingAccountName = tostring(split(InitiatingUserPrincipalName, \"@\")[0]),\n    InitiatingAccountUPNSuffix = tostring(split(InitiatingUserPrincipalName, \"@\")[1])\n| where not(AddedUser endswith \"dod365.adm.mil\" and InitiatedBy == \"MS-PIM-Fairfax\")\n| project-reorder TimeGenerated, AddedUser, RoleName, InitiatedBy",
                       "suppressionDuration":  "PT1H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5H",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  [

                                                                                                           ],
                                                                                   "groupByCustomDetails":  [

                                                                                                            ]
                                                                               }
                                                 },
                       "entityMappings":  [
                                              {
                                                  "entityType":  "Account",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "FullName",
                                                                            "columnName":  "TargetUserPrincipalName"
                                                                        },
                                                                        {
                                                                            "identifier":  "Name",
                                                                            "columnName":  "TargetAccountName"
                                                                        },
                                                                        {
                                                                            "identifier":  "UPNSuffix",
                                                                            "columnName":  "TargetAccountUPNSuffix"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "Account",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "AadUserId",
                                                                            "columnName":  "TargetAadUserId"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "Account",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "FullName",
                                                                            "columnName":  "InitiatingUserPrincipalName"
                                                                        },
                                                                        {
                                                                            "identifier":  "Name",
                                                                            "columnName":  "InitiatingAccountName"
                                                                        },
                                                                        {
                                                                            "identifier":  "UPNSuffix",
                                                                            "columnName":  "InitiatingAccountUPNSuffix"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "Account",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "AadUserId",
                                                                            "columnName":  "InitiatingAadUserId"
                                                                        }
                                                                    ]
                                              }
                                          ],
                       "templateVersion":  "1.0.4",
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [
                                       "PrivilegeEscalation"
                                   ],
                       "techniques":  [
                                          "T1078"
                                      ],
                       "displayName":  "User Added to Admin Role",
                       "enabled":  true,
                       "description":  "Detects a user being added to a new privileged role. Monitor these additions to ensure the users are made eligible for these roles are intended to have these levels of access.\n  Ref: https://docs.microsoft.com/azure/active-directory/fundamentals/security-operations-privileged-accounts#changes-to-privileged-accounts",
                       "alertRuleTemplateName":  "2a09f8cb-deb7-4c40-b08b-9137667f1c0b",
                       "lastModifiedUtc":  "2024-11-25T18:40:07.3997196Z"
                   }
}
