{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/e208303b-ca62-4c39-8915-661ff49ada98",
    "name":  "e208303b-ca62-4c39-8915-661ff49ada98",
    "etag":  "\"5101f478-0000-2700-0000-66ba5e890000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "PT8H",
                       "queryPeriod":  "PT8H",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "High",
                       "query":  "AuditLogs\n| where OperationName == \"Add member to role\"\n| extend Initiator = parse_json(InitiatedBy)\n| mv-expand Initiator\n| extend InitiatorDisplayName = parse_json(Initiator.app.displayName)\n| extend TargetRes = parse_json(TargetResources)\n| mv-expand TargetRes\n| extend UserWithNewRole = parse_json(TargetRes.userPrincipalName)\n| where isnotempty(UserWithNewRole)\n| extend ModProps = parse_json(TargetRes.modifiedProperties)\n| mv-expand ModProps\n| extend NewAssignedRole = parse_json(ModProps.newValue)\n| where NewAssignedRole contains \"Global Administrator\"\n| project-away Initiator, TargetRes, ModProps\n| project InitiatorDisplayName, UserWithNewRole, NewAssignedRole",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5H",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  [

                                                                                                           ],
                                                                                   "groupByCustomDetails":  [

                                                                                                            ]
                                                                               }
                                                 },
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [
                                       "Impact",
                                       "Persistence",
                                       "PrivilegeEscalation"
                                   ],
                       "techniques":  [
                                          "T0831",
                                          "T1136",
                                          "T1484"
                                      ],
                       "displayName":  "[UnOAuthorized] DEOS_CTH_NewGlobalAdmin",
                       "enabled":  true,
                       "description":  "Track any unexpected role assignments, particularly to the Global Administrator role, which may indicate an exploitation attempt",
                       "alertRuleTemplateName":  null,
                       "lastModifiedUtc":  "2024-08-12T19:12:09.1670482Z"
                   }
}
