{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/2a7985c9-cc1b-414e-9eaf-56a64aa292c9",
    "name":  "2a7985c9-cc1b-414e-9eaf-56a64aa292c9",
    "etag":  "\"5101075b-0000-2700-0000-66ba5aac0000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "PT8H",
                       "queryPeriod":  "PT8H",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "High",
                       "query":  "AuditLogs\n| where OperationName has_any (\"Add member to\", \"Remove member\", \"Process role\", \"Add app\")\n| extend AssignedRole = tostring(parse_json(TargetResources[0].modifiedProperties[1].newValue))\n| where AssignedRole contains \"Global\" and AssignedRole has_any (\"admin\", \"Admin\", \"administrator\", \"Administrator\")\n| summarize count() by AssignedRole\n",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5H",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  [

                                                                                                           ],
                                                                                   "groupByCustomDetails":  [

                                                                                                            ]
                                                                               }
                                                 },
                       "customDetails":  {

                                         },
                       "alertDetailsOverride":  {
                                                    "alertDynamicProperties":  [

                                                                               ]
                                                },
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [
                                       "PrivilegeEscalation"
                                   ],
                       "techniques":  [
                                          "T1484"
                                      ],
                       "displayName":  "[UnOAuthorized] DEOS_CTH_AnomalousGroupChange",
                       "enabled":  true,
                       "description":  "Set to monitor for updates or deletions to privileged roles. May indicate attack in progress.",
                       "alertRuleTemplateName":  null,
                       "lastModifiedUtc":  "2024-08-12T18:55:39.2819906Z"
                   }
}
