{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/c035adf7-b53f-4db6-9b6a-5746855cd23a",
    "name":  "c035adf7-b53f-4db6-9b6a-5746855cd23a",
    "etag":  "\"8800cb0c-0000-2700-0000-66fdcd680000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "PT1H",
                       "queryPeriod":  "PT1H",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "Medium",
                       "query":  "//Author: Matt Schwartz, Steven Wan\n//Description: This analytic checks back 14d and uses that history to determine if any new application or service principal has had its credentials changed as instituted by a new user or by a new calling resource within the polling period as configured in this analytic.\n//False Positives: May alert on non-malicious activity that is legitimate. These alerts however will be very infrequent / little. If it does fire off too often this can be reworked.\n    let starttime = now(-14d);\n    let endtime = now();\n    let excludesync = \u002706c9ca02-8129-473d-8ae9-f964890b5706\u0027;\n    let Sparrow_BaseHunt_AuditLog1=(opstable:(Category_:string,Operation:string)){\n    AuditLogs | where TimeGenerated between(starttime .. endtime) and InitiatedBy !has excludesync | join kind=inner opstable on $left.OperationName == $right.Operation | mv-expand TargetResources, AdditionalDetails, InitiatedBy| extend ib_app = \"\", ib_user = \"\", tr_modifiedProperties = dynamic(null), tr_type = \"\", tr_displayName = \"\", tr_id = \"\"| extend tr = parse_json(TargetResources), ad = parse_json(AdditionalDetails), ib = parse_json(InitiatedBy)| evaluate bag_unpack(tr, \u0027tr_\u0027, columnsConflict=\u0027replace_source\u0027)| evaluate bag_unpack(ad, \u0027ad_\u0027, columnsConflict=\u0027replace_source\u0027)| evaluate bag_unpack(ib, \u0027ib_\u0027, columnsConflict=\u0027replace_source\u0027)| extend app_actor = iif(isnotempty(ib_app),true,false)| extend obj_actor = iif(app_actor, parse_json(ib_app), parse_json(ib_user))| extend actor_id = iif(app_actor,coalesce(obj_actor.appId,obj_actor.servicePrincipalId),obj_actor.userPrincipalName)| extend actor_name = iif(app_actor,obj_actor.displayName,obj_actor.userPrincipalName)| extend actor_type = iif(app_actor,\"App\",\"User\")| extend tr_modifiedProperties = iif(tr_modifiedProperties==\"[]\",dynamic(null),tr_modifiedProperties)| mv-expand tr_modifiedProperties| extend newValue = tostring(tr_modifiedProperties.newValue)| extend oldValue = tostring(tr_modifiedProperties.oldValue)| extend set1 = parse_json(newValue)| extend set2 = parse_json(oldValue)| extend diff = set_difference(set1, set2)| parse diff with * \"KeyIdentifier=\" keyIdentifier:string \",KeyType=\" keyType:string \",KeyUsage=\" keyUsage:string \",DisplayName=\" keyDisplayName:string \"]\" *| extend credential = case(keyType != \"\", keyType, \"Other/not logged\")\n    };\n    Sparrow_BaseHunt_AuditLog1(datatable(Category_:string,Operation:string)[\n        \u0027Application_Operations\u0027,\u0027Update application\u0027,\n        \u0027Application_Operations\u0027,\u0027Update application ??? Certificates and secrets management \u0027,\n        \u0027ServicePrincipal_Operations\u0027,\"Update service principal\",\n        \u0027ServicePrincipal_Operations\u0027,\"Add service principal credentials\"\n        ])\n    | extend propertyName = tostring(tr_modifiedProperties.displayName)\n    | extend objServicePrincipal = iif(propertyName==\u0027TargetId.ServicePrincipalNames\u0027,true,false)\n    | extend diff = iif(objServicePrincipal, set_difference(pack_array(set1), pack_array(set2)), diff)\n    | extend ServicePrincipalsAffected = iif(objServicePrincipal, diff,\u0027\u0027)\n    | where (actor_name !=\"Managed Service Identity\" and actor_name !=\"\")\n    | where credential !=\"AsymmetricX509Cert\"\n    | where actor_type ==\"User\"\n    | project CreationTime = TimeGenerated, Id, CorrelationId, Category, OperationName, AADOperationType, ResultStatus = Result\n        , Version = OperationVersion, AADTenantId, ResourceId, Actor = actor_name, ActorType = actor_type\n        , ActorId = actor_id, ResourceName = tr_displayName, ResourcePrincipalId = tr_id, EventSource = SourceSystem\n        , CredentialType = credential, ServicePrincipalsAffected, ExtendedProperties = obj_actor, InitiatedBy, TargetResources\n        , ModifiedProperties = tr_modifiedProperties;",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5M",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  null,
                                                                                   "groupByCustomDetails":  null
                                                                               }
                                                 },
                       "entityMappings":  [
                                              {
                                                  "entityType":  "Account",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "AadUserId",
                                                                            "columnName":  "InitiatedBy"
                                                                        }
                                                                    ]
                                              }
                                          ],
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [
                                       "InitialAccess",
                                       "Persistence",
                                       "PrivilegeEscalation"
                                   ],
                       "techniques":  [
                                          "T1078",
                                          "T1134"
                                      ],
                       "displayName":  "BAH_AppServicePrincipal_CredentialCheck",
                       "enabled":  true,
                       "description":  "This analytic checks back 14d and uses that history to determine if any new application or service principal has had its credentials changed as instituted by a new user or by a new calling resource within the polling period as configured in this analytic.\nPLATFORM:Windows\nMITRE:TA0001;T1078;T1078.002;T1078.003,TA0003;T1078;T1078.002;T1078.003,TA0004;T1134",
                       "alertRuleTemplateName":  null,
                       "lastModifiedUtc":  "2024-10-02T22:47:03.652498Z"
                   }
}
