{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/DoD365-LAW-RG2/providers/Microsoft.OperationalInsights/workspaces/DOD365-LAW/providers/Microsoft.SecurityInsights/alertRules/1f592770-1b9d-41e1-a144-bb168e7adfb4",
    "name":  "1f592770-1b9d-41e1-a144-bb168e7adfb4",
    "etag":  "\"47187482-0000-2700-0000-67642e7f0000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "P1D",
                       "queryPeriod":  "P1D",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "Medium",
                       "query":  "//BAH_Salt_Typhoon_IOCs\n//Author: Shawn McWhirter\n//Description: Searches for activity related to Salt Typhoon open source related domains and IP addresses\n//False Positives: Attackers often change the IPs and domains they use, some of these may no longer be Salt Typhoon Related\nlet signInLookup = (\n    SigninLogs\n    | where DeviceDetail contains \"displayName\"\n    | extend DeviceDetailJson = parse_json(DeviceDetail)\n    | extend DeviceNameSI = tostring(DeviceDetailJson.displayName)\n    | distinct DeviceNameSI, UserPrincipalName\n    );\nlet SaltTyphoonDomains = dynamic([\"amazoncdns.com\", \"asparticrooftop.com\", \"avatars.dataanalyticsclub.com\", \"awsdns-531.com\", \"bbs.sonypsps.com\", \"c11r.awsdns-531.com\", \"cas04.awsdns-531.com\", \"cdn181.awsdns-531.com\", \"center.veryssl.org\", \"chat.itemdb.com\", \"chat.sonypsps.com\", \"cloudoca.spdns.de\", \"cloudprocenter.com\", \"clubworkmistake.com\", \"credits.offices-analytics.com\", \"dataanalyticsclub.com\", \"datacentreonline.com\", \"dateupdata.com\", \"e-forwardviewupdata.com\", \"earth.monovm.com\", \"everydailygames.com\", \"fitbookcatwer.com\", \"fonts.dataanalyticsclub.com\", \"ftp.google-ana1ytics.com\", \"ftp.google-ap1.com\", \"ftp.microsoft-update.co\", \"google-ana1ytics.com\", \"google-ap1.com\", \"gtalklite.com\", \"gtishare.com\", \"hateupopred.com\", \"holidayutility.com\", \"hotmailcontact.net\", \"image.dataanalyticsclub.com\", \"imap.dateupdata.com\", \"imap.newlylab.com\", \"lanxess-lab.com\", \"linux.updatelive-oline.com\", \"llnw-dd.awsdns-531.com\", \"login.hansoftupdate.com\", \"m.mildupdate.com\", \"mars.monovm.com\", \"mercury.monovm.com\", \"microsoft-outlook.org\", \"microsoft-update.co\", \"microsoftinforms.com\", \"mildupdate.com\", \"newhkdaily.com\", \"newlylab.com\", \"news.trendmicro-update.org\", \"ns101.awsdns-531.com\", \"offices-analytics.com\", \"onlineeylity.com\", \"plasticdrink.com\", \"pulseathermakf.com\", \"rdmail.redcrossco.com\", \"reclubpress.com\", \"redcrossco.com\", \"redsquare.redcrossco.com\", \"registre.organiccrap.com\", \"resource.offices-analytics.com\", \"server.gtalklite.com\", \"services.offices-analytics.com\", \"shalaordereport.com\", \"soffice.offices-analytics.com\", \"sonypsps.com\", \"spk.cloudie.hk\", \"sservice.hkmcadventist.org\", \"ssl3.awsdns-531.com\", \"toodblackrun.com\", \"tranning.redcrossco.com\", \"trendmicro-update.org\", \"trprivates.com\", \"trust.veryssl.org\", \"turkeyscenery.com\", \"turkeystraw.com\", \"unfeelmoonvd.com\", \"up.gtalklite.com\", \"update.deepsoftupdate.com\", \"update.gtalklite.com\", \"update.hancominc.com\", \"update.onlineeylity.com\", \"updatelive-oline.com\", \"venus.monovm.com\", \"verfiedoccurr.com\", \"veryssl.org\", \"w.trprivates.com\", \"waystrkeprosh.com\", \"webdns.spdns.org\", \"windows.updatelive-oline.com\", \"www.corpdns.fartit.com\", \"www.dataanalyticsclub.com\", \"www.datacentreonline.com\", \"www.google-ana1ytics.com\", \"www.google-ap1.com\", \"www.gtishare.com\", \"www.hotmailcontact.net\", \"www.iti.ac.kr\", \"www.itp.es\", \"www.lanxess-arena.de\", \"www.lanxess-lab.com\", \"www.larsentoubro.com\", \"www.microsoft-outlook.org\", \"www.microsoft-update.co\", \"www.oshkoshcorporation.com\", \"www.registre.organiccrap.com\", \"www.russianembassy.org\", \"www.sonypsps.com\", \"www.trendmicro-update.org\", \"www.turkeyscenery.com\", \"www.turkeystraw.com\", \"www.twitch.tw\", \"www.updatelive-oline.com\", \"xdmgwctese.com\", \"zmail.broadmediacloud.com\"\n    ]);\nlet SaltTyphoonIPs = dynamic([\"103.103.128.121\", \"103.103.131.40\", \"103.13.230.146\", \"103.140.238.110\", \"103.149.46.254\", \"103.15.28.228\", \"103.15.29.24\", \"103.159.133.209\", \"103.19.9.172\", \"103.224.80.86\", \"103.224.81.162\", \"103.24.0.142\", \"103.24.1.54\", \"103.242.133.185\", \"103.25.202.151\", \"103.42.13.116\", \"103.42.15.216\", \"103.59.144.183\", \"103.79.77.178\", \"103.79.77.200\", \"103.79.78.48\", \"104.168.211.246\", \"104.168.236.46\", \"104.207.134.11\", \"104.243.44.19\", \"104.245.145.23\", \"104.248.49.97\", \"104.248.78.27\", \"106.187.45.162\", \"106.187.98.115\", \"107.148.131.210\", \"107.173.83.123\", \"118.193.132.92\", \"121.127.234.250\", \"122.10.10.196\", \"122.10.82.120\", \"122.10.9.61\", \"124.137.11.10\", \"128.199.44.86\", \"138.68.133.211\", \"139.180.155.133\", \"139.180.208.225\", \"139.180.216.65\", \"139.59.165.51\", \"139.59.58.130\", \"139.59.81.253\", \"14.47.125.214\", \"142.93.182.54\", \"144.168.36.189\", \"144.168.36.21\", \"144.214.220.11\", \"144.214.220.114\", \"144.214.220.158\", \"144.214.220.207\", \"144.214.220.33\", \"146.70.79.48\", \"149.28.150.170\", \"154.220.3.17\", \"154.223.135.214\", \"156.255.2.183\", \"156.255.2.202\", \"156.255.2.205\", \"157.230.221.198\", \"159.65.157.175\", \"159.65.202.4\", \"159.65.80.157\", \"159.89.168.83\", \"160.20.145.171\", \"161.35.51.41\", \"165.232.154.116\", \"167.172.239.215\", \"167.99.239.29\", \"171.116.204.89\", \"171.116.207.238\", \"172.105.162.84\", \"172.93.165.12\", \"172.93.165.13\", \"172.93.188.220\", \"172.93.189.207\", \"172.93.189.9\", \"176.223.112.229\", \"177.67.82.218\", \"178.128.235.15\", \"178.79.177.69\", \"183.185.84.243\", \"183.185.90.168\", \"183.185.90.99\", \"183.185.91.141\", \"185.12.45.134\", \"189.2.116.166\", \"189.2.60.78\", \"189.52.17.42\", \"192.131.142.35\", \"192.169.236.189\", \"192.81.208.169\", \"193.171.202.150\", \"193.203.203.26\", \"193.239.86.168\", \"193.239.86.200\", \"194.156.98.129\", \"197.100.107.107\", \"198.100.107.107\", \"199.229.250.18\", \"202.146.221.195\", \"202.155.223.83\", \"202.57.40.227\", \"203.20.113.208\", \"203.9.150.153\", \"205.233.151.1\", \"206.189.123.156\", \"206.189.175.203\", \"206.189.180.4\", \"206.189.40.40\", \"206.53.160.200\", \"206.53.160.201\", \"206.53.160.202\", \"208.95.74.186\", \"210.116.106.66\", \"210.209.89.162\", \"211.110.174.105\", \"23.106.123.183\", \"27.102.113.240\", \"27.102.113.57\", \"27.102.118.177\", \"27.102.127.190\", \"31.3.243.51\", \"34.65.151.250\", \"35.187.148.253\", \"35.220.135.85\", \"39.109.5.161\", \"43.226.126.165\", \"43.242.34.195\", \"43.242.35.13\", \"45.117.98.121\", \"45.142.214.188\", \"45.159.48.227\", \"45.192.178.206\", \"45.77.241.33\", \"45.77.250.141\", \"5.62.62.235\", \"50.116.36.25\", \"50.248.10.133\", \"54.254.185.135\", \"66.42.62.250\", \"74.119.194.153\", \"85.204.74.143\", \"89.35.178.105\", \"91.245.255.13\", \"91.245.255.36\", \"91.245.255.72\", \"91.245.255.95\", \"95.174.65.140\"\n    ]);\n(union isfuzzy=true\n    (\n    DeviceNetworkEvents\n    | where isnotempty(RemoteUrl)\n    | where RemoteUrl has_any(SaltTyphoonDomains) or RemoteIP has_any(SaltTyphoonIPs)\n    | project\n        TimeGenerated,\n        DeviceName,\n        RemoteIP,\n        RemoteUrl,\n        InitiatingProcessAccountName,\n        Tactic = \"Possible Salt Typhoon IP/Domain Traffic\"\n    | extend\n        timestamp = TimeGenerated,\n        HostCustomEntity = DeviceName,\n        AccountCustomEntity = InitiatingProcessAccountName,\n        DNSName = RemoteUrl,\n        IPCustomEntity = RemoteIP\n    ),\n    (\n    DeviceEvents\n    | where FileOriginIP has_any(SaltTyphoonIPs) or FileOriginUrl has_any(SaltTyphoonDomains) or RemoteUrl has_any(SaltTyphoonDomains)\n    | project\n        TimeGenerated,\n        ActionType,\n        FileOriginUrl,\n        RemoteUrl,\n        AccountName,\n        AccountDomain,\n        DeviceName,\n        DeviceId,\n        Tactic = \"Possible Salt Typhoon IP/Domain Traffic\"\n    ),(\n    DeviceFileEvents\n    | where FileOriginUrl has_any(SaltTyphoonDomains) or FileOriginReferrerUrl has_any(SaltTyphoonDomains)\n    | project\n        TimeGenerated,\n        ActionType,\n        FileOriginUrl,\n        FileOriginReferrerUrl,\n        DeviceName,\n        DeviceId,\n        Tactic = \"Possible Salt Typhoon IP/Domain Traffic\"\n    )\n)",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5M",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  null,
                                                                                   "groupByCustomDetails":  null
                                                                               }
                                                 },
                       "entityMappings":  [
                                              {
                                                  "entityType":  "URL",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "Url",
                                                                            "columnName":  "RemoteUrl"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "IP",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "Address",
                                                                            "columnName":  "RemoteIP"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "Host",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "HostName",
                                                                            "columnName":  "DeviceName"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "File",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "Name",
                                                                            "columnName":  "FileOriginUrl"
                                                                        },
                                                                        {
                                                                            "identifier":  "Directory",
                                                                            "columnName":  "FileOriginReferrerUrl"
                                                                        }
                                                                    ]
                                              }
                                          ],
                       "tactics":  [
                                       "InitialAccess",
                                       "CredentialAccess",
                                       "Persistence"
                                   ],
                       "techniques":  [
                                          "T1566",
                                          "T1110",
                                          "T1505"
                                      ],
                       "displayName":  "BAH_Salt_Typhoon_IOCs",
                       "enabled":  true,
                       "description":  "Searches for activity related to Salt Typhoon open-source related domains and IP addresses.",
                       "alertRuleTemplateName":  null,
                       "lastModifiedUtc":  "2024-12-19T14:32:29.0972973Z"
                   }
}
