{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/42a16fef-e411-450b-90f4-189e6d73014f",
    "name":  "42a16fef-e411-450b-90f4-189e6d73014f",
    "etag":  "\"8700728e-0000-2700-0000-66fdc4f90000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "P1D",
                       "queryPeriod":  "P1D",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "Medium",
                       "query":  "// Author: Ginna Woo\r\n// Description: Looks at dormant accounts (inactive accounts over 180 days) and the activities and risk events associated to those dormant accounts.\r\n// False Positives: None known\r\nlet AL = (AuditLogs\r\n    | join SigninLogs on ResourceId, CorrelationId\r\n    | extend ActivityDateTimeAL = ActivityDateTime\r\n    | extend TimeGeneratedAL = TimeGenerated\r\n    | where ResultType1 == 0 and IPAddress !startswith \"140\" //successful sign in and if IPAddress sign-in is not from 140.xxx.xxx\r\n    | extend InitiatedByUser = InitiatedBy.user.userPrincipalName\r\n    | extend InitiatedByApp = InitiatedBy.app.servicePrincipalName\r\n    | extend TargetedResource = TargetResources[0].displayName\r\n    | extend TargetedUser = TargetResources[0].userPrincipalName\r\n    | extend TargetedResourceProperties = TargetResources[0].modifiedProperties\r\n| project Category, AADOperationType, ActivityDisplayName, OperationName,InitiatedByUser, InitiatedByApp, TargetedResource, TargetedUser, ActivityDateTimeAL, UserPrincipalName,TimeGeneratedAL, IPAddress, TargetedResourceProperties, AdditionalDetails);\r\nBehaviorAnalytics\r\n| where InvestigationPriority \u003e= 0 //adjust sensitivity level on scale 0-10 (10 highest)\r\n| evaluate bag_unpack(ActivityInsights, columnsConflict=\"replace_source\")\r\n| evaluate bag_unpack(UsersInsights, columnsConflict=\"replace_source\")\r\n| extend IsDormantAccount = column_ifexists(\"IsDormantAccount\", \"\")\r\n| extend IsNewAccount = column_ifexists(\"IsNewAccount\", \"\")\r\n| extend Resource = column_ifexists(\"Resource\", \"\")\r\n| extend DeviceUncommonlyUsedInTenant = column_ifexists(\"DeviceUncommonlyUsedInTenant\", \"\")\r\n| extend FirstTimeDeviceObservedInTenant = column_ifexists(\"FirstTimeDeviceObservedInTenant\", \"\")\r\n| extend FirstTimeUserAccessedResource = column_ifexists(\"FirstTimeUserAccessedResource\", \"\")\r\n| extend FirstTimeUserUsedApp = column_ifexists(\"FirstTimeUserUsedApp\", \"\")\r\n| extend ActionUncommonlyPerformedByUser = column_ifexists(\"ActionUncommonlyPerformedByUser\", \"\")\r\n| extend ResourceUncommonlyAccessedInTenant = column_ifexists(\"ResourceUncommonlyAccessedInTenant\", \"\")\r\n| extend UnusualNumberOfDistinctUsersFailedSignInFromIPAddress = column_ifexists(\"UnusualNumberOfDistinctUsersFailedSignInFromIPAddress\", \"\")\r\n| extend UnusualNumberOfFailedSignInOfThisUser = column_ifexists(\"UnusualNumberOfFailedSignInOfThisUser\", \"\")\r\n| extend UncommonHighVolumeOfActions = column_ifexists(\"UncommonHighVolumeOfActions\", \"\")\r\n| extend AppIdUncommonlyAccessedInTenant = column_ifexists(\"AppIdUncommonlyAccessedInTenant\", \"\")\r\n| extend AccountDisplayName = column_ifexists(\"AccountDisplayName\", \"\")\r\n| where IsDormantAccount == True // only include accounts not in use for \u003e 180 days\r\n| join kind=inner AL on UserPrincipalName\r\n| summarize min(TimeGenerated), max(TimeGenerated) by UserPrincipalName, AADOperationType,Category,OperationName,InvestigationPriority,ActionUncommonlyPerformedByUser,UncommonHighVolumeOfActions,UnusualNumberOfFailedSignInOfThisUser,UnusualNumberOfDistinctUsersFailedSignInFromIPAddress,AppIdUncommonlyAccessedInTenant, FirstTimeDeviceObservedInTenant, FirstTimeUserAccessedResource, FirstTimeUserUsedApp, ResourceUncommonlyAccessedInTenant,IsDormantAccount, IPAddress, tostring(InitiatedByUser), tostring(InitiatedByApp), tostring(TargetedUser),tostring(TargetedResource), tostring(TargetedResourceProperties), tostring(AdditionalDetails)\r\n",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5H",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  [

                                                                                                           ],
                                                                                   "groupByCustomDetails":  [

                                                                                                            ]
                                                                               }
                                                 },
                       "entityMappings":  [
                                              {
                                                  "entityType":  "Account",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "Name",
                                                                            "columnName":  "UserPrincipalName"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "IP",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "Address",
                                                                            "columnName":  "IPAddress"
                                                                        }
                                                                    ]
                                              }
                                          ],
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [
                                       "InitialAccess"
                                   ],
                       "techniques":  [
                                          "T1078"
                                      ],
                       "displayName":  "BAH_UEBA_3-RiskyDormantAccountActivities",
                       "enabled":  true,
                       "description":  "Looks at dormant accounts (inactive accounts over 180 days) and the activities and risk events associated to those dormant accounts.\nPLATFORM:Azure AD,Windows,Microsoft 365,IaaS\nMITRE:TA0001;T1078;T1078.001;T1078.002;T1078.003;T1078.004",
                       "alertRuleTemplateName":  null,
                       "lastModifiedUtc":  "2024-10-02T22:10:51.2018956Z"
                   }
}
