{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/17fc2e82-18b3-4c26-91cd-2ec7c806ddeb",
    "name":  "17fc2e82-18b3-4c26-91cd-2ec7c806ddeb",
    "etag":  "\"87005dea-0000-2700-0000-66fdcb1c0000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "PT1H",
                       "queryPeriod":  "PT1H",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "Medium",
                       "query":  "let MD5list = dynamic([\u0027c6cd8cc573735f3698801c70f699db63\u0027,\r\n\u00277d20fa01a703afa8907e50417d27b0a4\u0027,\r\n\u0027b4f0ca61ab0c55a542f32bd4e66a7dc2\u0027,\r\n\u002747390b552d27675d9868ad773d1f199d\u0027]);\r\n(union isfuzzy=true\r\n(DeviceEvents\r\n| where MD5 != \"\"\r\n| where MD5 has_any (MD5list) or InitiatingProcessMD5 has_any (MD5list)\r\n| project TimestampCustomEntity = TimeGenerated, ActionType, MD5, InitiatingProcessMD5, AccountCustomEntity = AccountName, AccountDomain, DeviceName, DeviceId\r\n),\r\n(DeviceFileEvents\r\n| where MD5 != \"\"\r\n| where MD5 has_any (MD5list) or InitiatingProcessMD5 has_any (MD5list)\r\n| project TimestampCustomEntity = TimeGenerated, ActionType, MD5, InitiatingProcessMD5, HostCustomEntity = DeviceName, DeviceId\r\n),\r\n(DeviceImageLoadEvents\r\n| where MD5 != \"\"\r\n| where MD5 has_any (MD5list) or InitiatingProcessMD5 has_any (MD5list)\r\n| project TimestampCustomEntity = TimeGenerated, ActionType, MD5, InitiatingProcessMD5, HostCustomEntity = DeviceName, DeviceId\r\n),\r\n(DeviceProcessEvents\r\n| where MD5 != \"\"\r\n| where MD5 has_any (MD5list) or InitiatingProcessMD5 has_any (MD5list)\r\n| project TimestampCustomEntity = TimeGenerated, ActionType, MD5, InitiatingProcessMD5, AccountCustomEntity = AccountName, AccountDomain, HostCustomEntity = DeviceName, DeviceId\r\n),\r\n(DeviceLogonEvents\r\n| where InitiatingProcessMD5 != \"\"\r\n| where InitiatingProcessMD5 has_any (MD5list)\r\n| project TimestampCustomEntity = TimeGenerated, ActionType, InitiatingProcessMD5, AccountCustomEntity = AccountName, AccountDomain, HostCustomEntity = DeviceName, DeviceId\r\n),\r\n(DeviceRegistryEvents\r\n| where InitiatingProcessMD5 != \"\"\r\n| where InitiatingProcessMD5 has_any (MD5list)\r\n| project TimestampCustomEntity = TimeGenerated, ActionType, InitiatingProcessMD5, HostCustomEntity = DeviceName, DeviceId\r\n),\r\n(DeviceNetworkEvents\r\n| where InitiatingProcessMD5 != \"\"\r\n| where InitiatingProcessMD5 has_any (MD5list)\r\n| project TimestampCustomEntity = TimeGenerated, ActionType, InitiatingProcessMD5, HostCustomEntity = DeviceName, DeviceId\r\n)\r\n)",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5H",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  [

                                                                                                           ],
                                                                                   "groupByCustomDetails":  [

                                                                                                            ]
                                                                               }
                                                 },
                       "entityMappings":  [
                                              {
                                                  "entityType":  "Account",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "FullName",
                                                                            "columnName":  "AccountCustomEntity"
                                                                        },
                                                                        {
                                                                            "identifier":  "NTDomain",
                                                                            "columnName":  "AccountDomain"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "Host",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "FullName",
                                                                            "columnName":  "HostCustomEntity"
                                                                        }
                                                                    ]
                                              }
                                          ],
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [
                                       "ResourceDevelopment"
                                   ],
                       "techniques":  [
                                          "T1587"
                                      ],
                       "displayName":  "BAH_DTO22_0111",
                       "enabled":  true,
                       "description":  "Detects Golang dropper used by Russian Foreign Intelligence Service (SVR), APT29. This dropper decrypts and then executes a CobaltStrike beacon. The yara rule specifically detects the main function called as it locates the payload in the .rdata section\nPLATFORM:Windows\nMITRE:TA0042;T1587",
                       "alertRuleTemplateName":  null,
                       "lastModifiedUtc":  "2024-10-02T22:37:15.7359778Z"
                   }
}
