{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/DoD365-LAW-RG2/providers/Microsoft.OperationalInsights/workspaces/DOD365-LAW/providers/Microsoft.SecurityInsights/alertRules/1c477f87-298f-41a3-a546-a209933c2520",
    "name":  "1c477f87-298f-41a3-a546-a209933c2520",
    "etag":  "\"2c02b18f-0000-2700-0000-645cee690000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "PT1H",
                       "queryPeriod":  "PT1H",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "Medium",
                       "query":  "// Author: Rob Russell\r\n// Description:\r\n// Detects loading dlls by ordinal. This behavior is one of the tactics used by Hermitic Wizard malware to hide windows API calls from static analysis.\r\n// References\r\n// https://www.pcmatic.com/blog/running-dll-files-malware-analysis/\r\n// https://www.cisa.gov/uscert/ncas/analysis-reports/ar22-115b\r\n// False Positives: On occasion tools that seek to restore the Windows Aero theme will use the same method. Detection of this activity does not necessarily mean Hermetic Wizard has been detected. This behavior could be used by other strains of malware.\r\nlet allowlist = dynamic([\r\n@\"rundll32.exe uxtheme.dll,#64 C:\\WINDOWS\\resources\\themes\\Aero\\AeroLite.msstyles?NormalColor?NormalSize\", // benign use of dll export by ordinal\r\n@\"rundll32.exe uxtheme.dll,#64 C:\\WINDOWS\\resources\\Themes\\Aero\\Aero.msstyles?NormalColor?NormalSize\" // benign use of dll export by ordinal\r\n]);\r\nlet signInLookup = (\r\nSigninLogs\r\n| where TimeGenerated \u003e= ago(1d) // this could be expensive, should we keep it?\r\n| where DeviceDetail contains \"displayName\"\r\n| extend DeviceDetailJson = parse_json(DeviceDetail)\r\n| extend DeviceNameSI = tostring(DeviceDetailJson.displayName)\r\n| distinct DeviceNameSI, UserPrincipalName, UserDisplayName\r\n);\r\n(union isfuzzy=true\r\n(DeviceProcessEvents\r\n| where ProcessCommandLine matches regex @\u0027rundll32.exe .*,#.*\u0027\r\n| extend Behavior = \"\"\r\n| where not(ProcessCommandLine has_any (allowlist))\r\n| extend SILogDeviceName = toupper((split(DeviceName, \".\"))[0])\r\n| join kind=leftouter signInLookup on $left.SILogDeviceName == $right.DeviceNameSI\r\n| project TimeGenerated, \r\nBehavior = \"Suspicious call of DLL in rundll32.dll exports by ordinal\",\r\nProcessCommandLine, \r\nAccountName, \r\nAccountDomain, \r\nUserPrincipalName, \r\nUserDisplayName,\r\nDeviceName, \r\nDeviceId\r\n),\r\n(DeviceProcessEvents\r\n| where ProcessCommandLine matches regex @\"ocx\u0027 #1 -s [\\s\\S]+.dll\u0027 -i (25[0-5]|\\b2[0-4][0-9]|[01]?[0-9][0-9]?)(\\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)){3}\"\r\n| extend Behavior = \"\"\r\n| extend SILogDeviceName = toupper((split(DeviceName, \".\"))[0])\r\n| join kind=leftouter signInLookup on $left.SILogDeviceName == $right.DeviceNameSI\r\n| project TimeGenerated, \r\nBehavior = \"Hermetic Wizard WMI spreader\", \r\nProcessCommandLine, \r\nAccountName, \r\nAccountDomain,\r\nUserPrincipalName, \r\nUserDisplayName,\r\nDeviceName, \r\nDeviceId\r\n)\r\n)",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5M",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  null,
                                                                                   "groupByCustomDetails":  null
                                                                               }
                                                 },
                       "entityMappings":  [
                                              {
                                                  "entityType":  "Account",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "AadUserId",
                                                                            "columnName":  "UserPrincipalName"
                                                                        },
                                                                        {
                                                                            "identifier":  "DisplayName",
                                                                            "columnName":  "UserDisplayName"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "Host",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "HostName",
                                                                            "columnName":  "DeviceName"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "Process",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "CommandLine",
                                                                            "columnName":  "ProcessCommandLine"
                                                                        }
                                                                    ]
                                              }
                                          ],
                       "tactics":  [

                                   ],
                       "techniques":  [

                                      ],
                       "displayName":  "BAH_HermeticWizard",
                       "enabled":  true,
                       "description":  "HermeticWizard: spreads HermeticWiper across a local network via WMI and SMB https://www.welivesecurity.com/2022/03/01/isaacwiper-hermeticwizard-wiper-worm-targeting-ukraine/",
                       "alertRuleTemplateName":  null,
                       "lastModifiedUtc":  "2023-05-11T13:32:23.2188409Z"
                   }
}
