{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/457280a9-a748-4c0b-b116-510516325a77",
    "name":  "457280a9-a748-4c0b-b116-510516325a77",
    "etag":  "\"8700f988-0000-2700-0000-66fdc4ad0000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "PT1H",
                       "queryPeriod":  "P1D",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "Medium",
                       "query":  "//Authors: Ginna Woo and Edward Jiang\r\n//Description: UEBA 6 - Brute force attack against Windows Signin; Identifies evidence of brute force activity against Windows signins by highlighting multiple authentication failures and by a successful authentication within a given time window.\r\n//False Positive(s): None\r\n//----------------------------\r\n\r\nlet authenticationWindow = 20m;\r\nlet sensitivity = 2.5; //adjust anomaly sensitivity threshold for the series_decompose_function (1.5 is the default; higher value = more sensitive for detecting anomalies)\r\nlet seasonality = -1;//Controls the seasonal analysis. -1 = auto detect seasonality\r\nlet InvestigationPriorityThreshold = 2; //UEBA threshold sensitivity \r\n//Find all signin attempts and generate failure and success count. Conduct series_decompose_anomalies analysis and project scoring results\r\nlet FailureThreshold = 10; //Adjust failure threshold\r\nlet FailSuccessSignin =\r\nSigninLogs\r\n    | where AppDisplayName =~ \"Windows Sign In\"\r\n    | extend FailureOrSuccess = iff(ResultType in (\"0\", \"50125\", \"50140\", \"70043\", \"70044\"), \"Success\", \"Failure\")\r\n    | summarize FailureCount = countif(FailureOrSuccess==\"Failure\"), SuccessCount = countif(FailureOrSuccess==\"Success\"), IPAddresses = make_set(IPAddress,1000) by bin(TimeGenerated, authenticationWindow), UserDisplayName, UserPrincipalName\r\n    | extend FailureSuccessDiff = FailureCount - SuccessCount\r\n    | where  FailureCount \u003e= FailureThreshold\r\n    | summarize Diff = make_list(FailureSuccessDiff, 10000), TimeStamp = make_list(TimeGenerated, 10000), TotalFailures = max(FailureCount) by UserDisplayName, UserPrincipalName \r\n    | extend (Anomalies, Score, Baseline) = series_decompose_anomalies(Diff, sensitivity, seasonality, \u0027linefit\u0027)\r\n    | mv-expand Diff to typeof(double), TimeStamp to typeof(datetime), Anomalies to typeof(double), Score to typeof(double), Baseline to typeof(long)\r\n    | where Anomalies \u003e 0\r\n    | summarize by UserDisplayName, UserPrincipalName, TotalFailures;\r\n//Enrich results with UEBA data \r\nBehaviorAnalytics\r\n| where InvestigationPriority \u003e= InvestigationPriorityThreshold\r\n| evaluate bag_unpack(ActivityInsights, columnsConflict=\"replace_source\")\r\n| evaluate bag_unpack(UsersInsights, columnsConflict=\"replace_source\")\r\n| evaluate bag_unpack(DevicesInsights, columnsConflict=\"replace_source\")\r\n| extend UnusualNumberOfFailedSignInOfThisUser = column_ifexists(\"UnusualNumberOfFailedSignInOfThisUser\", \"\")\r\n| extend UnusualNumberOfDistinctUsersFailedSignInFromIPAddress = column_ifexists(\"UnusualNumberOfDistinctUsersFailedSignInFromIPAddress\", \"\")\r\n//| where UnusualNumberOfFailedSignInOfThisUser == \u0027True\u0027 and UnusualNumberOfDistinctUsersFailedSignInFromIPAddress == \u0027True\u0027 \r\n| join kind = innerunique FailSuccessSignin on UserPrincipalName\r\n//Joining in on SigninLogs again to project columns\r\n| join kind=leftouter (\r\n      SigninLogs\r\n      | where AppDisplayName =~ \"Windows Sign In\"\r\n      | extend OS = DeviceDetail.operatingSystem, Browser = DeviceDetail.browser\r\n      | extend StatusCode = tostring(Status.errorCode), StatusDetails = tostring(Status.additionalDetails)\r\n      | extend State = tostring(LocationDetails.state), City = tostring(LocationDetails.city)\r\n      | summarize StartTime = min(TimeGenerated), \r\n                  EndTime = max(TimeGenerated), \r\n                  IPAddress = make_set(IPAddress,100), \r\n                  OS = make_set(OS,20), \r\n                  Browser = make_set(Browser,20), \r\n                  City = make_set(City,100), \r\n                  ResultType = make_set(ResultType,100),\r\n                  ResultDescription = make_set(ResultDescription,100)\r\n              by UserDisplayName, UserPrincipalName\r\n  ) on UserDisplayName, UserPrincipalName\r\n| extend IPAddressFirst = IPAddress[0]\r\n|project-keep StartTime, EndTime, UserDisplayName, UserPrincipalName, InvestigationPriority, Uncommon*, Unusual*, Resource*, First*, App*, IPAddress, City, Result*, UserAgent*, TotalFailures\r\n| project-reorder StartTime, EndTime, UserDisplayName, UserPrincipalName, TotalFailures",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5H",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  [

                                                                                                           ],
                                                                                   "groupByCustomDetails":  [

                                                                                                            ]
                                                                               }
                                                 },
                       "customDetails":  {

                                         },
                       "entityMappings":  [
                                              {
                                                  "entityType":  "Account",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "AadUserId",
                                                                            "columnName":  "UserPrincipalName"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "IP",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "Address",
                                                                            "columnName":  "IPAddress"
                                                                        }
                                                                    ]
                                              }
                                          ],
                       "alertDetailsOverride":  {
                                                    "alertDynamicProperties":  [

                                                                               ]
                                                },
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [
                                       "CredentialAccess"
                                   ],
                       "techniques":  [
                                          "T1110"
                                      ],
                       "displayName":  "BAH_UEBA_6 - Brute Force Attack against Windows Signin",
                       "enabled":  true,
                       "description":  "Identifies evidence of brute force activity against a Windows Sign In activities by highlighting multiple authentication failures and by a successful authentication within a given time window.\nPLATFORM:Azure AD\nMITRE:TA0006;T1110;T1110.001;T1110.002;T1110.003;T1110.004",
                       "alertRuleTemplateName":  null,
                       "lastModifiedUtc":  "2024-10-02T22:09:47.8274296Z"
                   }
}
