{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/DoD365-LAW-RG2/providers/Microsoft.OperationalInsights/workspaces/DOD365-LAW/providers/Microsoft.SecurityInsights/alertRules/68ba287e-ac45-41cd-a62f-030f23722640",
    "name":  "68ba287e-ac45-41cd-a62f-030f23722640",
    "etag":  "\"30086594-0000-2700-0000-67360a1a0000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "P1D",
                       "queryPeriod":  "P1D",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "High",
                       "query":  "//BAH_APT_Salt_Typhoon\n//Author: Shawn McWhirter\n//Description:This APT has several IOCs/TTPs seen being implemented, including detection of the execution of \"whoami.exe\" by privileged accounts that are often abused by threat actors. Also, detection of known executables and dlls used by Salt Typhoon actors for DLL search order hijacking. These are used to load malicious dlls for malware persistence and execution.\n//https://app.snapattack.com/detection/c9290e22-595b-4524-b1f1-d4b5f46cc84d\n//https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment\n//https://app.snapattack.com/detection/07a41eed-4b0b-4735-826a-f731d945a781\n//https://lolbas-project.github.io/lolbas/Binaries/Msbuild/\n//https://app.snapattack.com/detection/5585b840-7d7b-408a-af6a-775c0f87b212\n//https://www.trendmicro.com/en_gb/research/23/h/earth-estries-targets-government-tech-for-cyberespionage.html\n//https://redcanary.com/threat-detection-report/threats/cobalt-strike/\n//https://app.snapattack.com/detection/408f3f9b-6cf6-4cab-9362-d85518a033f1\n//False Positives: TBD\nlet signInLookup = (\n    SigninLogs\n    | where TimeGenerated \u003e= ago(1d)\n    | where DeviceDetail contains \"displayName\"\n    | extend DeviceDetailJson = parse_json(DeviceDetail)\n    | extend DeviceNameSI = tostring(DeviceDetailJson.displayName)\n    | distinct DeviceNameSI, UserPrincipalName, UserDisplayName\n    );\n(union isfuzzy=True\n    (\n    DeviceProcessEvents \n    | where ((ProcessVersionInfoOriginalFileName == \"whoami.exe\" or FolderPath contains @\"\\whoami.exe\") and (toupper(InitiatingProcessAccountName) contains \"AUTHORI\" or toupper(InitiatingProcessAccountName) contains \"AUTORI\" or toupper(InitiatingProcessAccountName) contains \"TrustedInstaller\"))\n    | extend SILogDeviceName = toupper((split(DeviceName, \".\"))[0])\n    | join kind=leftouter signInLookup on $left.SILogDeviceName == $right.DeviceNameSI\n    | project\n        TimeGenerated,\n        DeviceName,\n        UserDisplayName,\n        ProcessCommandLine,\n        ProcessVersionInfoFileDescription,\n        InitiatingProcessAccountName,\n        InitiatingProcessFileName,\n        InitiatingProcessFolderPath,\n        FolderPath,\n        FileName,\n        MD5,\n        Tactic = \"Detects the execution of \u0027whoami.exe\u0027 by privileged accounts that are often abused by threat actors\"\n    ),\n    (\n    DeviceProcessEvents \n    | where (FileName == \"MSBuild.exe\" and (ProcessCommandLine contains \".csproj\" or ProcessCommandLine contains \".xml\" or ProcessCommandLine contains \".rsp\" or ProcessCommandLine contains \"logger\"))\n    | extend SILogDeviceName = toupper((split(DeviceName, \".\"))[0])\n    | join kind=leftouter signInLookup on $left.SILogDeviceName == $right.DeviceNameSI\n    | project\n        TimeGenerated,\n        DeviceName,\n        UserPrincipalName,\n        ActionType,\n        InitiatingProcessFileName,\n        InitiatingProcessFolderPath,\n        InitiatingProcessCommandLine,\n        ProcessCommandLine,\n        FileName,\n        FolderPath,\n        MD5,\n        Tactic = \"Potential MSBuild Living Off The Land Activity\"\n    ),\n    (\n    DeviceFileEvents \n    | where (ActionType == \"FileCreated\" and (FolderPath == \"IJPLMCOM.dll\" or FolderPath == \"brlogapi64.dll\" or FolderPath == \"imfsbDll.dll\" or FolderPath == \"K7AVWScn.dll\" or FolderPath == \"K7UI.dll\" or FolderPath == \"K7SysMn1.dll\" or FolderPath == \"mscoree.dll\" or FolderPath == \"msimg32.dll\" or FolderPath == \"jli.dll\" or FolderPath == \"dxgi.dll\" or FolderPath == \"SbieDll.dll\" or FolderPath == \"ijplmui.exe\" or FolderPath == \"brdifxapi.exe\" or FolderPath == \"imfsbCrypto.exe\" or FolderPath == \"K7AVMScn.exe\" or FolderPath == \"K7TSVlog.exe\" or FolderPath == \"K7SysMon.EXE\" or FolderPath == \"iisexpresstray.exe\" or FolderPath == \"seanalyzertool.exe\" or FolderPath == \"jps.exe\" or FolderPath == \"sfc.exe\" or FolderPath == \"SandboxieBITS.exe\" or FolderPath == \"Indexer.exe\"))\n    | extend SILogDeviceName = toupper((split(DeviceName, \".\"))[0])\n    | join kind=leftouter signInLookup on $left.SILogDeviceName == $right.DeviceNameSI\n    | project\n        TimeGenerated,\n        DeviceName,\n        UserPrincipalName,\n        ActionType,\n        InitiatingProcessFileName,\n        InitiatingProcessFolderPath,\n        InitiatingProcessCommandLine,\n        FileName,\n        FolderPath,\n        MD5,\n        Tactic = \"Potential Salt Typhoon DLL Side-Loading File Indicators\"\n    ),\n    (\n    DeviceEvents \n    | where ((ActionType == \"NamedPipeEvent\") and ((AdditionalFields.PipeName contains @\"\\MSSE-\" and AdditionalFields.PipeName contains \"-server\") or AdditionalFields.PipeName startswith @\"\\postex_\" or AdditionalFields.PipeName startswith @\"\\status_\" or AdditionalFields.PipeName startswith @\"\\msagent_\" or AdditionalFields.PipeName startswith @\"\\mojo_\" or AdditionalFields.PipeName startswith @\"\\interprocess_\" or AdditionalFields.PipeName startswith @\"\\samr_\" or AdditionalFields.PipeName startswith @\"\\netlogon_\" or AdditionalFields.PipeName startswith @\"\\srvsvc_\" or AdditionalFields.PipeName startswith @\"\\lsarpc_\" or AdditionalFields.PipeName startswith @\"\\wkssvc_\"))\n    | extend SILogDeviceName = toupper((split(DeviceName, \".\"))[0])\n    | join kind=leftouter signInLookup on $left.SILogDeviceName == $right.DeviceNameSI\n    | project\n        TimeGenerated,\n        DeviceName,\n        UserPrincipalName,\n        ActionType,\n        AdditionalFields.PipeName,\n        Tactic = \"Potential Salt Typhoon creation of a named pipe as used by CobaltStrike\"\n    )\n    )",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5M",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  null,
                                                                                   "groupByCustomDetails":  null
                                                                               }
                                                 },
                       "entityMappings":  [
                                              {
                                                  "entityType":  "Process",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "CommandLine",
                                                                            "columnName":  "ProcessCommandLine"
                                                                        },
                                                                        {
                                                                            "identifier":  "ProcessId",
                                                                            "columnName":  "ProcessVersionInfoFileDescription"
                                                                        },
                                                                        {
                                                                            "identifier":  "CreationTimeUtc",
                                                                            "columnName":  "ActionType"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "File",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "Name",
                                                                            "columnName":  "FileName"
                                                                        },
                                                                        {
                                                                            "identifier":  "Directory",
                                                                            "columnName":  "FolderPath"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "Account",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "Name",
                                                                            "columnName":  "UserDisplayName"
                                                                        },
                                                                        {
                                                                            "identifier":  "DisplayName",
                                                                            "columnName":  "DeviceName"
                                                                        }
                                                                    ]
                                              }
                                          ],
                       "tactics":  [
                                       "PrivilegeEscalation",
                                       "Execution",
                                       "DefenseEvasion"
                                   ],
                       "techniques":  [
                                          "T1055",
                                          "T1574",
                                          "T1129",
                                          "T1127"
                                      ],
                       "displayName":  "BAH_APT_Salt_Typhoon",
                       "enabled":  true,
                       "description":  "This APT has several IOCs/TTPs seen being implemented, including detection of the execution of \"whoami.exe\" by privileged accounts that are often abused by threat actors. Also, detection of known executables and dlls used by Salt Typhoon actors for DLL search order hijacking. These are used to load malicious dlls for malware persistence and execution.",
                       "alertRuleTemplateName":  null,
                       "lastModifiedUtc":  "2024-11-14T14:32:55.2914145Z"
                   }
}
