{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/aa71f645-a8f5-4cc2-afff-22e0c9d46511",
    "name":  "aa71f645-a8f5-4cc2-afff-22e0c9d46511",
    "etag":  "\"87009997-0000-2700-0000-66fdc57b0000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "PT1H",
                       "queryPeriod":  "PT1H",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "Medium",
                       "query":  "// Author: Rob Russell\n// Description:\n// Based on attachment from DTO 22-0106\n// looks for Trello based MD5 activity\n// False Positives: No known false positives\nlet MD5list = dynamic([@\u0027a0b4e7622728c317f37ae354b8bc3dbb\u0027]);\n(union isfuzzy=true\n(DeviceEvents\n| where MD5 != \"\"\n| where MD5 has_any (MD5list) or InitiatingProcessMD5 has_any (MD5list)\n| project TimeGenerated, ActionType, MD5, InitiatingProcessMD5, AccountName, AccountDomain, DeviceName, DeviceId\n),\n(DeviceFileEvents\n| where MD5 != \"\"\n| where MD5 has_any (MD5list) or InitiatingProcessMD5 has_any (MD5list)\n| project TimeGenerated, ActionType, MD5, InitiatingProcessMD5, DeviceName, DeviceId\n),\n(DeviceImageLoadEvents\n| where MD5 != \"\"\n| where MD5 has_any (MD5list) or InitiatingProcessMD5 has_any (MD5list)\n| project TimeGenerated, ActionType, MD5, InitiatingProcessMD5, DeviceName, DeviceId\n),\n(DeviceProcessEvents\n| where MD5 != \"\"\n| where MD5 has_any (MD5list) or InitiatingProcessMD5 has_any (MD5list)\n| project TimeGenerated, ActionType, MD5, InitiatingProcessMD5, AccountName, AccountDomain, DeviceName, DeviceId\n),\n(DeviceLogonEvents\n| where InitiatingProcessMD5 != \"\"\n| where InitiatingProcessMD5 has_any (MD5list)\n| project TimeGenerated, ActionType, InitiatingProcessMD5, AccountName, AccountDomain, DeviceName, DeviceId\n),\n(DeviceRegistryEvents\n| where InitiatingProcessMD5 != \"\"\n| where InitiatingProcessMD5 has_any (MD5list)\n| project TimeGenerated, ActionType, InitiatingProcessMD5, DeviceName, DeviceId\n),\n(DeviceNetworkEvents\n| where InitiatingProcessMD5 != \"\"\n| where InitiatingProcessMD5 has_any (MD5list)\n| project TimeGenerated, ActionType, InitiatingProcessMD5, DeviceName, DeviceId\n)\n)",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5M",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  null,
                                                                                   "groupByCustomDetails":  null
                                                                               }
                                                 },
                       "entityMappings":  [
                                              {
                                                  "entityType":  "FileHash",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "Value",
                                                                            "columnName":  "MD5"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "Account",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "Name",
                                                                            "columnName":  "AccountName"
                                                                        },
                                                                        {
                                                                            "identifier":  "NTDomain",
                                                                            "columnName":  "AccountDomain"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "Host",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "HostName",
                                                                            "columnName":  "DeviceName"
                                                                        }
                                                                    ]
                                              }
                                          ],
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [
                                       "DefenseEvasion"
                                   ],
                       "techniques":  [
                                          "T1562"
                                      ],
                       "displayName":  "BAH_Trello_MD5_Hash",
                       "enabled":  true,
                       "description":  "This analytic will check MD5 Hash IOC in the Trello malicious first-stage downloader used by Russian Foreign Intelligence Service.\nPLATFORM:Microsoft 365,Windows\nMITRE:TA0005;T1562",
                       "alertRuleTemplateName":  null,
                       "lastModifiedUtc":  "2024-10-02T22:13:10.1265238Z"
                   }
}
