{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/dcbb61a2-b574-4a62-bb1f-108713656830",
    "name":  "dcbb61a2-b574-4a62-bb1f-108713656830",
    "etag":  "\"8700cde2-0000-2700-0000-66fdcaa20000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "PT1H",
                       "queryPeriod":  "PT1H",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "Medium",
                       "query":  "//Author: Matt Schwartz\r\n//Description: This analytic looks for user consent granted to application registrations by an administrator.\r\n//False Positives: None known\r\n    let starttime = now(-14d);\r\n    let endtime = now();\r\n    let excludesync = \u002706c9ca02-8129-473d-8ae9-f964890b5706\u0027;\r\n    let Sparrow_BaseHunt_AuditLog=(opstable:(Category_:string,Operation:string)){\r\n    AuditLogs | where TimeGenerated between(starttime .. endtime) and InitiatedBy !has excludesync | join kind=inner opstable on $left.OperationName == $right.Operation | mv-expand TargetResources, AdditionalDetails, InitiatedBy| extend ib_app = \"\", ib_user = \"\", tr_modifiedProperties = dynamic(null), tr_type = \"\", tr_displayName = \"\", tr_id = \"\"| extend tr = parse_json(TargetResources), ad = parse_json(AdditionalDetails), ib = parse_json(InitiatedBy)| evaluate bag_unpack(tr, \u0027tr_\u0027, columnsConflict=\u0027replace_source\u0027)| evaluate bag_unpack(ad, \u0027ad_\u0027, columnsConflict=\u0027replace_source\u0027)| evaluate bag_unpack(ib, \u0027ib_\u0027, columnsConflict=\u0027replace_source\u0027)| extend app_actor = iif(isnotempty(ib_app),true,false)| extend obj_actor = iif(app_actor, parse_json(ib_app), parse_json(ib_user))| extend actor_id = iif(app_actor,coalesce(obj_actor.appId,obj_actor.servicePrincipalId),obj_actor.userPrincipalName)| extend actor_name = iif(app_actor,obj_actor.displayName,obj_actor.userPrincipalName)| extend actor_type = iif(app_actor,\"App\",\"User\")| extend tr_modifiedProperties = iif(tr_modifiedProperties==\"[]\",dynamic(null),tr_modifiedProperties)| mv-expand tr_modifiedProperties| extend newValue = tostring(tr_modifiedProperties.newValue)| extend oldValue = tostring(tr_modifiedProperties.oldValue)| extend set1 = parse_json(newValue)| extend set2 = parse_json(oldValue)| extend diff = set_difference(set1, set2)| parse diff with * \"KeyIdentifier=\" keyIdentifier:string \",KeyType=\" keyType:string \",KeyUsage=\" keyUsage:string \",DisplayName=\" keyDisplayName:string \"]\" *| extend credential = case(keyType != \"\", keyType, \"Other/not logged\")\r\n    };\r\n    Sparrow_BaseHunt_AuditLog(datatable(Category_:string,Operation:string)[\r\n        \u0027Consent_Operations\u0027,\u0027Consent to application\u0027\r\n        ,\u0027Consent_Operations\u0027,\u0027Add OAuth2PermissionGrant\u0027\r\n        ])\r\n    | extend propertyName = tostring(tr_modifiedProperties.displayName)\r\n    | extend bPermission = iif(propertyName==\"ConsentAction.Permissions\",true,false)\r\n    | extend bServicePrincipal = iif(propertyName==\"TargetId.ServicePrincipalNames\",true,false)\r\n    | extend bAdmin = iif(propertyName==\"ConsentContext.IsAdminConsent\",true,false)\r\n    | extend bAppOnly = iif(propertyName==\"ConsentContext.IsAppOnly\",true,false)\r\n    | extend bForAll = iif(propertyName==\"ConsentContext.OnBehalfOfAll\",true,false)\r\n    | extend diff = iff(tobool(binary_or(binary_or(binary_or(bServicePrincipal,bAdmin),bAppOnly),bForAll)), set_difference(pack_array(set1), pack_array(set2)), diff)\r\n    | parse newValue with \"\\\"\" oldConsent:string \" =\u003e \" newConsent:string \"\\\"\"\r\n    | extend kvpNew = todynamic(iff(bPermission,extract_all(@\"(\\w*):\\s*([^,\\];]*),?\",newConsent),\u0027\u0027))\r\n    | mv-apply kvpNew on (\r\n        summarize newBag = make_bag(pack(tostring(kvpNew[0]),tostring(kvpNew[1])))\r\n        )\r\n    | evaluate bag_unpack(newBag, \"consent\")\r\n    | extend ServicePrincipalAssigned = iif(bServicePrincipal, diff, \u0027\u0027)\r\n    | extend AdminConsent = iif(bAdmin, diff, \u0027\u0027)\r\n    | extend AppOnlyConsent = iif(bAppOnly, diff, \u0027\u0027)\r\n    | extend ForAllConsent = iif(bForAll, diff, \u0027\u0027)\r\n    | extend consentScope = column_ifexists(\u0027consentScope\u0027, \u0027\u0027)\r\n    | extend consentClientId = column_ifexists(\u0027consentClientId\u0027, \u0027\u0027)\r\n    | extend consentPrincipalId = column_ifexists(\u0027consentPrincipalId\u0027, \u0027\u0027)\r\n    | extend consentResourceId = column_ifexists(\u0027consentResourceId\u0027, \u0027\u0027)\r\n    | extend consentConsentType = column_ifexists(\u0027consentConsentType\u0027, \u0027\u0027)\r\n    | extend consentId = column_ifexists(\u0027consentId\u0027, \u0027\u0027)\r\n    | extend ad_key = column_ifexists(\u0027ad_key\u0027, \u0027\u0027)\r\n    | extend ad_value = column_ifexists(\u0027ad_value\u0027, \u0027\u0027)\r\n    | extend consentScope = split(consentScope,\" \")\r\n    | mv-apply consentScope on (\r\n        summarize make_set_if(consentScope,isnotempty(consentScope))\r\n        )\r\n    | summarize FirstTime = min(TimeGenerated), LastTime = max(TimeGenerated), Duration = max(TimeGenerated) - min(TimeGenerated), Result = make_set_if(Result,isnotempty(Result))\r\n        , actor_type = make_set_if(actor_type,isnotempty(actor_type)), actor_id = make_set_if(actor_id,isnotempty(actor_id)), actor_name = make_set_if(actor_name,isnotempty(actor_name))\r\n        , OperationName = make_set_if(OperationName,isnotempty(OperationName)), tr_displayName = make_set_if(tr_displayName,isnotempty(tr_displayName)), tr_type = make_set_if(tr_type,isnotempty(tr_type))\r\n        , tr_id = make_set_if(tr_id,isnotempty(tr_id)), consentScope = make_set(set_consentScope), consentClientId = make_set_if(consentClientId,isnotempty(consentClientId))\r\n        , ServicePrincipalAssigned = make_set_if(ServicePrincipalAssigned,isnotempty(ServicePrincipalAssigned))\r\n        , AdminConsent = make_set_if(AdminConsent,isnotempty(AdminConsent)), AppOnlyConsent = make_set_if(AppOnlyConsent,isnotempty(AppOnlyConsent))\r\n        , consentPrincipalId = make_set_if(consentPrincipalId,isnotempty(consentPrincipalId)), consentResourceId = make_set_if(consentResourceId,isnotempty(consentResourceId))\r\n        , consentConsentType = make_set_if(consentConsentType,isnotempty(consentConsentType)), consentId = make_set_if(consentId,isnotempty(consentId))\r\n        , ForAllConsent = make_set_if(ForAllConsent,isnotempty(ForAllConsent)), ResultReason = make_set_if(ResultReason,isnotempty(ResultReason))\r\n        , ad_key = make_set_if(ad_key,isnotempty(ad_key)), ad_value = make_set_if(ad_value,isnotempty(ad_value)) by CorrelationId\r\n    | extend Actor = actor_name[0]\r\n    | extend ServicePrincipalAssigned = todynamic(tostring(ServicePrincipalAssigned[0]))[0]\r\n    | extend ForAllConsent = tobool(todynamic(tostring(ForAllConsent[0]))[0])\r\n    | extend AdminConsent = tobool(todynamic(tostring(AdminConsent[0]))[0])\r\n    | extend ConsentTypeAll = iif(tostring(consentConsentType[0])==\"Principal\",false,true)\r\n    | extend ActorId = actor_id[0]\r\n    | extend Result = Result[0]\r\n    | extend TargetResourceId = tostring(tr_id[0])\r\n    | extend TargetResource = tr_displayName[0]\r\n    | extend cntConsentScope = array_length(consentScope)\r\n    | extend sConsentScope = iif(cntConsentScope\u003e0,iif(cntConsentScope\u003c6,strcat(\u0027\"\u0027,trim_end(\"\u0027, \",strcat_array(consentScope,\u0027, \u0027)),\u0027\"\u0027),tostring(cntConsentScope)),\"\")\r\n    | extend success_statement = iif(Result=~\"success\",\"consented to\",\"did not consent to\")\r\n    | extend consent_path = iif(ForAllConsent,\"on behalf of the entire organization\",iff(AdminConsent,\"an admin-level consent flow\",\"an app-level consent flow\"))\r\n    | extend principal_scope = iff(ConsentTypeAll,\"AllPrincipals\",strcat(\"Service Principal (\",ServicePrincipalAssigned,\")\"))\r\n    | extend threat_commentary_strategy = iif(OperationName has \u0027Consent\u0027,true,false)\r\n    | extend threat_commentary = iff(threat_commentary_strategy\r\n        , strcat(\"User \",Actor,\" (\",ActorId,\") \",success_statement,\" \",consent_path,\" allowing \",principal_scope,\" to have \",sConsentScope,\" permissions for use with the application named \\\"\",TargetResource,\"\\\" (\",TargetResourceId,\")\")\r\n        , \"Actor (ActorId) [consented to|did not consent to] [on behalf of the entire organization|an admin consent|an app consent flow] granting [AllPrincipals|Service Principal] ServicePrincipalAssigned (ServicePrincipalId) have [consentScope|cntConsentScope] permissions for use with the application named \\\"tr_displayName\\\"\"\r\n        )\r\n    | project FirstTime, LastTime, Duration, OperationName, CorrelationId, Actor, ActorId, ServicePrincipalAssigned, ForAllConsent, AdminConsent, ConsentTypeAll, TargetResource, TargetResourceId, ResultReason, Result, threat_commentary\r\n\r\n",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5H",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  [

                                                                                                           ],
                                                                                   "groupByCustomDetails":  [

                                                                                                            ]
                                                                               }
                                                 },
                       "entityMappings":  [
                                              {
                                                  "entityType":  "Host",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "HostName",
                                                                            "columnName":  "Result"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "Account",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "Name",
                                                                            "columnName":  "OperationName"
                                                                        }
                                                                    ]
                                              }
                                          ],
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [
                                       "InitialAccess",
                                       "Persistence",
                                       "PrivilegeEscalation"
                                   ],
                       "techniques":  [
                                          "T1078",
                                          "T1134"
                                      ],
                       "displayName":  "BAH_Grant_AppConsent_OAuth2",
                       "enabled":  true,
                       "description":  "This analytic looks for user consent granted to application registrations by an administrator.\nPLATFORM:Azure AD\nMITRE:T00001;T1078,TA0004;T1134",
                       "alertRuleTemplateName":  null,
                       "lastModifiedUtc":  "2024-10-02T22:35:13.5515935Z"
                   }
}
