{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/9839a523-c705-4175-9a62-2c8d78961385",
    "name":  "9839a523-c705-4175-9a62-2c8d78961385",
    "etag":  "\"2d00b28d-0000-2700-0000-64e4ad980000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "PT1H",
                       "queryPeriod":  "P1D",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "Low",
                       "query":  "//Author: Ginna Woo\r\n//Description: SharePointFileOperation - Looks at sharepoint file operations targeting users specific uploads and downloads of files exceeding 50 threshold on an unseen IP. Identifies when the volume of documents uploaded to or downloaded from Sharepoint by new IP addresses exceeds a threshold (default is 50).\r\n//False Positives: None known\r\nlet threshold = 5; //FILE DOWNLOAD/UPLOAD THESHOULD\r\nlet szSharePointFileOperation = \"SharePointFileOperation\"; //can add other RecordType as needed\r\nlet szOperations = dynamic([\"FileDownloaded\", \"FileUploaded\"]); //can add other Operations as needed\r\nlet starttime = 14d; //returns 14 days of records from the OfficeActivity table that do not match any record that the system has seen previously (Looks for rareIPs)\r\nlet InvestigationPriorityThreshold = 1;\r\nlet allowList =\r\n    toscalar(\r\n    (externaldata(BCAP: string)[@\"https://dod365csspstorage.blob.core.usgovcloudapi.net/ueba/ip.csv\"] with (format=\"csv\", ignoreFirstRecord=True))\r\n    | summarize make_list(BCAP)); //whitelist\r\nlet RareActivity =\r\n    OfficeActivity\r\n    | where TimeGenerated \u003e= ago(starttime)\r\n    | where RecordType == szSharePointFileOperation\r\n    | where Operation in (szOperations)\r\n    | where not(ipv4_is_in_any_range(ClientIP, allowList)) //checks against allowList (whitelist)\r\n    | summarize\r\n        StartTime = min(Start_Time),\r\n        EndTime=max(Start_Time),\r\n        recentCount = count(),\r\n        UserId=any(UserId)\r\n        by\r\n        ClientIP,\r\n        RecordType,\r\n        Operation,\r\n        UserType,\r\n        OfficeWorkload,\r\n        Site_Url,\r\n        OfficeObjectId,\r\n        UserAgent\r\n    | where StartTime \u003e= ago(1h)\r\n    // More than 50 downloads/uploads from a new IP\r\n    | where recentCount \u003e threshold;\r\n//RareActivity\r\n//joins with UEBA tables (IdentityInfo + BehaviorAnalytics)\r\nlet RareIdentity =\r\n    RareActivity\r\n    | join kind=innerunique (IdentityInfo\r\n        | where TimeGenerated \u003e= ago(starttime)\r\n        | where AccountUPN !has \"disable\"\r\n        | extend DepartmentCode = tostring(split(split(Department, \u0027 \u0027)[0], \u0027-\u0027)[0]))\r\n        on $left.UserId == $right.AccountUPN\r\n        | where (Site_Url) !contains DepartmentCode//Site Validation \r\n        | extend UserIdSyntax = replace_string(replace_string(UserId, \u0027.\u0027, \u0027_\u0027), \"@\", \"_\") //ignore personal accounts\r\n        | where (Site_Url) !contains (UserIdSyntax)\r\n    | project\r\n        tostring(AccountDisplayName),\r\n        UserId=tostring(AccountUPN),\r\n        StartTime,\r\n        DepartmentCode,\r\n        GroupMembership,\r\n        State,\r\n        City,\r\n        Country,\r\n        Department,\r\n        JobTitle,\r\n        AssignedRoles,\r\n        ClientIP,\r\n        RecordType,\r\n        Operation,\r\n        UserType,\r\n        App=OfficeWorkload,\r\n        Site_Url,\r\n        OfficeObjectId,\r\n        UserAgent,\r\n        recentCount\r\n    | distinct\r\n        tostring(AccountDisplayName),\r\n        UserId,\r\n        tostring(GroupMembership),\r\n        TimeGenerated=StartTime,\r\n        State,\r\n        City,\r\n        Country,\r\n        Department,\r\n        JobTitle,\r\n        tostring(AssignedRoles),\r\n        ClientIP,\r\n        RecordType,\r\n        Operation,\r\n        UserType,\r\n        App,\r\n        Site_Url,\r\n        OfficeObjectId,\r\n        UserAgent,\r\n        recentCount,\r\n        tostring(DepartmentCode);\r\nBehaviorAnalytics\r\n| where TimeGenerated \u003e= ago(30d)\r\n| where InvestigationPriority \u003e= InvestigationPriorityThreshold//ADJUST\r\n| project InvestigationPriority, ActivityInsights, UserId= UserPrincipalName\r\n| join kind=innerunique RareIdentity\r\n    on $left.UserId == $right.UserId\r\n| evaluate bag_unpack(ActivityInsights, columnsConflict=\"replace_source\")\r\n| extend ActionUncommonlyPerformedByUser = column_ifexists(\"ActionUncommonlyPerformedByUser\", \"\")\r\n| extend UncommonHighVolumeOfActions = column_ifexists(\"UncommonHighVolumeOfActions\", \"\")\r\n| extend Resource = column_ifexists(\"Resource\", \"\")\r\n//| where ActionUncommonlyPerformedByUser == True\r\n//| where UncommonHighVolumeOfActions == True\r\n| project-away UserId1, Resource\r\n| project-reorder TimeGenerated, AccountDisplayName, UserId, GroupMembership",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5M",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  [

                                                                                                           ],
                                                                                   "groupByCustomDetails":  [

                                                                                                            ]
                                                                               }
                                                 },
                       "entityMappings":  [
                                              {
                                                  "entityType":  "IP",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "Address",
                                                                            "columnName":  "ClientIP"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "Account",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "AadUserId",
                                                                            "columnName":  "UserId"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "URL",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "Url",
                                                                            "columnName":  "Site_Url"
                                                                        }
                                                                    ]
                                              }
                                          ],
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [

                                   ],
                       "techniques":  [

                                      ],
                       "displayName":  "BAH_UEBA_5-SharePointFileOperation",
                       "enabled":  true,
                       "description":  "Looks at sharepoint file operations targeting users specific uploads and downloads of files exceeding 50 threshold on an unseen IP and Identifies when the volume of documents uploaded to or downloaded from Sharepoint by new IP addresses exceeds a threshold (default is 50).",
                       "alertRuleTemplateName":  null,
                       "lastModifiedUtc":  "2023-08-22T12:44:06.4413972Z"
                   }
}
