{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/42b7512e-8957-437f-bef9-4878c319b5f8",
    "name":  "42b7512e-8957-437f-bef9-4878c319b5f8",
    "etag":  "\"87007e73-0000-2700-0000-66fdc3800000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "P1D",
                       "queryPeriod":  "P1D",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "High",
                       "query":  "// BAH_XZUtils_IOCs\r\n  // Author: Shawn McWhirter\r\n  // Description:A reported supply chain compromise found in the XZ Utils library (formerly known as LZMA Utils). The malicious code, which was introduced by a previously trusted developer, attempts to weaken the authentication of SSH sessions via SSHD. The affected versions of XZ are not widely distributed and are typically found in the most bleeding-edge Linux distribution builds such as the fedora rawhide and debian testing and unstable distributions.\r\n  // \"https://www.crowdstrike.com/blog/cve-2024-3094-xz-upstream-supply-chain-attack/\", \"https://www.openwall.com/lists/oss-security/2024/03/29/4\", \"https://security.apps.mil/homepage?tid=102d0191-eeae-4761-b1cb-1a83e86ef445\"\r\n  // False Positives: N/A\r\n  let ActionTypes = dynamic([\"FileCreated\", \"FileModified\"]);\r\n  let FileNames = dynamic([\"bad-3-corrupt_lzma2.xz\", \"bad-dict_size.lzma\", \"good-2cat.xz\", \"good-large_compressed.lzma\", \"good-small_compressed.lzma\", \"build-to-host.m4\"]);\r\n  let SHA256s = dynamic([\"319feb5a9cddd81955d915b5632b4a5f8f9080281fb46e2f6d69d53f693c23ae\",\r\n      \"605861f833fc181c7cdcabd5577ddb8989bea332648a8f498b4eef89b8f85ad4\",\r\n      \"8fa641c454c3e0f76de73b7cc3446096b9c8b9d33d406d38b8ac76090b0344fd\",\r\n      \"b418bfd34aa246b2e7b5cb5d263a640e5d080810f767370c4d2c24662a274963\",\r\n      \"cbeef92e67bf41ca9c015557d81f39adaba67ca9fb3574139754999030b83537\",\r\n      \"13bdc7473154593a0cf6456561cd543f1f341a7621f5863054c88ba49534e569\",\r\n      \"0c9a148be4dc52ae3c2b10c68b2ccbc5eda7b6a550128b4b7c0ea0a7efec1a89\",\r\n      \"f0121dc056607058f46fe60610ac472d8278f50729e5d7d2e5023bd04ea11fbd\",\r\n      \"616e38159153b8aa2a98193ae5325597b8732443421c81d0a57bd878b2c6d2a8\",\r\n      \"b334e3d936e7f59e3e1a526328ef4377718d394b44e7b9eb8ed1485ea48fde2f\",\r\n      \"5448850cdc3a7ae41ff53b433c2adbd0ff492515012412ee63a40d2685db3049\",\r\n      \"054003928e240de8b9f3232e1bb885a5b6cc09488742159a0e3d6080e16499f4\",\r\n      \"8c8bf0346d79993b99f69bac212df33a558d648bb2d13038ae7835e85fd8cb25\",\r\n      \"05fa6f90e75ae713aea5e514fc20709ee0d185a5006c37d044980943dd9227ab\",\r\n      \"237284fae40e5f8e9908f0a977e7d0b9a5c7c1c10a41b8e6ed0fb40e930467c8\",\r\n      \"876a17247dd0be61925b062008145b703e9fe30bbfae24c7127017e9c7df4130\",\r\n      \"88c8631cefba91664fdc47b14bb753e1876f4964a07db650821d203992b1e1ea\",\r\n      \"0f5c81f14171b74fcc9777d302304d964e63ffc2d7b634ef023a7249d9b5d875\",\r\n      \"cdafe1632f139c82937cc1ed824f7a60b7b0a0619dfbbd681dcac02b1ac28f5b\",\r\n      \"80c8afc89e842d739c0acc4eb30d4fe2963ce4b28915bee526092213328e92c6\",\r\n      \"d300422649a0124b1121630be559c890ceedf32667d7064b8128933166c217c8\",\r\n      \"2398f4a8e53345325f44bdd9f0cc7401bd9025d736c6d43b372f4dea77bf75b8\",\r\n      \"f334777310ca3ae9ba07206d78ed286a655aa3f44eec27854f740c26b2cd2ed0\",\r\n      \"2a3e54048752d5d31f85fbda912ab126f7101186c6f3e7a54dcee47cf751a63f\"]);\r\n  let Cmds = dynamic([\"\\\\114-\\\\321\\\\322-\\\\377\\\\35-\\\\47\\\\14-\\\\34\\\\0-\\\\13\\\\50-\\\\113 \\\\0-\\\\377\",\r\n      \"\\\\5-\\\\51\\\\204-\\\\377\\\\52-\\\\115\\\\132-\\\\203\\\\0-\\\\4\\\\116-\\\\131 \\\\0-\\\\377\"]);\r\n  let signInLookup = (\r\n      SigninLogs\r\n      | where TimeGenerated \u003e= ago(1d)\r\n      | where DeviceDetail contains \"displayName\"\r\n      | extend DeviceDetailJson = parse_json(DeviceDetail)\r\n      | extend DeviceNameSI = tostring(DeviceDetailJson.displayName)\r\n      | distinct DeviceNameSI, UserPrincipalName, UserDisplayName\r\n      );\r\n  (union isfuzzy=True\r\n      (\r\n      DeviceProcessEvents\r\n      | where ProcessCommandLine has_any (Cmds)\r\n      | extend SILogDeviceName = toupper((split(DeviceName, \".\"))[0])\r\n      | join kind=leftouter signInLookup on $left.SILogDeviceName == $right.DeviceNameSI\r\n      | project\r\n          TimeGenerated,\r\n          DeviceName,\r\n          UserPrincipalName,\r\n          FileName,\r\n          FolderPath,\r\n          SHA256,\r\n          ProcessCommandLine,\r\n          Tactic = \"Malicious XZ Utilities command usage\"\r\n      ),\r\n      (\r\n      DeviceFileEvents\r\n      | where ActionType in (ActionTypes) and FileName in (FileNames) and SHA256 in (SHA256s)\r\n      | extend SILogDeviceName = toupper((split(DeviceName, \".\"))[0])\r\n      | join kind=leftouter signInLookup on $left.SILogDeviceName == $right.DeviceNameSI\r\n      | project\r\n          TimeGenerated,\r\n          DeviceName,\r\n          UserPrincipalName,\r\n          RequestAccountName,\r\n          FileName,\r\n          FolderPath,\r\n          SHA256,\r\n          InitiatingProcessCommandLine,\r\n          Tactic = \"Malicious XZ Utilities related files\")\r\n  )",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5H",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  [

                                                                                                           ],
                                                                                   "groupByCustomDetails":  [

                                                                                                            ]
                                                                               }
                                                 },
                       "entityMappings":  [
                                              {
                                                  "entityType":  "Host",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "HostName",
                                                                            "columnName":  "DeviceName"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "Account",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "Name",
                                                                            "columnName":  "UserPrincipalName"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "File",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "Name",
                                                                            "columnName":  "FileName"
                                                                        },
                                                                        {
                                                                            "identifier":  "Directory",
                                                                            "columnName":  "FolderPath"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "FileHash",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "Value",
                                                                            "columnName":  "SHA256"
                                                                        }
                                                                    ]
                                              }
                                          ],
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [
                                       "LateralMovement",
                                       "Execution",
                                       "InitialAccess",
                                       "Discovery",
                                       "CommandAndControl"
                                   ],
                       "techniques":  [
                                          "T1021",
                                          "T1059",
                                          "T1190",
                                          "T1033",
                                          "T1219"
                                      ],
                       "displayName":  "BAH_XZUtils_IOCs",
                       "enabled":  true,
                       "description":  "A reported supply chain compromise found in the XZ Utils library (formerly known as LZMA Utils). The malicious code, which was introduced by a previously trusted developer, attempts to weaken the authentication of SSH sessions via SSHD. The affected versions of XZ are not widely distributed and are typically found in the most bleeding-edge Linux distribution builds such as the fedora rawhide and debian testing and unstable distributions.\nPLATFORM:Microsoft 365,Azure AD,Windows,IaaS\nMITRE:TA0001;T1190,TA0002;T1059,TA0007;T1033,TA0008;T1021,TA0011;T1219",
                       "alertRuleTemplateName":  null,
                       "lastModifiedUtc":  "2024-10-02T22:04:44.8536268Z"
                   }
}
