{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/6d7521ff-1f2a-4387-bc4a-5ea0f6cc2b9f",
    "name":  "6d7521ff-1f2a-4387-bc4a-5ea0f6cc2b9f",
    "etag":  "\"87001bc1-0000-2700-0000-66fdc8490000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "PT1H",
                       "queryPeriod":  "PT1H",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "High",
                       "query":  "// Author: Rob Russell\r\n// Description: Detects the use of netsh to create a proxy\r\n// https://www.microsoft.com/en-us/security/blog/2023/05/24/volt-typhoon-targets-us-critical-infrastructure-with-living-off-the-land-techniques/\r\n// https://www.mandiant.com/resources/blog/bypassing-network-restrictions-through-rdp-tunneling\r\n// https://www.dfirnotes.net/portproxy_detection/\r\n// False Positives: no known false positives\r\nlet signInLookup = (\r\nSigninLogs \r\n| where TimeGenerated \u003e= ago(1d)\r\n| where DeviceDetail contains \"displayName\"\r\n| extend DeviceDetailJson = parse_json(DeviceDetail)\r\n| extend DeviceNameSI = tostring(DeviceDetailJson.displayName)\r\n| distinct DeviceNameSI, UserPrincipalName\r\n);\r\n(union isfuzzy=True\r\n    (\r\n    DeviceProcessEvents \r\n    | where (\r\n            (InitiatingProcessFolderPath endswith @\"\\netsh.exe\") and \r\n    (\r\n    (InitiatingProcessCommandLine has_all (\"interface\",\"portproxy\", \"add\", \"v4tov4\")) or \r\n    (InitiatingProcessCommandLine has_all (\"i \", \"p \", \"a \", \"v \")) or \r\n    (InitiatingProcessCommandLine has_all (\"connectp\", \"listena\", \"c=\"))\r\n    )\r\n    )\r\n    | extend SILogDeviceName = toupper((split(DeviceName, \".\"))[0])\r\n    | join kind=leftouter signInLookup on $left.SILogDeviceName == $right.DeviceNameSI\r\n    | project TimeGenerated, DeviceName, UserPrincipalName, InitiatingProcessAccountName, ActionType, InitiatingProcessCommandLine, Tactic = \"proxy detected via netsh\"\r\n    ),(\r\n    DeviceRegistryEvents \r\n    | where (RegistryKey == @\"HKLM\\SYSTEM\\CurrentControlSet\\Services\\PortProxy\\v4tov4\\tcp\")\r\n    | extend SILogDeviceName = toupper((split(DeviceName, \".\"))[0])\r\n    | join kind=leftouter signInLookup on $left.SILogDeviceName == $right.DeviceNameSI\r\n    | project TimeGenerated, DeviceName, UserPrincipalName, InitiatingProcessAccountName, ActionType, RegistryKey, Tactic = \"proxy detected via registry\"\r\n    )\r\n)",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5M",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  null,
                                                                                   "groupByCustomDetails":  null
                                                                               }
                                                 },
                       "customDetails":  {
                                             "Details":  "Tactic"
                                         },
                       "entityMappings":  [
                                              {
                                                  "entityType":  "Account",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "FullName",
                                                                            "columnName":  "UserPrincipalName"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "Host",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "FullName",
                                                                            "columnName":  "DeviceName"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "RegistryKey",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "Key",
                                                                            "columnName":  "RegistryKey"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "Process",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "CommandLine",
                                                                            "columnName":  "InitiatingProcessCommandLine"
                                                                        }
                                                                    ]
                                              }
                                          ],
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [
                                       "Persistence",
                                       "PrivilegeEscalation",
                                       "DefenseEvasion",
                                       "Discovery",
                                       "CommandAndControl"
                                   ],
                       "techniques":  [
                                          "T1546",
                                          "T1562",
                                          "T1518",
                                          "T1090"
                                      ],
                       "displayName":  "BAH_NetshProxy",
                       "enabled":  true,
                       "description":  "Detects the use of netsh to create a proxy                                                                                                                                                                                                                                              \n https://www.microsoft.com/en-us/security/blog/2023/05/24/volt-typhoon-targets-us-critical-infrastructure-with-living-off-the-land-techniques/\n https://www.mandiant.com/resources/blog/bypassing-network-restrictions-through-rdp-tunneling\n https://www.dfirnotes.net/portproxy_detection/\nPLATFORM:Windows\nMITRE:TA0011;T1090",
                       "alertRuleTemplateName":  null,
                       "lastModifiedUtc":  "2024-10-02T22:25:09.9485335Z"
                   }
}
