{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/7d8ccc4b-9a87-4ea0-b3bd-4f6044d612de",
    "name":  "7d8ccc4b-9a87-4ea0-b3bd-4f6044d612de",
    "etag":  "\"bc19bd39-0000-2700-0000-676974c40000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "PT3H",
                       "queryPeriod":  "PT3H",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "High",
                       "query":  "SigninLogs\r\n| where ResultType == 70044\r\n| take 1\r\n",
                       "suppressionDuration":  "P1D",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5H",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  [

                                                                                                           ],
                                                                                   "groupByCustomDetails":  [

                                                                                                            ]
                                                                               }
                                                 },
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [

                                   ],
                       "techniques":  [

                                      ],
                       "displayName":  "BAH_Test Analytic",
                       "enabled":  true,
                       "description":  "This is a test alert to validate AutoAssignIncident. Alerts occur every 3 hours (updated 12/19/2024). Live notifications are generated on Teams and Outlook for testing purposes. Please close this incident. Thank you.",
                       "alertRuleTemplateName":  null,
                       "lastModifiedUtc":  "2024-12-23T14:33:39.2063208Z"
                   }
}
