{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/47de9f00-62dc-4da3-9c69-b481f32c3eb3",
    "name":  "47de9f00-62dc-4da3-9c69-b481f32c3eb3",
    "etag":  "\"8800f402-0000-2700-0000-66fdccaf0000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "P1D",
                       "queryPeriod":  "P1D",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "Medium",
                       "query":  "//BAH_ChromeLoader\n//Author: Shawn McWhirter\n//Description: ChromeLoader is a type of malware that masquerades as a legitimate Google Chrome browser extension or application. Once installed, ChromeLoader can perform a range of malicious actions, such as stealing sensitive data, displaying unwanted advertisements, and redirecting the user\u0027s browser to phishing websites or other malicious content. It can also modify the user\u0027s browser settings, such as the default search engine and home page, without their consent.\n//https://thehackernews.com/2022/05/experts-warn-of-rise-in-chromeloader.html, https://app.snapattack.com/detection/cd0def01-3aa8-4605-a2ce-eaad77273ac0?page=1\u0026sort_by=relevancettack, https://app.snapattack.com/detection/2df78eae-8c0c-4e34-88fa-e41512baec75, https://redcanary.com/threat-detection-report/threats/chromeloader/, https://www.th3protocol.com/2022/Choziosi-Loader\n//False Positives: Usage of Chrome Extensions in testing tools such as BurpSuite will trigger this alert.\nlet signInLookup = (\nSigninLogs\n| where TimeGenerated \u003e= ago(1d)\n| where DeviceDetail contains \"displayName\"\n| extend DeviceDetailJson = parse_json(DeviceDetail)\n| extend DeviceNameSI = tostring(DeviceDetailJson.displayName)\n| distinct DeviceNameSI, UserPrincipalName, UserDisplayName\n);\n(union isfuzzy=True\n    (\n    DeviceProcessEvents\n    | where (FolderPath contains @\"\\brave.exe\" or FolderPath contains @\"\\chrome.exe\" or FolderPath contains @\"\\msedge.exe\" or FolderPath contains @\"\\opera.exe\" or FolderPath contains @\"\\vivaldi.exe\") and (ProcessCommandLine contains \"--load-extension=\" and ProcessCommandLine contains @\"\\AppData\\Roaming\\extension\")\n    | extend SILogDeviceName = toupper((split(DeviceName, \".\"))[0])\n    | join kind=leftouter signInLookup on $left.SILogDeviceName == $right.DeviceNameSI\n    | project TimeGenerated, AccountName, UserPrincipalName, DeviceName, DeviceId, InitiatingProcessAccountName, FolderPath, ProcessCommandLine, ActionType, ProcessVersionInfoCompanyName, InitiatingProcessVersionInfoInternalFileName)\n    )",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5M",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  null,
                                                                                   "groupByCustomDetails":  null
                                                                               }
                                                 },
                       "entityMappings":  [
                                              {
                                                  "entityType":  "Process",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "CommandLine",
                                                                            "columnName":  "InitiatingProcessAccountName"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "Host",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "HostName",
                                                                            "columnName":  "DeviceName"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "File",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "Name",
                                                                            "columnName":  "FolderPath"
                                                                        },
                                                                        {
                                                                            "identifier":  "Directory",
                                                                            "columnName":  "InitiatingProcessVersionInfoInternalFileName"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "Account",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "Name",
                                                                            "columnName":  "UserPrincipalName"
                                                                        }
                                                                    ]
                                              }
                                          ],
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [
                                       "Persistence",
                                       "InitialAccess",
                                       "Execution"
                                   ],
                       "techniques":  [
                                          "T1176",
                                          "T1566",
                                          "T1059"
                                      ],
                       "displayName":  "BAH_ChromeLoader",
                       "enabled":  true,
                       "description":  "ChromeLoader is a type of malware that masquerades as a legitimate Google Chrome browser extension or application. Once installed, ChromeLoader can perform a range of malicious actions, such as stealing sensitive data, displaying unwanted advertisements, and redirecting the user\u0027s browser to phishing websites or other malicious content. It can also modify the user\u0027s browser settings, such as the default search engine and home page, without their consent.\nPLATFORM:Windows,Microsoft 365,Azure AD,IaaS\nMITRE:TA0001;T1566,TA0002;T1059,TA0003;T1176",
                       "alertRuleTemplateName":  null,
                       "lastModifiedUtc":  "2024-10-02T22:43:58.94321Z"
                   }
}
