{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/fb6928e3-45a5-4d6d-b0db-bf4453d0ff8c",
    "name":  "fb6928e3-45a5-4d6d-b0db-bf4453d0ff8c",
    "etag":  "\"87002159-0000-2700-0000-66fdc1a90000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "PT5M",
                       "queryPeriod":  "PT5M",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "Medium",
                       "query":  "SigninLogs\r\n| where UserPrincipalName == \"dodina@dod365.onmicrosoft.us\"",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5H",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  [

                                                                                                           ],
                                                                                   "groupByCustomDetails":  [

                                                                                                            ]
                                                                               }
                                                 },
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [
                                       "Impact"
                                   ],
                       "techniques":  [
                                          "T1485",
                                          "T1496",
                                          "T0813"
                                      ],
                       "displayName":  "DoD365 Breakglass account logs in",
                       "enabled":  true,
                       "description":  "Created by DEOS team to generate a Sentinel alert when the breakglass account logs in.\nPLATFORM:Azure AD,Microsoft 365,IaaS\nMITRE:TA0001;T1078;T1078.004",
                       "alertRuleTemplateName":  null,
                       "lastModifiedUtc":  "2024-10-02T21:56:56.975676Z"
                   }
}
