{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/4108cb09-9d3b-4bd2-b147-ae416ea8c668",
    "name":  "4108cb09-9d3b-4bd2-b147-ae416ea8c668",
    "etag":  "\"f41ac381-0000-2700-0000-676f41840000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "P1D",
                       "queryPeriod":  "P1D",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "Medium",
                       "query":  "DeviceInfo\r\n| where MachineGroup contains \"JSP\"\r\n| join kind=inner (DeviceNetworkEvents\r\n    | where ActionType == \"ConnectionSuccess\"\r\n    | where RemoteIP == \"27.102.113.57\" or RemoteIP == \"27.102.113.240\" or RemoteIP == \"27.102.114.55\" or RemoteIP == \"27.102.115.51\" or RemoteIP == \"27.102.129.120\" or RemoteIP == \"107.148.165.158\" or RemoteIP == \"154.223.135.214\"\r\n    or RemoteUrl contains \"impap.newlylab.com\" or RemoteUrl contains \"mail.reclubpress.com\" or RemoteUrl contains \"imap.webdignusdata.com\" or RemoteUrl contains \"freedecrease.com\" or RemoteUrl contains \"aftercould.com\" or RemoteUrl contains \"datacentreonline.com\" or RemoteUrl contains \"game.newfreepre.com\"\r\n    | project DeviceId, RemoteIP, RemoteUrl, Timestamp\r\n) on DeviceId\r\n| summarize count() by RemoteIP, RemoteUrl, bin(Timestamp, 1h)\r\n| where count_ \u003e 1 // Adjust the threshold as needed\r\n| project Timestamp, RemoteIP, RemoteUrl, count_\r\n| order by count_ desc",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5H",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  [

                                                                                                           ],
                                                                                   "groupByCustomDetails":  [

                                                                                                            ]
                                                                               }
                                                 },
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [
                                       "InitialAccess"
                                   ],
                       "techniques":  [

                                      ],
                       "displayName":  "J361 - DTO 24-0426 - IOC Search",
                       "enabled":  true,
                       "description":  "Analytic Rule for IOCs found in DTO 24-0426",
                       "alertRuleTemplateName":  null,
                       "lastModifiedUtc":  "2024-12-28T00:08:32.8353081Z"
                   }
}
