{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/692c23f5-44e5-4a1b-876d-e705d69d2448",
    "name":  "692c23f5-44e5-4a1b-876d-e705d69d2448",
    "etag":  "\"87005394-0000-2700-0000-66fdc5520000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "PT1H",
                       "queryPeriod":  "PT1H",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "Medium",
                       "query":  "// Author: Rob Russell\n// Description:\n// Based on attachment from DTO 22-0106\n// looks for Trello based URL activity\n// False Positives: No known false positives\nlet urlparts = dynamic([@\u00271/members/me/boards?\u0027\n@\u00271/boards/\u0027\n@\u0027/lists?key=\u0027\n@\u00271/cards?key=\u0027\n@\u0027/cards?key=\u0027\n@\u0027attachments?key=\u0027\n]);\n(union isfuzzy=true\n(DeviceEvents\n| where FileOriginUrl has_all(urlparts) or RemoteUrl has_all(urlparts)\n| project TimeGenerated, ActionType, FileOriginUrl, RemoteUrl, AccountName, AccountDomain, DeviceName, DeviceId\n),\n(DeviceNetworkEvents\n| where RemoteUrl has_all(urlparts)\n| project TimeGenerated, ActionType, RemoteUrl, DeviceName, DeviceId\n),\n(DeviceFileEvents\n| where FileOriginUrl has_all(urlparts) or FileOriginReferrerUrl has_all(urlparts)\n| project TimeGenerated, ActionType, FileOriginUrl, FileOriginReferrerUrl, DeviceName, DeviceId\n)\n)",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5M",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  null,
                                                                                   "groupByCustomDetails":  null
                                                                               }
                                                 },
                       "entityMappings":  [
                                              {
                                                  "entityType":  "Host",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "FullName",
                                                                            "columnName":  "DeviceName"
                                                                        }
                                                                    ]
                                              }
                                          ],
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [
                                       "DefenseEvasion"
                                   ],
                       "techniques":  [
                                          "T1562"
                                      ],
                       "displayName":  "BAH_Trello_URL",
                       "enabled":  true,
                       "description":  "This analytic will check URL IOC\u0027s used in the Trello malicious first-stage downloader by Russian Foreign Intelligence Service.\nPLATFORM:Microsoft 365,Windows,IaaS\nMITRE:TA0005;T1562",
                       "alertRuleTemplateName":  null,
                       "lastModifiedUtc":  "2024-10-02T22:12:33.0163194Z"
                   }
}
