{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/1bf328d3-ce67-4c91-bb3d-7feed2537bab",
    "name":  "1bf328d3-ce67-4c91-bb3d-7feed2537bab",
    "etag":  "\"8700f2be-0000-2700-0000-66fdc82d0000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "PT30M",
                       "queryPeriod":  "PT30M",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "High",
                       "query":  "// Author: Rob Russell\n// Description: \n// ATT\u0026CK Techniques: Collection T1005\n// adjusted for CSSP environment on 8/5/2022\n// downloadable IOC list has not been updated since 2021 so it is now hardcoded into analytic\n// Based on analytic published by MS here:\n// https://github.com/Azure/Azure-Sentinel/blob/6eddef69744c33eee7738d3043b2bd0184ae7583/Detections/MultipleDataSources/Nobelium_FoggyWeb.yaml\n// requires ADFS servezrs to be hardcoded into analytic\n//Identifies a match across various data feeds for IOCs related to FoggyWeb backdoor by the threat actor NOBELIUM. FoggyWeb is a passive and highly targeted backdoor capable of remotely exfiltrating sensitive information from a compromised AD FS server. It can also receive additional malicious components from a command-and-control (C2) server and execute them on the compromised server. Reference: https://aka.ms/nobelium-foggy-web\n// False Positives: Since this is based on IOC all alerts should be investigated\nlet iocs = datatable(DateAdded:string,IoC:string,Type:string, TLP:string)[\n\"10/22/2021\",\"231b5517b583de102cde59630c3bf938155d17037162f663874e4662af2481b1\",\"sha256\",\"White\",\n\"10/22/2021\",\"da0be762bb785085d36aec80ef1697e25fb15414514768b3bcaf798dd9c9b169\",\"sha256\",\"White\",\n\"10/22/2021\",\"568392bd815de9b677788addfc4fa4b0a5847464b9208d2093a8623bbecd81e6\",\"sha256\",\"White\",\n\"10/22/2021\",\"Windows\\\\SystemResources\\\\Windows.Data.TimeZones\\\\pris\\\\Windows.Data.TimeZones.zh-PH.pri\",\"FilePath\",\"White\",\n\"10/22/2021\",\"Windows\\\\ADFS\\\\version.dll\",\"FilePath\",\"White\",\n\"10/22/2021\",\"/adfs/services/trust/2005/samlmixed/upload\",\"URI1\",\"White\",\n\"10/22/2021\",\"/adfs/portal/images/theme/light01/profile.webp\",\"URI2\",\"White\",\n\"10/22/2021\",\"/adfs/portal/images/theme/light01/logo.webp\",\"URI2\",\"White\",\n\"10/22/2021\",\"/adfs/portal/images/theme/light01/background.webp\",\"URI2\",\"White\"\n];\nlet sha256Hashes = (iocs | where Type == \"sha256\" | project IoC);\nlet FilePaths = (iocs | where Type =~ \"FilePath\" | project IoC);\nlet POST_URI = (iocs | where Type =~ \"URI1\" | project IoC);\nlet GET_URI = (iocs | where Type =~ \"URI2\" | project IoC);\n//Include in the list below, the ADFS servers you know about in your environment.  In the next part of the query, we will try to identify them for you if you have the telemetry.\nlet ADFS_Servers1 = externaldata(Computer:string)\n[@\"https://dod365csspstorage.blob.core.usgovcloudapi.net/adfs/ADFS.csv\"]\nwith(format=\"csv\", ignoreFirstRecord=true);\n// Automatically identify potential ADFS services in your environment by searching process event telemetry for \"Microsoft.IdentityServer.ServiceHost.exe\".\nlet ADFS_Servers2 = \n(DeviceProcessEvents\n| where InitiatingProcessFileName == \u0027Microsoft.IdentityServer.ServiceHost.exe\u0027\n| extend Computer = DeviceName\n| distinct Computer\n);\nlet ADFS_Servers =\nADFS_Servers1\n| union  (ADFS_Servers2 | distinct Computer);\n(union isfuzzy=true\n(DeviceNetworkEvents\n| where DeviceName in (ADFS_Servers)\n| where isnotempty(InitiatingProcessSHA256) or isnotempty(InitiatingProcessFolderPath)\n| where  InitiatingProcessSHA256 has_any (sha256Hashes) or InitiatingProcessFolderPath has_any (FilePaths)\n| project TimeGenerated, ActionType, DeviceId, DeviceName, InitiatingProcessAccountDomain, InitiatingProcessAccountName, InitiatingProcessCommandLine, InitiatingProcessFolderPath, InitiatingProcessId,  InitiatingProcessParentFileName, InitiatingProcessFileName, RemoteIP, RemoteUrl, RemotePort, LocalIP, Type\n| extend timestamp = TimeGenerated, IPCustomEntity = RemoteIP, HostCustomEntity = DeviceName\n),\n(DeviceEvents\n| where DeviceName in (ADFS_Servers)\n| extend FilePath = strcat(FolderPath, \u0027\\\\\u0027, FileName)\n| where InitiatingProcessSHA256 has_any (sha256Hashes) or FilePath has_any (FilePaths)\n| project TimeGenerated, ActionType, DeviceId, DeviceName, InitiatingProcessAccountDomain, InitiatingProcessAccountName, InitiatingProcessCommandLine, InitiatingProcessFolderPath, InitiatingProcessId, InitiatingProcessParentFileName, InitiatingProcessFileName, InitiatingProcessSHA256, Type\n| extend Account = InitiatingProcessAccountName, Computer = DeviceName, CommandLine = InitiatingProcessCommandLine, FileHash = InitiatingProcessSHA256, Image = InitiatingProcessFolderPath\n| extend timestamp = TimeGenerated, HostCustomEntity = Computer , AccountCustomEntity = Account, ProcessCustomEntity = InitiatingProcessFileName, AlgorithmCustomEntity = \"SHA256\", FileHashCustomEntity = FileHash\n),\n(DeviceFileEvents\n| where DeviceName in (ADFS_Servers)\n| where FolderPath has_any (FilePaths) or SHA256 has_any (sha256Hashes)\n| project TimeGenerated, ActionType, DeviceId, DeviceName, InitiatingProcessAccountDomain, InitiatingProcessAccountName, InitiatingProcessCommandLine, InitiatingProcessFolderPath, InitiatingProcessId, InitiatingProcessParentFileName, InitiatingProcessFileName, InitiatingProcessSHA256, Type\n| extend Account = InitiatingProcessAccountName, Computer = DeviceName, CommandLine = InitiatingProcessCommandLine, FileHash = InitiatingProcessSHA256, Image = InitiatingProcessFolderPath\n| extend timestamp = TimeGenerated, HostCustomEntity = Computer , AccountCustomEntity = Account, ProcessCustomEntity = InitiatingProcessFileName, AlgorithmCustomEntity = \"SHA256\", FileHashCustomEntity = FileHash\n),\n(DeviceImageLoadEvents\n| where DeviceName in (ADFS_Servers)\n| where FolderPath has_any (FilePaths) or SHA256 has_any (sha256Hashes)\n| project TimeGenerated, ActionType, DeviceId, DeviceName, InitiatingProcessAccountDomain, InitiatingProcessAccountName, InitiatingProcessCommandLine, InitiatingProcessFolderPath, InitiatingProcessId, InitiatingProcessParentFileName, InitiatingProcessFileName, InitiatingProcessSHA256, Type\n| extend Account = InitiatingProcessAccountName, Computer = DeviceName, CommandLine = InitiatingProcessCommandLine, FileHash = InitiatingProcessSHA256, Image = InitiatingProcessFolderPath\n| extend timestamp = TimeGenerated, HostCustomEntity = Computer , AccountCustomEntity = Account, ProcessCustomEntity = InitiatingProcessFileName, AlgorithmCustomEntity = \"SHA256\", FileHashCustomEntity = FileHash\n)\n)",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5M",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  null,
                                                                                   "groupByCustomDetails":  null
                                                                               }
                                                 },
                       "entityMappings":  [
                                              {
                                                  "entityType":  "Account",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "FullName",
                                                                            "columnName":  "AccountCustomEntity"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "FileHash",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "Value",
                                                                            "columnName":  "FileHashCustomEntity"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "Host",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "FullName",
                                                                            "columnName":  "HostCustomEntity"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "IP",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "Address",
                                                                            "columnName":  "IPCustomEntity"
                                                                        }
                                                                    ]
                                              }
                                          ],
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [
                                       "CommandAndControl",
                                       "Collection",
                                       "DefenseEvasion",
                                       "Exfiltration",
                                       "Discovery",
                                       "PrivilegeEscalation",
                                       "Persistence",
                                       "Execution",
                                       "CredentialAccess",
                                       "LateralMovement"
                                   ],
                       "techniques":  [
                                          "T1071",
                                          "T1573",
                                          "T1105",
                                          "T1560",
                                          "T1005",
                                          "T1140",
                                          "T1574",
                                          "T1036",
                                          "T1027",
                                          "T1620",
                                          "T1550",
                                          "T1041",
                                          "T1083",
                                          "T1040",
                                          "T1057",
                                          "T1106",
                                          "T1129",
                                          "T1552"
                                      ],
                       "displayName":  "BAH_NOBELIUM IOCs related to FoggyWeb backdoor",
                       "enabled":  true,
                       "description":  "Identifies a match across various data feeds for IOCs related to FoggyWeb backdoor by the threat actor NOBELIUM. FoggyWeb is a passive and highly targeted backdoor capable of remotely exfiltrating sensitive information from a compromised AD FS server. It can also receive additional malicious components from a command-and-control (C2) server and execute them on the compromised server. Reference: https://aka.ms/nobelium-foggy-web                                                https://attack.mitre.org/software/S0661/         \n                                                                                                                                                                                                                                                                                                                                                                                                                                                          T1071 - Application Layer Protocol:T1071.001, T1560 - Archive Collected Data:T1560.002,T1560.003, T1005-Data from Local System, T1140-Deobfuscate/Decode Files or Information, T1573-Encrypted Channel:T1573.001, T1041-Exfiltration Over C2 Channel, T1083-File and Directory Discovery, T1574-Hijack Execution Flow:T1574.001, T1105-Ingress Tool Transfer, T1036-Masquerading:T1036.005, T1106-Native API, T1040-Network Sniffing, T1027-Obfuscated Files or Information:T1027.004, T1057\t-Process Discovery, T1620-Reflective Code Loading, T1129-Shared Modules, T1552-Unsecured Credentials:T1552.004, T1550-Use Alternate Authentication Material\nPLATFORM:Windows\nMITRE:TA0009;T1005",
                       "alertRuleTemplateName":  null,
                       "lastModifiedUtc":  "2024-10-02T22:24:44.3165945Z"
                   }
}
