{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/54131129-fb94-457b-8559-89fd2e7ecfa4",
    "name":  "54131129-fb94-457b-8559-89fd2e7ecfa4",
    "etag":  "\"8700d6d5-0000-2700-0000-66fdc9d10000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "PT1H",
                       "queryPeriod":  "PT1H",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "Medium",
                       "query":  "//Author: Stephen Rowley\r\n//Description: Looks for Intune enrollment activity that occurs outside of standard U.S. work hours, Monday - Friday, 8AM-5PM, Eastern Time.\r\n//False Positives: None known\r\nlet suspectDay = dynamic ([\u00276.00:00:00\u0027, \u00270.00:00:00\u0027]); //e.x 0.00:00:00 = Sunday 1.00:00:00 = Monday\r\nlet workdayStart = 13;\r\nlet workdayEnd = 25; //24hr time\r\nlet workdayOverflow = iff(workdayEnd \u003e= 24, workdayEnd-24, 0);\r\nlet mainTimeFrame = 24h;\r\nlet identitylookupTimeFrame = 90d;\r\nlet main =\r\nSigninLogs\r\n| where TimeGenerated \u003e=ago(mainTimeFrame)\r\n| where AppDisplayName has \"intune\"\r\n| extend Detail = todynamic(DeviceDetail)\r\n| extend Day = tostring(dayofweek(TimeGenerated))\r\n| extend Hour = hourofday(TimeGenerated)\r\n| where (Day has_any(suspectDay)) or ((workdayOverflow \u003c Hour and Hour \u003c workdayStart) or (Hour \u003e workdayEnd))\r\n| mv-expand ConditionalAccessPolicies\r\n| where ConditionalAccessPolicies[\u0027result\u0027] == \"failure\" or ConditionalAccessPolicies[\u0027result\u0027] == \"success\"\r\n| extend ConditionalAccessPolicy = strcat(toupper(ConditionalAccessPolicies[\u0027result\u0027]), \"----\",  ConditionalAccessPolicies[\u0027displayName\u0027])\r\n| project\r\n    Time = TimeGenerated,\r\n    Day,\r\n    Hour,\r\n    OS = Detail[\u0027operatingSystem\u0027],\r\n    Operation = OperationName,\r\n    UserId = UserPrincipalName,\r\n    ConditionalAccessPolicy,\r\n    Source = SourceSystem,\r\n    LocationDetails,\r\n    ResultSignature, \r\n    ResultDescription\r\n;\r\nlet users = main\r\n| summarize make_set(UserId);\r\nmain\r\n| join kind=leftouter (IdentityInfo\r\n| where TimeGenerated \u003e=ago(identitylookupTimeFrame)\r\n| where AccountUPN in (users)\r\n| summarize max(TimeGenerated), make_set(AccountDisplayName), make_set(Department), make_set(JobTitle) by AccountUPN\r\n| extend AccountDisplayName = set_AccountDisplayName[0], Department = set_Department[0], JobTitle = set_JobTitle[0]\r\n| project-away set_AccountDisplayName, set_Department, set_JobTitle\r\n)\r\non $left.UserId == $right.AccountUPN\r\n| extend Department = iif(UserId contains \"dod365.onmicrosoft\", \"Admin Account\", iif(isempty(Department), \"Not Listed\", Department))\r\n| extend JobTitle = iif(UserId contains \"dod365.onmicrosoft\", \"Admin Account\", iif(isempty(JobTitle), \"Not Listed\", JobTitle))\r\n",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5H",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  [

                                                                                                           ],
                                                                                   "groupByCustomDetails":  [

                                                                                                            ]
                                                                               }
                                                 },
                       "entityMappings":  [
                                              {
                                                  "entityType":  "Account",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "FullName",
                                                                            "columnName":  "AccountUPN"
                                                                        }
                                                                    ]
                                              }
                                          ],
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [
                                       "InitialAccess"
                                   ],
                       "techniques":  [
                                          "T1200",
                                          "T1199"
                                      ],
                       "displayName":  "BAH_Intune_Enrollment_Attempts_Outside_U.S._Work_Hours",
                       "enabled":  false,
                       "description":  "Looks for Intune enrollment activity that occurs outside of standard U.S. work hours, Monday - Friday, 8AM-5PM, Eastern Time.\nPLATFORM:Microsoft 365,Windows,IaaS\nMITRE:T00001;T1199;T1200",
                       "alertRuleTemplateName":  null,
                       "lastModifiedUtc":  "2024-10-02T22:31:45.150252Z"
                   }
}
