{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/cb583863-486c-41c1-a843-5727a425cfdd",
    "name":  "cb583863-486c-41c1-a843-5727a425cfdd",
    "etag":  "\"8700c7ba-0000-2700-0000-66fdc7df0000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "PT30M",
                       "queryPeriod":  "PT30M",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "High",
                       "query":  "// Author: Rob Russell\n// Description:\n// This analytic is meant to detect behaviors related to Redline stealer\n// References\n// https://www.bitdefender.com/files/News/CaseStudies/study/415/Bitdefender-PR-Whitepaper-RedLine-creat6109-en-EN.pdf\n// https://www.bitdefender.com/blog/labs/redline-stealer-resurfaces-in-fresh-rig-exploit-kit-campaign/\n// https://threatresearch.ext.hp.com/redline-stealer-disguised-as-a-windows-11-upgrade/\n// https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1555.003/T1555.003.md\n// Samples\n// https://any.run/malware-trends/redline\n// (VT Enterprise) https://www.virustotal.com/gui/file/b78615662c8c362d920c3f9273352d0da085610774f1fa5a96cda4ec50ca0507/detection\n// Common Behaviors\n// Always spawns a process called AppLaunch.exe in the .Net folder and always creates a log file in AppData\n// Reads computer name \n// Reads supported languages\n// Reads common browser locations looking for stored credentials (Info stealers and virus scanners)\n// Executables spawning Executables (lots of false positives)\n// Rar files spawning executables (Not all malware samples have done this)\n// python creating a connection (Could generate false positives)\n// False Positives: None, the behavior detected by this analytic should only detect Redline stealer activity\nDeviceProcessEvents\n| where FolderPath startswith @\"C:\\Windows\\Microsoft.NET\\Framework64\\\" and FolderPath endswith \"AppLaunch.exe\"\n| project TimeGenerated, Redline_Process_Path = FolderPath, DeviceName, AccountName, AccountDomain\n| join kind=inner (\n    DeviceFileEvents\n    | where FolderPath contains @\"AppData\\Local\\Microsoft\\CLR\" and FolderPath endswith @\".exe.log\"\n    | project Redline_Log_Path = FolderPath, DeviceName\n    ) on DeviceName\n| project TimeGenerated, Redline_Process_Path, Redline_Log_Path, DeviceName, AccountName, AccountDomain",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5M",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  null,
                                                                                   "groupByCustomDetails":  null
                                                                               }
                                                 },
                       "entityMappings":  [
                                              {
                                                  "entityType":  "Account",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "FullName",
                                                                            "columnName":  "AccountName"
                                                                        },
                                                                        {
                                                                            "identifier":  "NTDomain",
                                                                            "columnName":  "AccountDomain"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "Host",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "HostName",
                                                                            "columnName":  "DeviceName"
                                                                        }
                                                                    ]
                                              }
                                          ],
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [
                                       "Execution",
                                       "CredentialAccess",
                                       "Discovery",
                                       "Collection"
                                   ],
                       "techniques":  [
                                          "T1059",
                                          "T1204",
                                          "T1555",
                                          "T1614",
                                          "T1082",
                                          "T1074"
                                      ],
                       "displayName":  "BAH_Redline_Stealer",
                       "enabled":  true,
                       "description":  "Looks for specific behavior related to Redline Stealer malware.                                                                                                                                                                                                                                                                                                                                            \n References\n https://www.bitdefender.com/files/News/CaseStudies/study/415/Bitdefender-PR-Whitepaper-RedLine-creat6109-en-EN.pdf\n https://www.bitdefender.com/blog/labs/redline-stealer-resurfaces-in-fresh-rig-exploit-kit-campaign/\n https://threatresearch.ext.hp.com/redline-stealer-disguised-as-a-windows-11-upgrade/\n https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1555.003/T1555.003.md\n Samples\nhttps://any.run/malware-trends/redline\n(VT Enterprise) https://www.virustotal.com/gui/file/b78615662c8c362d920c3f9273352d0da085610774f1fa5a96cda4ec50ca0507/detection\nPLATFORM:Windows\nMITRE:TA0006;T1555",
                       "alertRuleTemplateName":  null,
                       "lastModifiedUtc":  "2024-10-02T22:23:26.5617495Z"
                   }
}
