{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/f21694d8-f381-47ae-a597-88eb39644b2f",
    "name":  "f21694d8-f381-47ae-a597-88eb39644b2f",
    "etag":  "\"87009fd4-0000-2700-0000-66fdc9b90000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "PT1H",
                       "queryPeriod":  "PT1H",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "Medium",
                       "query":  "//Author: Stephen Rowley\r\n//Description: Looks for Intune enrollments with unapproved platforms during the UEM pilot\r\n//False Positives: None known\r\nlet approved_platforms = dynamic ([\r\n    \"Windows 10\", \"MacOS\", \"OSX\", \"iOS 14\", \"Android\", \"iOS 15\"]);\r\nlet mainTimeFrame = 24h;\r\nlet identitylookupTimeFrame = 90d;\r\nlet main =\r\nSigninLogs\r\n| where TimeGenerated \u003e=ago(mainTimeFrame)\r\n| where AppDisplayName has \"intune\"\r\n| where ConditionalAccessStatus !has \"success\"\r\n| extend Detail = todynamic(DeviceDetail)\r\n| extend detectedOs = parse_json(DeviceDetail).operatingSystem\r\n| where not(detectedOs has_any(approved_platforms))\r\n// | where ConditionalAccessPolicies[\u0027result\u0027] == \"failure\" or ConditionalAccessPolicies[\u0027result\u0027] == \"success\" or ConditionalAccessStatus == \"notApplied\"\r\n| project\r\n    Time = TimeGenerated,\r\n    OS = Detail[\u0027operatingSystem\u0027],\r\n    Operation = OperationName,\r\n    UserId,\r\n    UserPrincipalName,\r\n    ConditionalAccessStatus,\r\n    AppDisplayName,\r\n    CorrelationId,\r\n    ConditionalAccessPolicies\r\n;\r\nlet users = main\r\n| summarize make_set(UserId)\r\n;\r\nmain\r\n| extend test = iif(ConditionalAccessPolicies == \"[]\", ConditionalAccessStatus, parse_json(ConditionalAccessPolicies[0].displayName))\r\n| project-away ConditionalAccessPolicies\r\n| join kind=leftouter (IdentityInfo\r\n| where TimeGenerated \u003e=ago(identitylookupTimeFrame)\r\n| where AccountObjectId in (users)\r\n| summarize max(TimeGenerated), make_set(AccountDisplayName), make_set(AccountUPN), make_set(Department), make_set(JobTitle) by AccountObjectId\r\n| extend AccountDisplayName = set_AccountDisplayName[0], AccountUPN = set_AccountUPN[0], Department = set_Department[0], JobTitle = set_JobTitle[0]\r\n| project-away set_JobTitle, set_Department, set_AccountUPN, set_AccountDisplayName, max_TimeGenerated\r\n| extend JobTitle = iif(AccountUPN contains \"dod365.onmicrosoft\", \"Admin Account\", iif(isempty(JobTitle), \"Not Listed\", JobTitle ))\r\n| extend Department = iif(AccountUPN contains \"dod365.onmicrosoft\", \"Admin Account\", iif(isempty(Department), \"Not Listed\", Department))\r\n) on $left.UserId == $right.AccountObjectId\r\n| project-away UserPrincipalName\r\n",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5H",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  [

                                                                                                           ],
                                                                                   "groupByCustomDetails":  [

                                                                                                            ]
                                                                               }
                                                 },
                       "entityMappings":  [
                                              {
                                                  "entityType":  "Account",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "DisplayName",
                                                                            "columnName":  "AccountDisplayName"
                                                                        },
                                                                        {
                                                                            "identifier":  "FullName",
                                                                            "columnName":  "AccountUPN"
                                                                        }
                                                                    ]
                                              }
                                          ],
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [
                                       "InitialAccess"
                                   ],
                       "techniques":  [
                                          "T1200",
                                          "T1199"
                                      ],
                       "displayName":  "BAH_Intune_Enrollments_with_Unapproved_Platforms",
                       "enabled":  false,
                       "description":  "Looks for Intune enrollments with unapproved platforms during the UEM pilot\nPLATFORM:Microsoft 365,Windows,IaaS\nMITRE:T00001;T1199;T1200",
                       "alertRuleTemplateName":  null,
                       "lastModifiedUtc":  "2024-10-02T22:31:21.1696079Z"
                   }
}
