title: Account Created and Deleted in Short Timeframe
id: cafc9540-1c3d-47ec-ae95-1912d0dcb83d
description: >
    This rule identifies accounts that were created and deleted in a short timeframe (less than 24 hours). Attackers may create an account for their use and then delete it when no longer needed.
    Ref: https://docs.microsoft.com/azure/active-directory/fundamentals/security-operations-user-accounts#short-lived-account
status: stable
author: Azure Security Insights
references:
  - https://docs.microsoft.com/azure/active-directory/fundamentals/security-operations-user-accounts#short-lived-account
tags:
  - attack.initial_access
  - attack.t1078
  - attack.t1078.004
  - attack.impact
  - attack.t1531
  - attack.persistence
  - attack.t1136
  - attack.t1136.003
logsource:
  product: Azure AD
  service: audit
detection:
  creation_event:
    OperationName: Add user
    TargetResource.type: User
  deletion_event:
    OperationName: Delete user
    TargetResource.type: User
  join_condition:
    TimeDelta:
      between:
        - 0s
        - 1d
  condition: creation_event and deletion_event and join_condition
fields:
  - Creation_TimeGenerated
  - Deletion_TimeGenerated
  - TimeDelta
  - TargetUserPrincipalName
  - DeletedByApp
  - DeletedByAppServicePrincipalId
  - DeletedByUserPrincipalName
  - DeletedByAadUserId
  - DeletedByIPAddress
  - CreatedByApp
  - CreatedByAppServicePrincipalId
  - CreatedByUserPrincipalName
  - CreatedByAadUserId
  - CreatedByIPAddress
falsepositives:
  - Legitimate administrative account management processes
level: high
entity_mappings:
  - entity_type: Account
    field_mappings:
      - identifier: FullName
        columnName: TargetUserPrincipalName
      - identifier: Name
        columnName: TargetName
      - identifier: UPNSuffix
        columnName: TargetUPNSuffix
  - entity_type: Account
    field_mappings:
      - identifier: FullName
        columnName: CreatedByUserPrincipalName
      - identifier: Name
        columnName: CreatedByName
      - identifier: UPNSuffix
        columnName: CreatedByUPNSuffix
  - entity_type: Account
    field_mappings:
      - identifier: AadUserId
        columnName: CreatedByAadUserId
  - entity_type: Account
    field_mappings:
      - identifier: FullName
        columnName: DeletedByUserPrincipalName
      - identifier: Name
        columnName: DeletedByName
      - identifier: UPNSuffix
        columnName: DeletedByUPNSuffix
  - entity_type: Account
    field_mappings:
      - identifier: AadUserId
        columnName: DeletedByAadUserId
  - entity_type: IP
    field_mappings:
      - identifier: Address
        columnName: CreatedByIPAddress
  - entity_type: IP
    field_mappings:
      - identifier: Address
        columnName: DeletedByIPAddress
