{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/3b21a63f-154c-4192-83b2-93313034cd38",
    "name":  "3b21a63f-154c-4192-83b2-93313034cd38",
    "etag":  "\"1b0060f5-0000-2700-0000-66d8aa360000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "PT1H",
                       "queryPeriod":  "PT1H",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "Medium",
                       "query":  "let LookBack = 1h;\nlet Data = (\nSigninLogs\n| where TimeGenerated \u003e= ago(LookBack)\n| where parse_json(NetworkLocationDetails)[0].networkType != \"trustedNamedLocation\" // Excludes known tagged networks\n// Counts the number of sign in events in the last hour every 15 minutes by IP\n| make-series EventCounts = count() on TimeGenerated from ago(LookBack) to now() step 15m by IPAddress \n);\nlet AnomalyAlert = (\nData\n| extend (Anomalies, Score, Baseline) = series_decompose_anomalies(EventCounts,1.5,-1,\u0027linefit\u0027)\n| mv-expand EventCounts,TimeGenerated,Anomalies to typeof(double),Baseline to typeof(long),Score to typeof(double)\n| where Anomalies \u003e 0\n);\nAnomalyAlert\n| join kind = inner (SigninLogs\n| where TimeGenerated between (ago(LookBack) .. now())\n| where parse_json(NetworkLocationDetails)[0].networkType != \"trustedNamedLocation\"\n| extend PasswordResult = tostring(parse_json(AuthenticationDetails).authenticationStepResultDetail)\n| summarize UserCount = dcount(UserPrincipalName), UserList = make_set(UserPrincipalName), AppName = make_set(AppDisplayName), PasswordResult = make_list(PasswordResult) by IPAddress) on IPAddress\n| where PasswordResult has \"Correct Password\"\n| where UserCount \u003e 1 // looks for events targeting more than one user.",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5H",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  [

                                                                                                           ],
                                                                                   "groupByCustomDetails":  [

                                                                                                            ]
                                                                               }
                                                 },
                       "customDetails":  {
                                             "Score":  "Score",
                                             "Baseline":  "Baseline",
                                             "UserCount":  "UserCount",
                                             "AppName":  "AppName",
                                             "PasswordResult":  "PasswordResult",
                                             "UserList":  "UserList"
                                         },
                       "entityMappings":  [
                                              {
                                                  "entityType":  "IP",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "Address",
                                                                            "columnName":  "IPAddress"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "Account",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "FullName",
                                                                            "columnName":  "Anomalies"
                                                                        }
                                                                    ]
                                              }
                                          ],
                       "templateVersion":  "1.0.0",
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [
                                       "InitialAccess",
                                       "CredentialAccess"
                                   ],
                       "techniques":  [
                                          "T1110"
                                      ],
                       "displayName":  "Anomaly Sign In Event from an IP",
                       "enabled":  true,
                       "description":  "Identifies sign-in anomalies from an IP in the last hour, targeting multiple users where the password is correct after multiple attempts\n\nPLATFORM:Azure AD,Microsoft 365,IaaS,Windows;MITRE:TA0006;T1110;T1110.001;T1110.002;T1110.003;T1110.004",
                       "alertRuleTemplateName":  "9c1e9381-79dd-4ddf-9570-b73a1dc59fe0",
                       "lastModifiedUtc":  "2024-09-04T18:43:01.6404412Z"
                   }
}
