{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/143207bc-2223-4e18-80ed-17f18082d6d3",
    "name":  "143207bc-2223-4e18-80ed-17f18082d6d3",
    "etag":  "\"8800242e-0000-2700-0000-66fdcfc80000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "PT1H",
                       "queryPeriod":  "PT1H",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "Low",
                       "query":  "// Set Main Analytic Timeframe\nlet timeRange = ago(8h);\n// Set Timeframe to lookup past entries for comparisons\nlet pastlookuptimerange= ago(7d);\n// Create a data table to compare state abreviations to obtain full state name for comparison on location of user and location of IP used\nlet states = (datatable(ST_ABBR: string, ST_NAME: string) [\n\"AL\", \"Alabama\",\n\"KY\", \"Kentucky\",\n\"OH\", \"Ohio\",\n\"AK\", \"Alaska\",\n\"LA\", \"Louisiana\",\n\"OK\", \"Oklahoma\",\n\"AZ\", \"Arizona\",\n\"ME\", \"Maine\",\n\"OR\", \"Oregon\",\n\"AR\", \"Arkansas\",\n\"MD\", \"Maryland\",\n\"PA\", \"Pennsylvania\",\n\"AS\", \"American Samoa\",\n\"MA\", \"Massachusetts\",\n\"PR\", \"Puerto Rico\",\n\"CA\", \"California\",\n\"MI\", \"Michigan\",\n\"RI\", \"Rhode Island\",\n\"CO\", \"Colorado\",\n\"MN\", \"Minnesota\",\n\"SC\", \"South Carolina\",\n\"CT\", \"Connecticut\",\n\"MS\", \"Mississippi\",\n\"SD\", \"South Dakota\",\n\"DE\", \"Delaware\",\n\"MO\", \"Missouri\",\n\"TN\", \"Tennessee\",\n\"DC\", \"District of Columbia\",\n\"MT\", \"Montana\",\n\"TX\", \"Texas\",\n\"FL\", \"Florida\",\n\"NE\", \"Nebraska\",\n\"TT\", \"Trust Territories\",\n\"GA\", \"Georgia\",\n\"NV\", \"Nevada\",\n\"UT\", \"Utah\",\n\"GU\", \"Guam\",\n\"NH\", \"New Hampshire\",\n\"VT\", \"Vermont\",\n\"HI\", \"Hawaii\",\n\"NJ\", \"New Jersey\",\n\"VA\", \"Virginia\",\n\"ID\", \"Idaho\",\n\"NM\", \"New Mexico\",\n\"VI\", \"Virgin Islands\",\n\"IL\", \"Illinois\",\n\"NY\", \"New York\",\n\"WA\", \"Washington\",\n\"IN\", \"Indiana\",\n\"NC\", \"North Carolina\",\n\"WV\", \"West Virginia\",\n\"IA\", \"Iowa\",\n\"ND\", \"North Dakota\",\n\"WI\", \"Wisconsin\",\n\"KS\", \"Kansas\",\n\"CM\", \"Northern Mariana Islands\",\n\"WY\", \"Wyoming\",\n\"N/A\", \"N/A\"\n]);\n// Find all failed conditional access policy entries with count greater than 20 per user\nlet failedLogons=SigninLogs\n| where TimeGenerated \u003e= (timeRange)\n| where ConditionalAccessStatus == 1 or ConditionalAccessStatus =~ \"failure\"\n| summarize count() by UserPrincipalName, IPAddress\n| where count_ \u003e= 50;\n// Create variable of the users above\nlet userstolookup = failedLogons\n| summarize make_set(UserPrincipalName);\n// Look up past successful logons by those users to verify whether they have successfully logged on via these IP addresses\nlet pastlookup=SigninLogs\n| where TimeGenerated \u003e= (pastlookuptimerange)\n| where UserPrincipalName in (userstolookup)\n| where IPAddress !startswith \"140.\"\n| where ResultType == 0\n| summarize by UserPrincipalName, IPAddress;\n// Compare the failed and successful logons by IPAddress and User. Remove entry where user has successfully signed in from the same IP in the past.\nlet finalUsers=failedLogons\n| join kind=leftouter (pastlookup)\non UserPrincipalName, IPAddress\n| where isempty(UserPrincipalName1)\n| project-away UserPrincipalName1, IPAddress1;\n// Create variable of remaining users\nlet finaluserstolookup = finalUsers\n| summarize make_set(UserPrincipalName);\n// Create variable of remaining IP Addresses\nlet finalIPstolookup = finalUsers\n| summarize make_set(IPAddress);\n// Lookup failed conditional access policy signins from the remaining Users and IP Addresses\nlet main=SigninLogs\n| where TimeGenerated \u003e= (timeRange)\n| where UserPrincipalName in (finaluserstolookup) and IPAddress in (finalIPstolookup)\n| where ConditionalAccessStatus == 1 or ConditionalAccessStatus =~ \"failure\"\n| mv-apply Policy = todynamic(ConditionalAccessPolicies) on (where Policy.result has \"failure\"\n| extend Policy = Policy.displayName)\n| extend Location = strcat(LocationDetails.city, \" \", LocationDetails.state, \" \", LocationDetails.countryOrRegion)\n| summarize\nStartTime=min(TimeGenerated),\nEndTime=max(TimeGenerated),\nCount=count(),\nStatus = make_set(Status),\nPolicy = make_set(Policy)\nby\nUserPrincipalName,\nResultDescription,\nConditionalAccessStatus,\nIPAddress,\nLocation,\nAppDisplayName\n| sort by UserPrincipalName asc\n// Get Active Directory user information on the above users\n| join kind=leftouter (userlookup\n| where user in (finaluserstolookup))\non $left.UserPrincipalName == $right.[\u0027user\u0027];\n// Look up any other users not included in the list above who have signin activity from the same IP Addresses above\nlet ipactivity=SigninLogs\n| where TimeGenerated \u003e= (pastlookuptimerange)\n| where IPAddress in (finalIPstolookup)\n| where UserPrincipalName !in (finaluserstolookup)\n| summarize IPActivityLastSevenDays=make_set(UserPrincipalName) by IPAddress;\n// Run final code and join other users who have used the same IP address\nmain\n| join kind=leftouter (ipactivity)\non $left.IPAddress == $right.IPAddress\n| extend IPActivityLastSevenDays = iif(array_length(IPActivityLastSevenDays) \u003e 0, IPActivityLastSevenDays, \"This IP address shows no activity by other users\")\n| project-away IPAddress1\n// Join states data table to do a comparison on user location VS. IP location\n| join kind=leftouter (states)\non $left.State == $right.ST_ABBR\n| extend UserState_Matches_IPState = iif(Location contains ST_NAME, \"Yes\", \"No\")\n| project-away ST_ABBR, ST_NAME\n| project-reorder\nStartTime,\nEndTime,\nCount,\nUserPrincipalName,\nLocation,\nUserState_Matches_IPState,\nIPAddress,\nIPActivityLastSevenDays,\nAppDisplayName,\nConditionalAccessStatus,\nResultDescription,\n*\n// | where AppDisplayName !has \"Teams\"\n| where IPActivityLastSevenDays == \"This IP address shows no activity by other users\"\n// Microsoft will sometimes report the wrong location for an IP address. If you show a Yes and No for the same IPAddress and User, double check location online.\n// This query is summarized by the AppDisplayName. You may see multiple entries for a single user. This is to show a timeline of failed logons using several Apps.",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5M",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  [

                                                                                                           ],
                                                                                   "groupByCustomDetails":  [

                                                                                                            ]
                                                                               }
                                                 },
                       "entityMappings":  [
                                              {
                                                  "entityType":  "Account",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "FullName",
                                                                            "columnName":  "UserPrincipalName"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "IP",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "Address",
                                                                            "columnName":  "IPAddress"
                                                                        }
                                                                    ]
                                              }
                                          ],
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [
                                       "InitialAccess",
                                       "Persistence"
                                   ],
                       "techniques":  [
                                          "T1078",
                                          "T1098"
                                      ],
                       "displayName":  "Attempt to bypass conditional access rule in Azure AD",
                       "enabled":  true,
                       "description":  "UPDATE: Changing count from 20 to 50 for detection. Original count generates a lot of benign positives due to 20 failures being relatively normal for most users and to avoid analysts having to search through hundreds of events for suspicious users. 50 count will generate activity that is more likely to have suspicious behavior while lowering the amount of benign/false positives.\nIdentifies an attempt to Bypass conditional access rule(s) in Azure Active Directory.\nThe ConditionalAccessStatus column value details if there was an attempt to bypass Conditional Access\nor if the Conditional access rule was not satisfied (ConditionalAccessStatus == 1).\nReferences: \nhttps://docs.microsoft.com/azure/active-directory/conditional-access/overview\nhttps://docs.microsoft.com/azure/active-directory/reports-monitoring/concept-sign-ins\nhttps://docs.microsoft.com/azure/active-directory/reports-monitoring/reference-sign-ins-error-codes\nConditionalAccessStatus == 0 // Success\nConditionalAccessStatus == 1 // Failure\nConditionalAccessStatus == 2 // Not Applied\nConditionalAccessStatus == 3 // unknown\n\nPLATFORM:Azure AD,Microsoft 365,IaaS,Windows\nMITRE:TA0001;T1078;T1078.001;T1078.004",
                       "alertRuleTemplateName":  "3af9285d-bb98-4a35-ad29-5ea39ba0c628",
                       "lastModifiedUtc":  "2024-10-02T22:57:11.797758Z"
                   }
}
