{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/97619f3a-f88b-41d9-aaa3-ba27183d19d3",
    "name":  "97619f3a-f88b-41d9-aaa3-ba27183d19d3",
    "etag":  "\"5300d413-0000-2700-0000-64a2cfb50000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "P1D",
                       "queryPeriod":  "P1D",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "Medium",
                       "query":  "let guids = dynamic([\"{ddc05a5a-351a-4e06-8eaf-54ec1bc2dcea}\",\"{1f486a52-3cb1-48fd-8f50-b8dc300d9f9d}\",\"{4590f811-1d3a-11d0-891f-00aa004b2e24}\", \"{4de225bf-cf59-4cfc-85f7-68b90f185355}\", \"{F56F6FDD-AA9D-4618-A949-C1B91AF43B1A}\"]);\n  DeviceRegistryEvents\n  | where ActionType =~ \"RegistryValueSet\"\n  | where RegistryKey contains \"HKEY_LOCAL_MACHINE\\\\SOFTWARE\\\\Classes\\\\CLSID\"\n  | where RegistryKey has_any (guids)\n  | where RegistryValueData has \"System32\\\\spool\\\\drivers\\\\color\"\n ",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5H",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  [

                                                                                                           ],
                                                                                   "groupByCustomDetails":  [

                                                                                                            ]
                                                                               }
                                                 },
                       "entityMappings":  [
                                              {
                                                  "entityType":  "RegistryKey",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "Key",
                                                                            "columnName":  "RegistryKey"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "Host",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "HostName",
                                                                            "columnName":  "DeviceName"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "Process",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "ProcessId",
                                                                            "columnName":  "InitiatingProcessFileName"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "Account",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "FullName",
                                                                            "columnName":  "InitiatingProcessAccountName"
                                                                        }
                                                                    ]
                                              }
                                          ],
                       "templateVersion":  "1.0.1",
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [
                                       "Persistence"
                                   ],
                       "techniques":  [
                                          "T1574"
                                      ],
                       "displayName":  "COM Registry Key Modified to Point to File in Color Profile Folder",
                       "enabled":  true,
                       "description":  "This query looks for changes to COM registry keys to point to files in C:\\Windows\\System32\\spool\\drivers\\color\\.\n  This can be used to enable COM hijacking for persistence.\n  Ref: https://www.microsoft.com/security/blog/2022/07/27/untangling-knotweed-european-private-sector-offensive-actor-using-0-day-exploits/",
                       "alertRuleTemplateName":  "ed8c9153-6f7a-4602-97b4-48c336b299e1",
                       "lastModifiedUtc":  "2023-07-03T13:40:03.9571844Z"
                   }
}
