{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/10a11691-17c9-4658-b267-c695eb04ae08",
    "name":  "10a11691-17c9-4658-b267-c695eb04ae08",
    "etag":  "\"87009e5c-0000-2700-0000-66fdc1e10000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "P1D",
                       "queryPeriod":  "P1D",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "Medium",
                       "query":  "// This query looks for users that have been disabled in the past 90 days. It then looks at login attempts on those accounts\r\n// greater than seven days after being disabled. It then filters out DoD IPs to show only private IP addresses attempting to login to disabled accounts.\r\nlet mainTimeFrame = 1d;\r\nlet disabledTimeFrame = 90d;\r\nlet main=SigninLogs\r\n    | where TimeGenerated \u003e= ago(mainTimeFrame)\r\n    // Looks at user accounts that start with disable\r\n    | where UserPrincipalName startswith \"disable\"\r\n    // rename to disabledName\r\n    | project-rename disabledName = UserPrincipalName\r\n    // splits the disable out of the name to look up the non disable account to see if it has since been enabled\r\n    | extend enabledName = tostring(split(disabledName, \"disable.\")[1])\r\n    // creates count for next count filter\r\n    | summarize min(TimeGenerated), max(TimeGenerated), count() by disabledName, enabledName, IPAddress\r\n    // join IdentityInfo to lookup if the user has been enabled\r\n    | join kind=leftouter (IdentityInfo\r\n        | where TimeGenerated \u003e= ago(mainTimeFrame)\r\n        | summarize max(TimeGenerated), IsAccountEnabled =make_set(IsAccountEnabled, 1) by AccountUPN)\r\n        on $left.enabledName == $right.AccountUPN\r\n    | extend IsAccountEnabled = IsAccountEnabled[0]\r\n    // tag false if not true\r\n    | extend IsAccountEnabled = iif(isempty(IsAccountEnabled), \"false\", IsAccountEnabled)\r\n    // remove entries where the user has been enabled\r\n    | where IsAccountEnabled != \"true\"\r\n;\r\n// Create list of disabledNamess\r\nlet userlist = main\r\n    | summarize userlist=make_set(disabledName, 100);\r\n// Gets the date of when the account was disabled\r\nlet getDisabledDate=\r\n    AuditLogs\r\n    | where TimeGenerated \u003e= ago(disabledTimeFrame)\r\n    | where OperationName == \"Disable account\"\r\n    | extend user = TargetResources[0][\u0027userPrincipalName\u0027]\r\n    | where [\u0027user\u0027] in (userlist)\r\n    | summarize DisabledDate =max(TimeGenerated) by tostring([\u0027user\u0027]);\r\n// joins the main analytic with the disabled date\r\nmain\r\n| join kind=innerunique (getDisabledDate) on $left.disabledName == $right.user\r\n// finds where the disabled account has attempted login more than seven days after being disabled\r\n| where datetime_diff( \"day\", max_TimeGenerated, DisabledDate) \u003e 7\r\n// Removes DoD IP addresses as they would need to be onsite since their VPN would not work with a disabled account\r\n| where IPAddress !startswith \"140.\"\r\n| project\r\n    enabledName,\r\n    IsAccountEnabled,\r\n    disabledName,\r\n    IPAddress,\r\n    DisabledDate,\r\n    Count = count_,\r\n    FirstAttemptAtDisabledLogin = min_TimeGenerated,\r\n    LatestAttemptAtDisabledLogin = max_TimeGenerated\r\n| sort by DisabledDate asc",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5H",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  [

                                                                                                           ],
                                                                                   "groupByCustomDetails":  [

                                                                                                            ]
                                                                               }
                                                 },
                       "entityMappings":  [
                                              {
                                                  "entityType":  "IP",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "Address",
                                                                            "columnName":  "IPAddress"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "Account",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "Name",
                                                                            "columnName":  "disabledName"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "Account",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "FullName",
                                                                            "columnName":  "enabledName"
                                                                        }
                                                                    ]
                                              }
                                          ],
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [
                                       "InitialAccess"
                                   ],
                       "techniques":  [
                                          "T1078"
                                      ],
                       "displayName":  "DisabledAccountLoginAttemptFromNon-DoDIP",
                       "enabled":  true,
                       "description":  "This analytic looks at the passed 24 hours to find disabled account logon attempts. It then looks up the disabled account to see when it was disabled. If the account was disabled greater than 7 days ago, it will check to see if the IP Address is a DoD IP address. If it is not, it will generate an event. \nPLATFORM:Azure AD,Microsoft 365,IaaS,Windows\nMITRE:TA0001;T1078;T1078.001;T1078.002;T1078.003;T1078.004,TA0007;T1087;T1087.004",
                       "alertRuleTemplateName":  null,
                       "lastModifiedUtc":  "2024-10-02T21:57:50.9079186Z"
                   }
}
