{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/60b2a431-35af-4a5d-a601-ce2da80a3142",
    "name":  "60b2a431-35af-4a5d-a601-ce2da80a3142",
    "etag":  "\"160059d1-0000-2700-0000-63c80d100000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "P1D",
                       "queryPeriod":  "P1D",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "Low",
                       "query":  "AuditLogs\n| where ActivityDisplayName contains \"Download users\"\n| extend timestamp = ActivityDateTime\n| extend userPrincipalName = tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)\n| where userPrincipalName !contains \"dod365.\"\n\n",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5H",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  [

                                                                                                           ],
                                                                                   "groupByCustomDetails":  [

                                                                                                            ]
                                                                               }
                                                 },
                       "entityMappings":  [
                                              {
                                                  "entityType":  "Account",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "Name",
                                                                            "columnName":  "userPrincipalName"
                                                                        }
                                                                    ]
                                              }
                                          ],
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [
                                       "Collection",
                                       "Exfiltration"
                                   ],
                       "techniques":  [

                                      ],
                       "displayName":  "DoD365-J - User List Downloaded from AzureAD",
                       "enabled":  false,
                       "description":  "Azure AD User List Exported from Azure. ",
                       "alertRuleTemplateName":  null,
                       "lastModifiedUtc":  "2023-01-18T15:15:28.6925804Z"
                   }
}
