{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/fa72d599-a62e-4a40-b000-d8fdb127933b",
    "name":  "fa72d599-a62e-4a40-b000-d8fdb127933b",
    "etag":  "\"17002a4c-0000-2700-0000-63c819420000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "PT5H",
                       "queryPeriod":  "PT5H",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "Medium",
                       "query":  "SecurityEvent\n| where EventSourceName matches regex \"AD FS Auditing\" and EventID == 4649\n\n",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5H",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  [

                                                                                                           ],
                                                                                   "groupByCustomDetails":  [

                                                                                                            ]
                                                                               }
                                                 },
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [
                                       "CredentialAccess"
                                   ],
                       "techniques":  [

                                      ],
                       "displayName":  "DoD365-J - ADFS replay attack was detected.",
                       "enabled":  false,
                       "description":  "A replay attack was detected. May be a harmless false positive due to misconfiguration error. Monitoring for this eventID is recommended by Microsoft https://docs.microsoft.com/en-us/windows-server/identity/ad-ds/plan/appendix-l--events-to-monitor ",
                       "alertRuleTemplateName":  null,
                       "lastModifiedUtc":  "2023-01-18T16:07:30.1618736Z"
                   }
}
