{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/624a7047-acfa-4263-9fef-3929bdf3cfe1",
    "name":  "624a7047-acfa-4263-9fef-3929bdf3cfe1",
    "etag":  "\"1700cc8b-0000-2700-0000-63c81fde0000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "PT5H",
                       "queryPeriod":  "PT5H",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "Medium",
                       "query":  "AuditLogs\r\n| where ActivityDisplayName contains \"Add member to group\"\r\n| where TargetResources contains \"ADMINS\"\r\n| where parse_json(tostring(InitiatedBy.app)).userPrincipalName !contains \"admin\"\r\n| where parse_json(tostring(InitiatedBy.app)).displayName != \"Microsoft Approval Management\"\r\n",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5H",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  [

                                                                                                           ],
                                                                                   "groupByCustomDetails":  [

                                                                                                            ]
                                                                               }
                                                 },
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [
                                       "PrivilegeEscalation"
                                   ],
                       "techniques":  [

                                      ],
                       "displayName":  "DoD365-J - User Added to Privileged ADMIN Group",
                       "enabled":  false,
                       "description":  "Detects users being added to the Navy ADMIN group outside of the dynamic role assignment",
                       "alertRuleTemplateName":  null,
                       "lastModifiedUtc":  "2023-01-18T16:35:42.453601Z"
                   }
}
