{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/c8ad3682-4072-4f9c-ac7e-68734ed4400d",
    "name":  "c8ad3682-4072-4f9c-ac7e-68734ed4400d",
    "etag":  "\"1600c0d4-0000-2700-0000-63c80d680000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "PT1H",
                       "queryPeriod":  "PT1H",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  3,
                       "severity":  "Medium",
                       "query":  "SigninLogs\n| where ResultType == \"500121\"\n| where Status.additionalDetails == \"MFA denied; invalid verification code\"\n| extend additionalDetails_ = tostring(Status.additionalDetails)\n\n",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  false,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5H",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  [

                                                                                                           ],
                                                                                   "groupByCustomDetails":  [

                                                                                                            ]
                                                                               }
                                                 },
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [
                                       "InitialAccess",
                                       "CredentialAccess"
                                   ],
                       "techniques":  [

                                      ],
                       "displayName":  "DoD365-J - Potential Azure MFA Brute Force",
                       "enabled":  false,
                       "description":  "This alert was disabled on 30-SEP-2021 by Shea Fitzpatrick.\nReasons for disabling:\n- Query logic is agnostic of brute force target and fires an alert if there are more than three failed MFA pin attempts in an hour. So if there are four or more records of an incorrect MFA pin from four unique users this alert will falsely report a brute force attempt\n- There is a rule that already captures various types brute force attempts including MFA pin attempts.\n            - Brute force attack against Azure Portal (252e3d24-ca72-41d5-b86d-8b0933f187a3)\n\n.",
                       "alertRuleTemplateName":  null,
                       "lastModifiedUtc":  "2023-01-18T15:16:56.7520945Z"
                   }
}
