{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/e47c9712-6bc4-409e-9df5-bbe435eacaff",
    "name":  "e47c9712-6bc4-409e-9df5-bbe435eacaff",
    "etag":  "\"160054ec-0000-2700-0000-63c8101c0000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "PT5M",
                       "queryPeriod":  "PT5M",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "High",
                       "query":  "AuditLogs\n| where ActivityDisplayName has \"Update policy\"\n| where TargetResources[0].displayName != \u0027Default Policy\u0027\n| project TimeGenerated, ActivityDisplayName, InitiatedBy.user.userPrincipalName, TargetResources[0].displayName\n",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5H",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  [

                                                                                                           ],
                                                                                   "groupByCustomDetails":  [

                                                                                                            ]
                                                                               }
                                                 },
                       "entityMappings":  [
                                              {
                                                  "entityType":  "Account",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "FullName",
                                                                            "columnName":  "InitiatedBy_user_userPrincipalName"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "Account",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "FullName",
                                                                            "columnName":  "TargetResources_0_displayName"
                                                                        }
                                                                    ]
                                              }
                                          ],
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [
                                       "DefenseEvasion"
                                   ],
                       "techniques":  [
                                          "T1484"
                                      ],
                       "displayName":  "DoD365-J - Azure AD Conditional Access Policy Modified",
                       "enabled":  false,
                       "description":  "",
                       "alertRuleTemplateName":  null,
                       "lastModifiedUtc":  "2023-01-18T15:28:28.8457592Z"
                   }
}
