{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/e334bb22-f0b0-4355-b60f-4aaeeaf3f5f7",
    "name":  "e334bb22-f0b0-4355-b60f-4aaeeaf3f5f7",
    "etag":  "\"87007920-0000-2700-0000-66fdbdd60000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "PT5H",
                       "queryPeriod":  "PT5H",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "Medium",
                       "query":  "let riskScoreCutoff = 20; //Adjust this based on volume of results\r\n  let starttime = 14d;\r\n  let timeframe = 1d;\r\n  let scorethreshold = 3;\r\n  let baselinethreshold = 50;\r\n  let aadFunc = (tableName:string){\r\n    // Failed Signins attempts with reasoning related to conditional access policies.\r\n    table(tableName)\r\n    | where TimeGenerated between (startofday(ago(starttime))..startofday(now()))\r\n    | where ResultDescription has_any (\"conditional access\", \"CA\") or ResultType in (50005, 50131, 53000, 53001, 53002, 52003, 70044)\r\n    | extend UserPrincipalName = tolower(UserPrincipalName)\r\n    | extend timestamp = TimeGenerated, AccountCustomEntity = UserPrincipalName\r\n  };\r\n  let aadSignin = aadFunc(\"SigninLogs\");\r\n  let aadNonInt = aadFunc(\"AADNonInteractiveUserSignInLogs\");\r\n  let allSignins = union isfuzzy=true aadSignin, aadNonInt;\r\n  let TimeSeriesAlerts = \r\n  allSignins\r\n  | make-series DailyCount=count() on TimeGenerated from startofday(ago(starttime)) to startofday(now()) step 1d by UserPrincipalName\r\n  | extend (anomalies, score, baseline) = series_decompose_anomalies(DailyCount, scorethreshold, -1, \u0027linefit\u0027)\r\n  | mv-expand DailyCount to typeof(double), TimeGenerated to typeof(datetime), anomalies to typeof(double), score to typeof(double), baseline to typeof(long)\r\n  // Filtering low count events per baselinethreshold\r\n  | where anomalies \u003e 0 and baseline \u003e baselinethreshold\r\n  | extend AnomalyHour = TimeGenerated\r\n  | project UserPrincipalName, AnomalyHour, TimeGenerated, DailyCount, baseline, anomalies, score;\r\n  // Filter the alerts for specified timeframe\r\n  TimeSeriesAlerts\r\n  | where TimeGenerated \u003e startofday(ago(timeframe))\r\n  | join kind=inner ( \r\n    allSignins\r\n    | where TimeGenerated \u003e startofday(ago(timeframe))\r\n    // create a new column and round to hour\r\n    | extend DateHour = bin(TimeGenerated, 1h)\r\n    | summarize PartialFailedSignins = count(), LatestAnomalyTime = arg_max(TimeGenerated, *) by bin(TimeGenerated, 1h), OperationName, Category, ResultType, ResultDescription, UserPrincipalName, UserDisplayName, AppDisplayName, ClientAppUsed, IPAddress, ResourceDisplayName\r\n  ) on UserPrincipalName, $left.AnomalyHour == $right.DateHour\r\n  | project LatestAnomalyTime, OperationName, Category, UserPrincipalName, UserDisplayName, ResultType, ResultDescription, AppDisplayName, ClientAppUsed, UserAgent, IPAddress, Location, AuthenticationRequirement, ConditionalAccessStatus, ResourceDisplayName, PartialFailedSignins, TotalFailedSignins = DailyCount, baseline, anomalies, score\r\n  | extend timestamp = LatestAnomalyTime, Name = tostring(split(UserPrincipalName,\u0027@\u0027,0)[0]), UPNSuffix = tostring(split(UserPrincipalName,\u0027@\u0027,1)[0])\r\n  | extend UserPrincipalName = tolower(UserPrincipalName)\r\n  | join kind=leftouter (\r\n      IdentityInfo\r\n      | summarize LatestReportTime = arg_max(TimeGenerated, *) by AccountUPN\r\n      | extend BlastRadiusInt = iif(BlastRadius == \"High\", 1, 0)\r\n      | project AccountUPN, Tags, JobTitle, GroupMembership, AssignedRoles, UserType, IsAccountEnabled, BlastRadiusInt\r\n      | summarize\r\n          Tags = make_set(Tags, 1000),\r\n          GroupMembership = make_set(GroupMembership, 1000),\r\n          AssignedRoles = make_set(AssignedRoles, 1000),\r\n          BlastRadiusInt = sum(BlastRadiusInt),\r\n          UserType = make_set(UserType, 1000),\r\n          UserAccountControl = make_set(UserType, 1000)\r\n      by AccountUPN\r\n      | extend UserPrincipalName=tolower(AccountUPN)\r\n  ) on UserPrincipalName\r\n  | join kind=leftouter (\r\n      BehaviorAnalytics\r\n      | where ActivityType in (\"FailedLogOn\", \"LogOn\")\r\n      | where isnotempty(SourceIPAddress)\r\n      | project UsersInsights, DevicesInsights, ActivityInsights, InvestigationPriority, SourceIPAddress\r\n      | project-rename IPAddress = SourceIPAddress\r\n      | summarize\r\n          UsersInsights = make_set(UsersInsights, 1000),\r\n          DevicesInsights = make_set(DevicesInsights, 1000),\r\n          IPInvestigationPriority = sum(InvestigationPriority)\r\n      by IPAddress)\r\n  on IPAddress\r\n  | extend UEBARiskScore = BlastRadiusInt + IPInvestigationPriority\r\n  | where UEBARiskScore \u003e riskScoreCutoff\r\n  | sort by UEBARiskScore desc ",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5H",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  [

                                                                                                           ],
                                                                                   "groupByCustomDetails":  [

                                                                                                            ]
                                                                               }
                                                 },
                       "entityMappings":  [
                                              {
                                                  "entityType":  "Account",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "Name",
                                                                            "columnName":  "Name"
                                                                        },
                                                                        {
                                                                            "identifier":  "UPNSuffix",
                                                                            "columnName":  "UPNSuffix"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "IP",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "Address",
                                                                            "columnName":  "IPAddress"
                                                                        }
                                                                    ]
                                              }
                                          ],
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [
                                       "InitialAccess"
                                   ],
                       "techniques":  [
                                          "T1078"
                                      ],
                       "displayName":  "Midnight Blizzard - User Accounts - Sign in Failure due to CA Spikes",
                       "enabled":  true,
                       "description":  "Identifies spike in failed sign-ins from user accounts due to conditional access policy. Spike is determined based on Time series anomaly which will look at historical baseline values. \n\nRef : https://docs.microsoft.com/azure/active-directory/fundamentals/security-operations-user-accounts#monitoring-for-failed-unusual-sign-ins\n\nThis query has also been updated to include UEBA logs IdentityInfo and BehaviorAnalytics for contextual information around the results.\n\nhttps://github.com/Azure/Azure-Sentinel/blob/master/Solutions/Azure%20Active%20Directory/Analytic%20Rules/UserAccounts-CABlockedSigninSpikes.yaml\nPLATFORM:Azure AD,Microsoft 365,IaaS,Windows\nMITRE:TA0005;T1548;T1548.005,TA0006;T1110;T1110.001,TA0007;T1087;T1087.004",
                       "alertRuleTemplateName":  null,
                       "lastModifiedUtc":  "2024-10-02T21:40:33.9805317Z"
                   }
}
