{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/ddaae710-31d5-4ea7-a317-7d774fd3090d",
    "name":  "ddaae710-31d5-4ea7-a317-7d774fd3090d",
    "etag":  "\"87009e07-0000-2700-0000-66fdbc5a0000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "NRT",
    "properties":  {
                       "severity":  "Medium",
                       "query":  "SigninLogs\n| where ResultType == 500121\n| extend additionalDetails_ = tostring(Status.additionalDetails)\n| where additionalDetails_ =~ \"MFA denied; user declined the authentication\"\n| summarize StartTime = min(TimeGenerated), EndTIme = max(TimeGenerated) by UserPrincipalName, UserId, AADTenantId, IPAddress\n| extend Name = tostring(split(UserPrincipalName,\u0027@\u0027,0)[0]), UPNSuffix = tostring(split(UserPrincipalName,\u0027@\u0027,1)[0])",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5H",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  [

                                                                                                           ],
                                                                                   "groupByCustomDetails":  [

                                                                                                            ]
                                                                               }
                                                 },
                       "entityMappings":  [
                                              {
                                                  "entityType":  "Account",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "Name",
                                                                            "columnName":  "Name"
                                                                        },
                                                                        {
                                                                            "identifier":  "UPNSuffix",
                                                                            "columnName":  "UPNSuffix"
                                                                        },
                                                                        {
                                                                            "identifier":  "AadUserId",
                                                                            "columnName":  "UserId"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "IP",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "Address",
                                                                            "columnName":  "IPAddress"
                                                                        }
                                                                    ]
                                              }
                                          ],
                       "templateVersion":  "1.0.3",
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [
                                       "InitialAccess"
                                   ],
                       "techniques":  [
                                          "T1078"
                                      ],
                       "displayName":  "NRT MFA Rejected by User",
                       "enabled":  true,
                       "description":  "Identifies occurrences where a user has rejected an MFA prompt. This could be an indicator that a threat actor has compromised the username and password of this user account and is using it to try and log into the account.\nRef : https://docs.microsoft.com/azure/active-directory/fundamentals/security-operations-user-accounts#monitoring-for-failed-unusual-sign-ins\nPLATFORM:Azure AD,Microsoft 365,IaaS,Windows\nMITRE:TA0003;T1136;T1136.003,TA0006;T1110;T1110.001,TA0007;T1087;T1087.004",
                       "alertRuleTemplateName":  "3617d76d-b15e-4c6f-985e-a1dac73c592d",
                       "lastModifiedUtc":  "2024-10-02T21:34:17.7947037Z"
                   }
}
