{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/5ca81048-439a-499e-a880-983c8dd487a1",
    "name":  "5ca81048-439a-499e-a880-983c8dd487a1",
    "etag":  "\"0a144244-0000-2700-0000-6758a6540000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "PT8H",
                       "queryPeriod":  "PT8H",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "Low",
                       "query":  "// The query_now parameter represents the time (in UTC) at which the scheduled analytics rule ran to produce this alert.\r\nlet timeframe = 8h;\r\nlet exclusions = dynamic([\"SpoolsProvisioning-ApplicationAccount@NAMP111.PROD.OUTLOOK.COM,52.182.49.149\", \"SpoolsProvisioning-ApplicationAccount@NAMP111.PROD.OUTLOOK.COM,52.182.49.195\"]);\r\n// This filters records that have \"UserSMimeCertificate\", \"UserCertificate\", and \"ForwardingSmtpAddress\" fields in the Parameters. These do not appear to have a security importance as the fields are blank. The first two *may* be related to migrations. Forwarding is disabled to external domains.\r\nlet ParamsExcluded = dynamic([\"UserSMimeCertificate\", \"UserCertificate\", \"ForwardingSmtpAddress\"]);\r\nlet main =OfficeActivity\r\n    | where TimeGenerated \u003e= ago(timeframe)\r\n    | where Operation in~ (\"Add-MailboxPermission\", \"Add-MailboxFolderPermission\", \"Set-Mailbox\", \"New-ManagementRoleAssignment\")\r\n        and not(UserId has_any (\u0027NT AUTHORITY\\\\SYSTEM (Microsoft.Exchange.AdminApi.NetCore)\u0027, \u0027NT AUTHORITY\\\\SYSTEM (Microsoft.Exchange.ServiceHost)\u0027, \u0027ECAF\u0027, \u0027NT AUTHORITY\\\\SYSTEM (w3wp)\u0027, \u0027devilfish-applicationaccount\u0027) and Operation in~ (\"Add-MailboxPermission\", \"Set-Mailbox\"))\r\n    | extend timestamp = TimeGenerated, InitiatedBy = UserId, ActionAccountSrcIP = ClientIP\r\n    | project\r\n        TimeGenerated,\r\n        InitiatedByIP = iff(ClientIP contains_cs \":\", split(ClientIP, \":\")[0], split(ClientIP, \"-\")[0]),\r\n        ActionAccountSrcIP,\r\n        InitiatedBy,\r\n        RecordType,\r\n        Operation,\r\n        TargetedMbx = OfficeObjectId,\r\n        ParamsModified = Parameters\r\n    | extend client_pair = strcat(InitiatedBy, \",\", InitiatedByIP)\r\n    | where client_pair !in~ (exclusions)\r\n    // This is the App ID for the Identity-Graph-API-Connector - believed to be used for migrations\r\n    | where InitiatedBy !contains \"234797b6-5624-4e53-8f94-45c02d08e86d\"\r\n    | extend Params1 = parse_json(ParamsModified).[1].Name\r\n    | where Params1 !in~ (ParamsExcluded)\r\n    | project-away client_pair, ActionAccountSrcIP\r\n    | extend InitiatedByIP = tostring(InitiatedByIP)\r\n    // Use regex to replace the brackets found within some of the events\r\n    | extend InitiatedByIP = replace_regex(InitiatedByIP, @\"[\\[\\]]\", \"\")\r\n    | where not(\r\n            Params1 == \"GrantSendOnBehalfTo\" and InitiatedBy contains TargetedMbx and\r\n        (ipv4_is_match(\"140.16.0.0/16\", InitiatedByIP) or ipv4_is_match(\"140.17.0.0/16\", InitiatedByIP) or ipv4_is_match(\"140.24.0.0/16\", InitiatedByIP))\r\n        )\r\n    | sort by TimeGenerated asc, InitiatedBy\r\n    | extend Initiatedby_info = pack(\"TimeGenerated\", TimeGenerated, \"IPAddress\", InitiatedByIP, \"Params\", ParamsModified)\r\n    | summarize InititatedBy_Info =make_list(Initiatedby_info), Count =count() by InitiatedBy, TargetedMbx;\r\nlet userstolookup = main\r\n    | summarize make_set(InitiatedBy);\r\nmain\r\n| join kind=leftouter (userlookup\r\n    | where user in (userstolookup))\r\n    on $left.InitiatedBy == $right.[\u0027user\u0027]\r\n| extend Authorized = iff((AssignedRoles has (\"Administrator\") and InitiatedBy endswith \"dod365.onmicrosoft.us\"), \"True\", \"False\")\r\n| extend IPAddress = InititatedBy_Info.[0].IPAddress\r\n| extend ActionTaken = InititatedBy_Info.[0].Params\r\n| where AssignedRoles !contains \"Exchange Administrator\" and InitiatedBy !contains \"adm\"\r\n| project\r\n    InitiatedBy,\r\n    TargetedMbx,\r\n    IPAddress,\r\n    ActionTaken,\r\n    Count,\r\n    InitiatingUserRoles = AssignedRoles",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5H",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  [

                                                                                                           ],
                                                                                   "groupByCustomDetails":  [

                                                                                                            ]
                                                                               }
                                                 },
                       "entityMappings":  [
                                              {
                                                  "entityType":  "Account",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "AadUserId",
                                                                            "columnName":  "InitiatedBy"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "Account",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "AadUserId",
                                                                            "columnName":  "TargetedMbx"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "IP",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "Address",
                                                                            "columnName":  "IPAddress"
                                                                        }
                                                                    ]
                                              }
                                          ],
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [
                                       "Persistence",
                                       "Collection"
                                   ],
                       "techniques":  [

                                      ],
                       "displayName":  "Rare and potentially high-risk Office operations v2",
                       "enabled":  true,
                       "description":  "Identifies Office operations that are typically rare and can provide capabilities useful to attackers. Examples include; changing/modifying mailbox permissions.\nPLATFORM:Microsoft 365\nMITRE:TA0003;T1098;T1098.002",
                       "alertRuleTemplateName":  null,
                       "lastModifiedUtc":  "2024-12-10T20:36:34.5664525Z"
                   }
}
