{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/6ac4984a-7a91-4122-ad4f-db87c208aeda",
    "name":  "6ac4984a-7a91-4122-ad4f-db87c208aeda",
    "etag":  "\"8600f8ad-0000-2700-0000-66fdb6c80000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "PT1H",
                       "queryPeriod":  "PT1H",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "Medium",
                       "query":  "let lookBack = 1d;\nSigninLogs \n| where TimeGenerated \u003e= ago(lookBack)\n| where ResultType == \"50057\"\n| extend Location = strcat(LocationDetails.city, \" \", LocationDetails.state, \" \", LocationDetails.countryOrRegion)\n| summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), disabledAccountLoginAttempts = count(), \n    disabledAccountsTargeted = dcount(UserPrincipalName), applicationsTargeted = dcount(AppDisplayName), disabledAccountSet = make_set(UserPrincipalName), \n    applicationSet = make_set(AppDisplayName)\n    by IPAddress, Location\n| order by disabledAccountLoginAttempts desc\n| join kind= leftouter (\n    // Consider these IPs suspicious - and alert any related  successful sign-ins\n    SigninLogs\n    | where TimeGenerated \u003e= ago(lookBack)\n    | where ResultType == 0\n    | summarize\n        successfulAccountSigninCount = dcount(UserPrincipalName),\n        successfulAccountSigninSet = make_set(UserPrincipalName, 15)\n        by IPAddress\n    // Assume IPs associated with sign-ins from 100+ distinct user accounts are safe\n    | where successfulAccountSigninCount \u003c 100\n    )\n    on IPAddress \n| extend successfulAccountSigninCount = iif(isnotempty(successfulAccountSigninCount), successfulAccountSigninCount, 0)\n| order by disabledAccountLoginAttempts\n| extend timestamp = StartTimeUtc, IPCustomEntity = IPAddress\n// removes entries where the IP address is owned by DoD. This is to eliminate entries most likely cause by DHCP.\n| where IPCustomEntity !startswith \"140.\"\n// removes entries where there were no successful signins\n| where successfulAccountSigninCount != 0\n// expands the signin sets so theres multiple entries per successful signin user\n| mv-expand successfulAccountSigninSet\n// changes these two columns to strings rather than dynamic columns for next compare\n| extend disabledAccountSet = tostring(disabledAccountSet[0]), successfulAccountSigninSet = tostring(successfulAccountSigninSet)\n// remove entries where the successful signin is from the same user who has now had their account enabled\n| where split(disabledAccountSet, \"disable.\")[1] != successfulAccountSigninSet\n| summarize successfulAccountSigninSet = make_set(successfulAccountSigninSet) by StartTimeUtc, disabledAccountSet, successfulAccountSigninCount, timestamp, IPCustomEntity, EndTimeUtc, disabledAccountLoginAttempts, disabledAccountsTargeted, tostring(applicationSet), Location\n| project-reorder StartTimeUtc, EndTimeUtc, disabledAccountSet ,disabledAccountsTargeted, disabledAccountLoginAttempts, IPCustomEntity, Location, applicationSet, successfulAccountSigninSet, timestamp",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5M",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  [

                                                                                                           ],
                                                                                   "groupByCustomDetails":  [

                                                                                                            ]
                                                                               }
                                                 },
                       "entityMappings":  [
                                              {
                                                  "entityType":  "IP",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "Address",
                                                                            "columnName":  "IPCustomEntity"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "Account",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "FullName",
                                                                            "columnName":  "disabledAccountSet"
                                                                        }
                                                                    ]
                                              }
                                          ],
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [
                                       "InitialAccess",
                                       "Persistence"
                                   ],
                       "techniques":  [
                                          "T1078",
                                          "T1098"
                                      ],
                       "displayName":  "Sign-ins from IPs that attempt sign-ins to disabled accounts",
                       "enabled":  true,
                       "description":  "Identifies IPs with failed attempts to sign in to one or more disabled accounts signed in successfully to another account.\nReferences: https://docs.microsoft.com/azure/active-directory/reports-monitoring/reference-sign-ins-error-codes\n50057 - User account is disabled. The account has been disabled by an administrator.\nPLATFORM:Azure AD,Microsoft 365,IaaS,Windows\nMITRE:TA0001;T1078;T1078.001;T1078.004,TA0006;T1110;T1110.001;T1110.002;T1110.003;T1110.004",
                       "alertRuleTemplateName":  "500c103a-0319-4d56-8e99-3cec8d860757",
                       "lastModifiedUtc":  "2024-10-02T21:10:30.2324059Z"
                   }
}
