{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/73f9efba-a305-479a-8bfc-f51e69436158",
    "name":  "73f9efba-a305-479a-8bfc-f51e69436158",
    "etag":  "\"87008c7d-0000-2700-0000-66fdc4140000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "PT5H",
                       "queryPeriod":  "PT5H",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "Medium",
                       "query":  "//Title: BAH_WEB_SHELL_ASPX\r\n//Description: Detects webshells dropped on device to obtain internal acess.\r\n//Author: Michael Gibbs\r\n//False Positive: If the website creates aspx files in the wwwroot folder it will cause FP to hit on file drop.\r\nlet signInLookup=(\r\nSigninLogs\r\n|where TimeGenerated\u003e=ago(1d)\r\n|where DeviceDetail contains \"displayName\"\r\n|extend DeviceDetailJson=parse_json(DeviceDetail)\r\n|extend DeviceNameSI=tostring(DeviceDetailJson.displayName)\r\n|distinct DeviceNameSI,UserPrincipalName,UserDisplayName\r\n);\r\nlet devicefile = DeviceFileEvents\r\n| where ActionType == \"FileCreated\"\r\n| where FileName endswith \".aspx\" or FileName endswith \".asp\"\r\n| where FolderPath has \"\\\\wwwroot\"\r\n| extend folderName=(parse_json(FolderPath)).DirectoryPath\r\n| where folderName endswith \"\\\\wwwroot\"; //can generate fp if uses as folder for files\r\nlet compiling = DeviceFileEvents \r\n| where FileName =~ @\"csc.exe\" \r\n| where InitiatingProcessFileName =~ \"w3wp.exe\"; // dot net compiling from web\r\nlet deviceevents = DeviceEvents\r\n| where ProcessCommandLine contains \"moveitdmz pool\"; //movieit exploit usage\r\nunion deviceevents, devicefile, compiling\r\n//| project TimeGenerated, ProcessCommandLine, FileName, folderName;\r\n|extend SILogDeviceName=toupper((split(DeviceName,\".\"))[0])\r\n|join kind=leftouter signInLookup on $left.SILogDeviceName==$right.DeviceNameSI\r\n|project DeviceName,InitiatingProcessAccountDomain,InitiatingProcessAccountName,UserDisplayName",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5M",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  null,
                                                                                   "groupByCustomDetails":  null
                                                                               }
                                                 },
                       "entityMappings":  [
                                              {
                                                  "entityType":  "Account",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "FullName",
                                                                            "columnName":  "UserDisplayName"
                                                                        }
                                                                    ]
                                              }
                                          ],
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [
                                       "InitialAccess",
                                       "Persistence"
                                   ],
                       "techniques":  [
                                          "T1190",
                                          "T1505"
                                      ],
                       "displayName":  "BAH_WEB_SHELL_ASPX",
                       "enabled":  true,
                       "description":  "Adversaries may backdoor web servers with web shells to establish persistent access to systems. A Web shell is a Web script that is placed on an openly accessible Web server to allow an adversary to use the Web server as a gateway into a network. A Web shell may provide a set of functions to execute or a command-line interface on the system that hosts the Web server. Adversaries may interact with aspx files to upload or to take advantage of to have command line access to the system.\nRecently, the MOVEit Transfer vulnerability report from CISA came out showing increase in internet facing applications being exploited by cl0p ransomware group, which was the focus point for the analytic and hunt cycle.\nPLATFORM:Windows\nMITRE:TA0001;T1190,TA0004;T1505",
                       "alertRuleTemplateName":  null,
                       "lastModifiedUtc":  "2024-10-02T22:07:15.5569522Z"
                   }
}
