{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/b39b6434-f72f-4221-93bf-8950f7a6260a",
    "name":  "b39b6434-f72f-4221-93bf-8950f7a6260a",
    "etag":  "\"8700ceed-0000-2700-0000-66fdcb530000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "PT1H",
                       "queryPeriod":  "PT1H",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "Medium",
                       "query":  "//Title: BAH_DownloadedFileEvents\n//Author: Steven Wan, Ginna Woo\n//Description: Looks for instances of anomalous file downloads or access where the file extension may be involved with suspcious behavior or activity. Pairs together with BehaviorAnalytics table to set investigation priority threshold which can be changed. Associated with MITRE attack technique via User Execution | Malicious File\n\nlet CAE = (CloudAppEvents\n    | where (ActionType == \"FileDownloaded\" or ActionType == \"FileAccessed\")\n    | extend FileName = RawEventData.SourceFileName\n    | evaluate bag_unpack(RawEventData, columnsConflict=\"replace_source\")\n    | extend SourceFileExtension = column_ifexists(\"SourceFileExtension\", \"\")\n    | where SourceFileExtension has_any(\"EXE\", \"SCR\", \"VBS\", \"RTF\", \"ps1\", \"RAR\", \"dll\", \"jar\", \"lnk\", \"doc\", \"pdf\")\n    | extend SiteUrl = column_ifexists(\"SiteUrl\", \"\")\n    | extend FileLabel = column_ifexists(\"SensitivityLabelId\", \"\")\n    | extend SiteLabel = column_ifexists(\"SiteSensitivityLabelId\", \"\")\n    | extend UserId = tostring(column_ifexists(\"UserId\",\"\"))\n    | summarize arg_max (TimeGenerated, *) by AccountObjectId,UserId\n    | project TimeGenerated,AccountObjectId, UserId, AccountDisplayName,SourceFileExtension,ObjectName,ActionType,IPAddress,Application,FileLabel,SiteUrl);\nlet BA = (BehaviorAnalytics\n| evaluate bag_unpack(UsersInsights, columnsConflict=\"replace_source\")\n| evaluate bag_unpack(ActivityInsights, columnsConflict=\"replace_source\")\n| extend UserId = tostring(UserPrincipalName)\n| where InvestigationPriority \u003e= 6//adjust threshold\n| extend ActionUncommonlyPerformedByUser = column_ifexists(\"ActionUncommonlyPerformedByUser\",\"\")\n| where ActionUncommonlyPerformedByUser == \"True\"\n| extend AccountObjectID = column_ifexists(\"AccountObjectID\",\"\")\n| extend AccountDomain = column_ifexists(\"AccountDomain\",\"\")\n| extend OnPremisesSID = column_ifexists(\"AccountObjectID\",\"\")\n| extend Resource = column_ifexists(\"Resource\",\"\")\n| extend App = column_ifexists(\"App\",\"\")\n| project-away AccountObjectID,ActionType,ActivityType,TimeProcessed, UserPrincipalName,UserName,EventSource,DevicesInsights,Type,AccountDomain, OnPremisesSID,Resource,App,TenantId,SourceRecordId);\nCAE\n| join kind=inner (BA) on $left.UserId==$right.UserId\n| extend AccountDisplayName1 = column_ifexists(\"AccountDisplayName1\",\"\")\n| where ObjectName !contains \"https://dod365-my.sharepoint-mil.us/personal\"\n| project-away UserId1, AccountDisplayName1;",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  true,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5M",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  null,
                                                                                   "groupByCustomDetails":  null
                                                                               }
                                                 },
                       "entityMappings":  [
                                              {
                                                  "entityType":  "Account",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "DisplayName",
                                                                            "columnName":  "AccountDisplayName"
                                                                        },
                                                                        {
                                                                            "identifier":  "Name",
                                                                            "columnName":  "UserId"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "File",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "Name",
                                                                            "columnName":  "ObjectName"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "IP",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "Address",
                                                                            "columnName":  "IPAddress"
                                                                        }
                                                                    ]
                                              }
                                          ],
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [
                                       "Execution"
                                   ],
                       "techniques":  [
                                          "T1204"
                                      ],
                       "displayName":  "BAH_DownloadedFileEvents",
                       "enabled":  true,
                       "description":  "Looks for instances of anomalous file downloads or access where the file extension may be involved with suspcious behavior or activity. Pairs together with BehaviorAnalytics table to set investigation priority threshold which can be changed. Associated with MITRE attack technique via User Execution | Malicious File\nPLATFORM:Microsoft 365\nMITRE:TA0002;T1204",
                       "alertRuleTemplateName":  null,
                       "lastModifiedUtc":  "2024-10-02T22:38:09.58033Z"
                   }
}
