{
    "id":  "/subscriptions/41de2c2e-1ec0-4d1b-b768-edd976cdd8fe/resourceGroups/dod365-law-rg2/providers/Microsoft.OperationalInsights/workspaces/dod365-law/providers/Microsoft.SecurityInsights/alertRules/e7f12b25-ab14-42a4-92a9-44f3eaf82bb9",
    "name":  "e7f12b25-ab14-42a4-92a9-44f3eaf82bb9",
    "etag":  "\"87002ada-0000-2700-0000-66fdca230000\"",
    "type":  "Microsoft.SecurityInsights/alertRules",
    "kind":  "Scheduled",
    "properties":  {
                       "queryFrequency":  "PT30M",
                       "queryPeriod":  "PT30M",
                       "triggerOperator":  "GreaterThan",
                       "triggerThreshold":  0,
                       "severity":  "Medium",
                       "query":  "// Author: Robert Russell\r\n// Description: This analytic detects activity related to HyperBro detailed in the CISA report at the following link\r\n// https://www.cisa.gov/uscert/ncas/analysis-reports/ar22-277b\r\n// According to CISA \"CISA analyzed 4 files associated with HyperBro malware. The files creates a backdoor program that is capable of uploading and downloading files to and from the system. The RAT is also capable of logging keystrokes and executing commands on the system.\"\r\n// The following analytic detects 4 different behaviors related to HyperBro\r\n// 1 HyperBro User Agent signature\r\n// 2 HyperBro registry behavior\r\n// 3 HyperBro process behavior\r\n// 4 HyperBro network behavior\r\n// MITRE Tactics\r\n// T1543.003 Persistence\r\n// T1574.002 Hijack Execution Flow\r\n// T1567.000 Exfiltration\r\n// T1560.000 Collection\r\n// False Positives: The registry, process, and network behavior are fairly specific and should not produce false positives. The user agent activity could produce false positives and when seen without other Hyperbro related activity should be considered a false positive. As of 12/20/2022 this user agent was not seen in the MDE data available.\r\nlet signInLookup = ( // used with MDE device logs to get last signed in user for a device\r\nSigninLogs \r\n| where TimeGenerated \u003e= ago(1d)\r\n| where DeviceDetail contains \"displayName\"\r\n| extend DeviceDetailJson = parse_json(DeviceDetail)\r\n| extend DeviceNameSI = tostring(DeviceDetailJson.displayName)\r\n| distinct DeviceNameSI, UserPrincipalName, UserDisplayName\r\n);\r\n(union isfuzzy=True\r\n    (\r\n        (union isfuzzy=True // Behavior 1 user agent activity\r\n            (\r\n            OfficeActivity\r\n            | where isnotempty(UserAgent) and UserAgent startswith \"Mozilla/5.0\" // looks for non empty UAs and ones that start with Mozilla/5.0\r\n            | extend UserAgent = iif(UserAgent contains \u0027%\u0027, url_decode(UserAgent), UserAgent) // If it contiains a percent attempt ot url decode it\r\n            | where UserAgent == @\"Mozilla/5.0 (Windows NT 6.3; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/34.0.1847.116 Safari/537.36\"\r\n            | project UserPrincipalName = UserId, UserAgent, Note=\"HyperBro User Agent Activity\"\r\n            ),\r\n            (\r\n            SigninLogs\r\n            | where isnotempty(UserAgent) and UserAgent startswith \"Mozilla/5.0\" // looks for non empty UAs and ones that start with Mozilla/5.0\r\n            | extend UserAgent = iif(UserAgent contains \u0027%\u0027, url_decode(UserAgent), UserAgent) // If it contiains a percent attempt ot url decode it\r\n            | where UserAgent == @\"Mozilla/5.0 (Windows NT 6.3; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/34.0.1847.116 Safari/537.36\"\r\n            | project UserPrincipalName, UserAgent, Note=\"HyperBro User Agent Activity\"\r\n            )\r\n        )\r\n    ),\r\n    (\r\n    DeviceRegistryEvents // Behavior 2 registry activity\r\n    | where ActionType has_any (\"RegistryKeyCreated\",\"RegistryValueSet\")\r\n    | where RegistryKey contains \"windefenders\"\r\n    | extend SILogDeviceName = toupper((split(DeviceName, \".\"))[0])\r\n    | join kind=leftouter signInLookup on $left.SILogDeviceName == $right.DeviceNameSI\r\n    | project UserPrincipalName, DeviceName, RegistryKey, Note=\"HyperBro Registry Activity\"\r\n    ),\r\n    (\r\n    DeviceProcessEvents // Behavior 3 process activity\r\n    | where FolderPath has_any (\"msmpeng.exe\", \"mpsvc.dll\") and not (FolderPath has_any (@\"\\Program Files\\Windows Defender\\\", @\"\\ProgramData\\Microsoft\\Windows Defender\\\"))\r\n    | extend SILogDeviceName = toupper((split(DeviceName, \".\"))[0])\r\n    | join kind=leftouter signInLookup on $left.SILogDeviceName == $right.DeviceNameSI\r\n    | project UserPrincipalName, DeviceName, FolderPath, Note=\"HyperBro Process Activity\"\r\n    ),\r\n    (\r\n    DeviceNetworkEvents // Behavior 3 network activity\r\n    | where InitiatingProcessFileName has_any (\"msmpeng.exe\", \"mpsvc.dll\") and not (InitiatingProcessFolderPath has_any (@\"\\Program Files\\Windows Defender\\\", @\"\\ProgramData\\Microsoft\\Windows Defender\\\"))\r\n    | extend SILogDeviceName = toupper((split(DeviceName, \".\"))[0])\r\n    | join kind=leftouter signInLookup on $left.SILogDeviceName == $right.DeviceNameSI\r\n    | project UserPrincipalName, DeviceName, InitiatingProcessFileName, RemoteIP, RemotePort, RemoteUrl, Note=\"HyperBro Network Activity\"\r\n    )\r\n)",
                       "suppressionDuration":  "PT5H",
                       "suppressionEnabled":  false,
                       "incidentConfiguration":  {
                                                     "createIncident":  false,
                                                     "groupingConfiguration":  {
                                                                                   "enabled":  false,
                                                                                   "reopenClosedIncident":  false,
                                                                                   "lookbackDuration":  "PT5H",
                                                                                   "matchingMethod":  "AllEntities",
                                                                                   "groupByEntities":  [

                                                                                                       ],
                                                                                   "groupByAlertDetails":  [

                                                                                                           ],
                                                                                   "groupByCustomDetails":  [

                                                                                                            ]
                                                                               }
                                                 },
                       "entityMappings":  [
                                              {
                                                  "entityType":  "Account",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "Name",
                                                                            "columnName":  "UserPrincipalName"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "Host",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "HostName",
                                                                            "columnName":  "DeviceName"
                                                                        }
                                                                    ]
                                              },
                                              {
                                                  "entityType":  "IP",
                                                  "fieldMappings":  [
                                                                        {
                                                                            "identifier":  "Address",
                                                                            "columnName":  "RemoteIP"
                                                                        }
                                                                    ]
                                              }
                                          ],
                       "eventGroupingSettings":  {
                                                     "aggregationKind":  "SingleAlert"
                                                 },
                       "tactics":  [
                                       "Collection",
                                       "Exfiltration",
                                       "Persistence"
                                   ],
                       "techniques":  [
                                          "T1560",
                                          "T1567",
                                          "T1543",
                                          "T1574"
                                      ],
                       "displayName":  "BAH_HyperBro",
                       "enabled":  true,
                       "description":  "Looks for HyperBro malware activity based on the following CISA article\nhttps://www.cisa.gov/uscert/ncas/analysis-reports/ar22-277b\nPLATFORM:Windows\nMITRE:TA0003;T1543;T1574,TA0009;T1560,TA0010;T1567",
                       "alertRuleTemplateName":  null,
                       "lastModifiedUtc":  "2024-10-02T22:33:03.1013452Z"
                   }
}
