{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/ee165a1f-838f-4790-87d2-d501398d9096')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/ee165a1f-838f-4790-87d2-d501398d9096')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2023-12-01-preview",
            "properties": {
                "displayName": "CTE_Volt Typhoon LOTL Activity",
                "description": "This analytic is designed to identify and respond to sophisticated cyber threats, particularly those that employ \"living off the land\" (LOTL) techniques by utilizing built-in system tools such as ntdsutil, wevtutil, cmd.exe, and powershell.exe for nefarious activities like credential theft, lateral movement, or data exfiltration. \nIt focuses on unusual command-line patterns and file access behaviors that are often overlooked by standard security measures, aiming to provide deep insights into covert operations possibly conducted by advanced persistent threat (APT) actors, exemplified by the hypothetical \"Volt Typhoon\".        \n\nPLATFORM: Azure AD, Microsoft 365, IaaS, Windows\nMITRE:TA0002;T1047;T1059,TA0006;T1003;T1040,TA0007;T1012;T1016;T1033;T1040;T1082,TA0005;T1070;T1070.004;T1078;T1078.002,TA0009;T1074;T1074.001,TA0004;T1078;T1078.002,TA0003;T1078;T1078.002,TA0011;T1090;T1090.002;T1105,TA0008;T1570\n\nReferences:\nhttps://www.microsoft.com/en-us/security/blog/2023/05/24/volt-typhoon-targets-us-critical-infrastructure-with-living-off-the-land-techniques/\nhttps://media.defense.gov/2023/May/24/2003229517/-1/-1/0/CSA_Living_off_the_Land.PDF\nhttps://www.secureworks.com/blog/chinese-cyberespionage-group-bronze-silhouette-targets-us-government-and-defense-organizations\nhttps://attack.mitre.org/groups/G1017/\nhttps://www.cisa.gov/news-events/cybersecurity-advisories/aa23-144a\nhttps://www.securityweek.com/chinese-apt-volt-typhoon-linked-to-unkillable-soho-router-botnet/",
                "severity": "High",
                "enabled": true,
                "query": "//Volt Typhoon LOTL Activity\r\n//Author Danielle Torrence\r\n//Description: This analytic is designed to identify and respond to sophisticated cyber threats, particularly those that employ \"living off the land\" (LOTL) techniques by utilizing built-in system tools such as ntdsutil, wevtutil, cmd.exe, and powershell.exe for nefarious activities like credential theft, lateral movement, or data exfiltration. \r\n// False Postives: None Known\r\nlet knownFileHashes = dynamic([\r\n     \"f4dd44bc19c19056794d29151a5b1bb76afd502388622e24c863a8494af147dd\",\r\n    \"ef09b8ff86c276e9b475a6ae6b54f08ed77e09e169f7fc0872eb1d427ee27d31\",\r\n    \"d6ebde42457fe4b2a927ce53fc36f465f0000da931cfab9b79a36083e914ceca\",\r\n    \"472ccfb865c81704562ea95870f60c08ef00bcd2ca1d7f09352398c05be5d05d\",\r\n    \"66a19f7d2547a8a85cee7a62d0b6114fd31afdee090bd43f36b89470238393d7\",\r\n    \"3c2fe308c0a563e06263bbacf793bbe9b2259d795fcc36b953793a7e499e7f71\",\r\n    \"41e5181b9553bbe33d91ee204fe1d2ca321ac123f9147bb475c0ed32f9488597\",\r\n    \"c7fee7a3ffaf0732f42d89c4399cbff219459ae04a81fc6eff7050d53bd69b99\",\r\n    \"3a9d8bb85fbcfe92bae79d5ab18e4bca9eaf36cea70086e8d1ab85336c83945f\",\r\n    \"fe95a382b4f879830e2666473d662a24b34fccf34b6b3505ee1b62b32adafa15\",\r\n    \"ee8df354503a56c62719656fae71b3502acf9f87951c55ffd955feec90a11484\",\r\n    \"baeffeb5fdef2f42a752c65c2d2a52e84fb57efc906d981f89dd518c314e231c\",\r\n    \"b4f7c5e3f14fb57be8b5f020377b993618b6e3532a4e1eb1eae9976d4130cc74\",\r\n    \"4b0c4170601d6e922cf23b1caf096bba2fade3dfcf92f0ab895a5f0b9a310349\",\r\n    \"c0fc29a52ec3202f71f6378d9f7f9a8a3a10eb19acb8765152d758aded98c76d\",\r\n    \"d6ab36cb58c6c8c3527e788fc9239d8dcc97468b6999cf9ccd8a815c8b4a80af\",\r\n    \"9dd101caee49c692e5df193b236f8d52a07a2030eed9bd858ed3aaccb406401a\",\r\n    \"450437d49a7e5530c6fb04df2e56c3ab1553ada3712fab02bd1eeb1f1adbc267\",\r\n    \"93ce3b6d2a18829c0212542751b309dacbdc8c1d950611efe2319aa715f3a066\",\r\n    \"7939f67375e6b14dfa45ec70356e91823d12f28bbd84278992b99e0d2c12ace5\",\r\n    \"389a497f27e1dd7484325e8e02bbdf656d53d5cf2601514e9b8d8974befddf61\",\r\n    \"c4b185dbca490a7f93bc96eefb9a597684fdf532d5a04aa4d9b4d4b1552c283b\",\r\n    \"e453e6efc5a002709057d8648dbe9998a49b9a12291dee390bb61c98a58b6e95\",\r\n    \"6036390a2c81301a23c9452288e39cb34e577483d121711b6ba6230b29a3c9ff\",\r\n    \"cd69e8a25a07318b153e01bba74a1ae60f8fc28eb3d56078f448461400baa984\",\r\n    \"17506c2246551d401c43726bdaec800f8d41595d01311cf38a19140ad32da2f4\",\r\n    \"8fa3e8fdbaa6ab5a9c44720de4514f19182adc0c9c6001c19cf159b79c0ae9c2\",\r\n    \"d17317e1d5716b09cee904b8463a203dc6900d78ee2053276cc948e4f41c8295\",\r\n    \"472ccfb865c81704562ea95870f60c08ef00bcd2ca1d7f09352398c05be5d05d\",\r\n    \"3e9fc13fab3f8d8120bd01604ee50ff65a40121955a4150a6d2c007d34807642\",\r\n    \"edc0c63065e88ec96197c8d7a40662a15a812a9583dc6c82b18ecd7e43b13b70\"\r\n]);\r\nlet knownFileNames = dynamic([\r\n    \"backup.bat\", \"BrightmetricAgent.exe\", \"cl64.exe\", \"update.bat\", \"Win.exe\",\r\n    \"billagent.exe\", \"nc.exe\", \"update.exe\", \"WmiPrvSE.exe\",\r\n    \"billaudit.exe\", \"rar.exe\", \"vm3dservice.exe\", \"WmiPreSV.exe\",\r\n    \"cisco_up.exe\", \"SMSvcService.exe\", \"watchdogd.exe\"\r\n]);\r\nlet knownMaliciousCommands =  dynamic([\r\n    'cmd.exe /C \"wmic path win32_logicaldisk get caption,filesystem,freespace,size,volumename\"',\r\n    'cmd /c vssadmin create shadow /for=C:',\r\n    'cmd /c copy \\\\\\\\?\\\\GLOBALROOT\\\\Device\\\\HarddiskVolumeShadowCopy3\\\\Windows\\\\NTDS\\\\ntds.dit C:\\\\Windows\\\\Temp',\r\n    'wmic process call create \"ntdsutil \\\\\"ac i ntds\\\\\" ifm \\\\\"create full C:\\\\Windows\\\\Temp\\\\pro\\\\\"\"',\r\n    'wmic process call create \"cmd.exe /c ntdsutil \\\\\"ac i ntds\\\\\" ifm \\\\\"create full C:\\\\Windows\\\\Temp\\\\Pro\\\\\"\"',\r\n    'wmic process call create \"cmd.exe /c mkdir C:\\\\Windows\\\\Temp\\\\tmp & ntdsutil \\\\\"ac i ntds\\\\\" ifm \\\\\"create full C:\\\\Windows\\\\Temp\\\\tmp\\\\\"\"',\r\n    'cmd.exe /c \"netsh interface portproxy add v4tov4 listenaddress=0.0.0.0 listenport=9999 connectaddress=<rfc1918 internal ip address> connectport=8443 protocol=tcp\"',\r\n    'cmd.exe /c netsh interface portproxy add v4tov4 listenport=50100 listenaddress=0.0.0.0 connectport=1433 connectaddress=<*.*.*.*>',\r\n    'cmd.exe /Q /c dir 1> \\\\\\\\127.0.0.1\\\\ADMIN$\\\\__* 2>&1',\r\n    'reg query hklm\\\\software\\\\OpenSSH',\r\n    'reg query hklm\\\\software\\\\realvnc',\r\n    'reg query hkcu\\\\software\\\\*\\\\putty\\\\sessions',\r\n    'cmd.exe /c powershell -exec bypass -W hidden -nop -E *',\r\n    'cmd.exe /c ntdsutil \"ac i ntds\" ifm \"create full C:\\\\Windows\\\\Temp\\\\pro\" q q',\r\n    'rundll32.exe \"C:\\\\Windows\\\\System32\\\\comsvcs.dll\", MiniDump 552 C:\\\\Windows\\\\Temp\\\\vmware-vhost.dmp full\"',\r\n    'cmd.exe /c ntdsutil \"ac i ntds\" ifm \"create full C:\\\\Windows\\\\Temp\\\\pro\" q q'\r\n]);\r\nlet suspiciousPaths = dynamic([\r\n    \"C:\\\\Users\\\\Public\\\\Appfile\",\r\n    \"C:\\\\Perflogs\",\r\n    \"C:\\\\Windows\\\\Temp\",\r\n    \"C:\\\\Windows\\\\Temp\\\\McAfee_Logs\"\r\n]);\r\nlet securityEvents = SecurityEvent\r\n| where EventID in (4688, 4663, 4624, 4656, 4657, 4673)\r\n| extend CommandLine = tostring(parse_json(EventData).CommandLine)\r\n| extend ProcessName = tostring(split(CommandLine, ' ')[0])\r\n| extend FileName = tostring(split(CommandLine, ' ')[-1])\r\n| where CommandLine has_any (knownMaliciousCommands)\r\n| project TimeGenerated, Computer, Account, CommandLine, ProcessName, FileName;\r\nlet deviceFileEvents = DeviceFileEvents\r\n| where FileName endswith \".exe\" or FileName endswith \".bat\"\r\n| where FolderPath has_any (suspiciousPaths)\r\n| where SHA256 has_any (knownFileHashes)\r\n| project FileAccessTime = TimeGenerated, FileAccessedFileName = FileName, FileAccessedFolderPath = FolderPath, DeviceName, InitiatingProcessAccountName, SHA256;\r\nSecurityEvent\r\n| join kind=inner (DeviceFileEvents) on $left.Computer == $right.DeviceName and $left.Account == $right.InitiatingProcessAccountName\r\n| summarize Commands = make_set(CommandLine), AccessedFiles = make_set(FileName), AccessedPaths = make_set(FolderPath), Hashes = make_set(SHA256) by Account, Computer, bin(TimeGenerated, 1h)\r\n| order by TimeGenerated desc;\r\n\r\n\r\n\r\n\r\n",
                "queryFrequency": "PT5M",
                "queryPeriod": "PT5M",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT5H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": [
                    "Execution",
                    "CredentialAccess",
                    "Discovery",
                    "DefenseEvasion",
                    "Collection",
                    "PrivilegeEscalation",
                    "Persistence",
                    "CommandAndControl",
                    "LateralMovement"
                ],
                "techniques": [
                    "T1059",
                    "T1003",
                    "T1082",
                    "T1047",
                    "T1033",
                    "T1016",
                    "T1012",
                    "T1040",
                    "T1070",
                    "T1078",
                    "T1074",
                    "T1090",
                    "T1105",
                    "T1570"
                ],
                "subTechniques": [
                    "T1078.002",
                    "T1070.004",
                    "T1074.001",
                    "T1090.002"
                ],
                "alertRuleTemplateName": null,
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5H",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": [],
                        "groupByCustomDetails": []
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": {
                    "alertDynamicProperties": []
                },
                "customDetails": {},
                "entityMappings": null,
                "sentinelEntitiesMappings": null,
                "templateVersion": null
            }
        }
    ]
}